{
  "artist_name": "Bon Jovi",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/music/pop/bon-jovi-best-pop-star-1987-1235824745/",
      "source": "billboard",
      "artist_name": "Bon Jovi",
      "title": "Billboard’s Greatest Pop Star of 1987: Bon Jovi",
      "content": "---\ntitle: Billboard’s Greatest Pop Star of 1987: Bon Jovi\nauthor: Al Shipley\nurl: https://www.billboard.com/music/pop/bon-jovi-best-pop-star-1987-1235824745/\nhostname: billboard.com\ndescription: Bon Jovi is Billboard's Greatest Pop Star of 1987 for how they brought hard rock to the highest of MTV-era pop heights.\nsitename: Billboard\ndate: 2024-11-26\ncategories: ['Pop']\ntags: ['Greatest Pop Stars by Year']\n---\n(In 2018, the Billboard staff released a list project of its choices for the Greatest Pop Star of every year, going back to 1981. Read our entry below on why Bon Jovi was our Greatest Pop Star of 1987 — with our ’87 Honorable Mention runner-ups, Rookie of the Year and Comeback of the Year pop stars at the bottom — and find the rest of our picks for every year up to present day here.)\nHair metal, glam rock, pop metal — whatever you want to call it, the big hooks and big hair that dominated hard rock in the Reagan years reached its apex in 1987. Guns N’ Roses and Def Leppard released career-defining albums, Aerosmith staged a major comeback, and Motley Crue went multi-platinum. But nobody ruled the charts like Bon Jovi, whose 1986 album Slippery When Wet spent eight weeks at No. 1 on the Billboard 200 and topped the year-end chart for 1987, while the single “Livin’ on a Prayer” was the year’s longest-reigning Hot 100 chart-topper.\nTrending on Billboard\nIf any rock frontman was ever going to be crowned the biggest pop star of his time, it’s the man born John Bongiovi. Although he changed his name to a snappier phonetic spelling, the kid from New Jersey had everything else going for him from day one: a movie-star smile, a big voice, and a cousin, Tony Bongiovi, who owned the New York studio The Power Station and let him record demos after hours.\nUnlike other hair metal heroes who moved to L.A. to make it on the Sunset Strip, Jon Bon Jovi kickstarted his career on his home turf, like his Jersey idol Bruce Springsteen. Recording his first hit, 1984’s “Runaway” — with a lineup of session musicians that included E Street Band keyboardist Roy Bittan and eventual longtime JBJ sideman guitarist Richie Sambora — Bon Jovi got the song on local radio, signed a record deal, and formed his eponymous band. But their momentum stalled when their second album failed to yield another hit as big as “Runaway.” Bon Jovi’s third album became their make-or-break moment, much as Born to Run had been for Springsteen.\nThe group enlisted the help of veteran songwriter Desmond Child, who’d helped Kiss capitalize on disco with 1979’s “I Was Made for Lovin’ You,” and was already an expert at merging hard rock with pop hooks. The four songs he co-wrote on Slippery When Wet, including its first two singles, were just what Bon Jovi needed. The album debuted on the Billboard 200 at No. 45 after its August release, just below where the band’s first two albums had peaked. But within six weeks, the album had steadily risen to No. 1, and a few weeks later “You Give Love a Bad Name” topped the Hot 100. Then stadium singalong anthem “Livin’ on a Prayer” came out, becoming the group’s second consecutive No. 1 in February — by which point Slippery had already returned to the top of the charts, staying there for seven weeks.\nJon Bon Jovi was a clean cut prom king compared to, say, the sleazier likes of Motley Crue or Guns N’ Roses. But Bon Jovi bucked the hair metal formula in one way: they didn’t need a power ballad to take their career to the next level. Both of the album’s No. 1 singles were fist-pumping anthems, and the third top 10 hit, “Wanted Dead or Alive,” rocked even harder at a slightly slower tempo. Burnt out by the whirlwind tour in support of the album, Bon Jovi never shot a video for the lighter-waving “Never Say Goodbye,” which was released as the album’s fourth single only in certain territories outside the U.S. (The videos for the album’s first three singles — largely tour-shot affairs, helmed by MTV fixture Wayne Isham, featuring the band as larger-than-life live phenoms — were among the channel’s most unavoidable clips of the era.)\nAt a time when the biggest pop singers were releasing six or seven singles from each album, Bon Jovi bested them with a simple campaign of three songs and three videos. They’d repeat their success with 1988’s New Jersey, another No. 1 album with two No. 1 singles, and continue a steady stream of chart-topping albums and arena tours for the next three decades. But the trio of hits from Slippery When Wet so perfectly encapsulated Bon Jovi’s sound and image that they’ve never been eclipsed as the band’s lasting legacy.\nHonorable Mention: Michael Jackson (Bad, “Bad,” “The Way You Make Me Feel”), U2 (The Joshua Tree, “With Or Without You,” “I Still Haven’t Found What I’m Looking For”), Whitney Houston (Whitney, “I Wanna Dance With Somebody,” “Didn’t We Almost Have It All”)\nRookie of the Year: Debbie Gibson\nDebbie Gibson had been writing her own songs for years before she caught the attention of Atlantic Records and released her debut album Out of the Blue two weeks before her 17th birthday. The pop prodigy soon became a teen sensation, and a more wholesome rival to Madonna, with debut LP Out of the Blue spawning the top 5 singles “Only In My Dreams” and “Shake Your Love.” The chart-topping torch song “Foolish Beat” followed the next year, earning Gibson Guinness recognition as the youngest artist to write, produce and perform a No. 1 single.\nComeback of the Year: Herb Alpert\nHerb Alpert had top 5 hits in three different decades, each time with a radically different sound: In 1968, the Tijuana Brass trumpeter hit No. 1 crooning the Bacharach and David song “This Guy’s in Love with You,” and he topped the Hot 100 again in 1979 with the funky instrumental “Rise.” In 1987, he scored yet another comeback with the No. 5-peaking dance-pop smash “Diamonds,” and its top 40 ballad follow-up “Making Love in the Rain” — both produced by Jimmy Jam & Terry Lewis, with vocals by Janet Jackson and Lisa Keith.\n(Read on to our Greatest Pop Star of 1988 here, or head back to the full list here.)",
      "author": "Al Shipley",
      "published_date": "2024-11-26",
      "word_count": 1061,
      "fetch_timestamp": "2025-08-20T16:00:42.347918",
      "metadata": {
        "char_count": 6094,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:00:42.347898"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/my-chemical-romance-bon-jovi-livin-on-a-prayer-new-jersey-1236040304/",
      "source": "billboard",
      "artist_name": "Bon Jovi",
      "title": "My Chemical Romance Cover Bon Jovi’s ‘Livin’ on a Prayer’ During New Jersey Show",
      "content": "---\ntitle: My Chemical Romance Cover Bon Jovi’s ‘Livin’ on a Prayer’ During New Jersey Show\nauthor: Tyler Jenke\nurl: https://www.billboard.com/music/music-news/my-chemical-romance-bon-jovi-livin-on-a-prayer-new-jersey-1236040304/\nhostname: billboard.com\ndescription: As New Jersey locals My Chemical Romance returned home with a headline show, the group paid tribute to one of the state's other iconic acts, Bon Jovi.\nsitename: Billboard\ndate: 2025-08-11\ncategories: ['Music News']\ntags: ['Bon Jovi, jon bon jovi, My Chemical Romance']\n---\nAs New Jersey locals My Chemical Romance returned home with a headline show on Saturday night (Aug. 9), the group paid tribute to one of the state’s other iconic acts, Bon Jovi.\nPerforming at MetLife Stadium in East Rutherford, New Jersey over the weekend, the latest show in the group’s ongoing Long Live The Black Parade Tour wrapped with a special cover version of Bon Jovi’s “Livin’ on a Prayer.”\n“We’re going to play you guys what may be the New Jersey state anthem,” frontman Gerard Way explained, noting it was requested by guitarist Frank Iero after witnessing Way perform it during karaoke. “I f–king love this song,” he added.\nTrending on Billboard\nReleased in 1986 as the second single from the band’s third album, Slippery When Wet, “Livin’ on a Prayer” became the second consecutive single from the record to reach No. 1 on the Billboard 200 following “You Give Love a Bad Name.”\nAs Way suggested, the song’s lyrics and its focus on the working-class from New Jersey have seen it achieve anthemic status within the state.\nEarlier in the evening, the band’s set was interrupted by Michael Melham, the Mayor of the group’s hometown of Belleville. Melham was on hand to surprise the group by awarding them the key to the city.\n“Belleville’s musicians have entertained millions worldwide,” Melham told the crowd. “Their sound has shaped generations.\n“Yet even in our storied history in Belleville – Revolutionary War soldiers, Purple Heart recipients, a Supreme Court justice, various professional athletes – never once in the history of Belleville have we handed out a key to the city and that changes right now.”\nWay, who was reportedly unaware of the honor beforehand, accepted graciously, albeit remaining in character as The Black Parade portion of the band’s set required. “We cannot let you leave without giving you a token of our land, Draag,” he told Melham in an Eastern European accent before handing him a bundle of wheat and a “Gubric fish, from the Gubric River” in return.\nWatch My Chemical Romance cover “Livin’ on a Prayer” below.",
      "author": "Tyler Jenke",
      "published_date": "2025-08-11",
      "word_count": 416,
      "fetch_timestamp": "2025-08-20T16:00:42.429394",
      "metadata": {
        "char_count": 2596,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:00:42.429386"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/bon-jovi-armin-van-buuren-keep-the-faith-remix-official-release-ultra-music-festival-1235912117/",
      "source": "billboard",
      "artist_name": "Bon Jovi",
      "title": "Armin van Buuren on Remixing a Bon Jovi Classic: ‘He’s Not Enthusiastic About Remixes, But He Got My Draft & Said ‘This Is Insane”",
      "content": "---\ntitle: Armin van Buuren on Remixing a Bon Jovi Classic: ‘He’s Not Enthusiastic About Remixes, But He Got My Draft & Said ‘This Is Insane”\nauthor: Katie Bain\nurl: https://www.billboard.com/music/music-news/bon-jovi-armin-van-buuren-keep-the-faith-remix-official-release-ultra-music-festival-1235912117/\nhostname: billboard.com\ndescription: Dutch titan Armin van Buuren releases the official \"Keep the Faith\" edit that he and Jon Bon Jovi debuted at Ultra Music Festival last March.\nsitename: Billboard\ndate: 2025-02-28\ncategories: ['Music News']\ntags: ['Dance, Music News, rock']\n---\nThere are many things one is certain to see and hear a dance music mega-festival: fireworks, kandi bracelets, trance, house, bass, techno, wild outfits and the wide expanses of skin they reveal. No one, however, would ever expect to see rock icon Jon Bon Jovi.\nAnd thus it was a shock when the superstar turned up onstage during Armin van Buuren‘s set at Ultra Music Festival Miami last March. He’d made his first ever trip to Ultra to help the Dutch trance legend debut his remix of Bon Jovi’s classic “Keep The Faith,” the title track and lead single from the band’s 1992 album, which was the group’s fifth studio LP.\nBon Jovi fans will understand why van Buuren’s edit worked so well, with the original six-minute anthem possessing the same sort of simmer, slow build/big-ass release structure that defines so many dance music hits.\nTrending on Billboard\nBut talking to Billboard over Zoom while on a family ski vacation in the Dolomites, van Buuren says he was “super nervous” about how the dance crowd might receive the remix, and also how die-hard Bon Jovi fans might respond to his update, which isolates the vocals and piano stabs, using them to assemble a giant build created around the punchy “faith!” lyric and sleek, frenetically arranged synth stabs. In fact, everyone liked it a lot — with the remix getting an official release today (Feb. 28) on van Buuren’s venerable Armada Music and UMG Recordings.\n“Bon Jovi songs have had some unique and epic moments over the years, but this is truly a\nhighlight,” Jon Bon Jovi says in a statement. “Armin is a total pro, and I was thrilled to work with him on the track. I had such a blast at my first Ultra, the crowd was absolutely electric. Thanks to Armin for\nhaving me.”\nHere, van Buuren discusses how the dance version of “Keep the Faith” came to be, and why — in the case of Jon Bon Jovi — he was very happy to meet his idol.\nWhat are your early memories of Bon Jovi?\nBon Jovi was literally everywhere, especially in the Netherlands; he was super popular. The way we consume music is now radically different now of course. We all have all these beautiful apps and [streaming platforms] but back in the day, it was all record stores and vinyl and the top 40 radio show and, Bon Jovi was the cool dude. He always looked so cool in pictures. I remember buying his records at my local record store and driving home with them and adding another CD to my collection.\nHow did you first link with Jon Bon Jovi to get the project going?\nI met up with his manager, who was a friend of a friend, in L.A. … That’s how the conversation started. I asked “Can I try something?” They asked which song, and I said, “Keep The Faith.” It turned out that the first demo was a home run, and I didn’t actually change much after the very first idea. I lined up all the stems. I got a groove going. I tried updating the sounds without alienating the song, because the guitars and the song structure is already amazing. It’s a very effective song. The structure is very straightforward and very powerful, very energetic. So that made it fairly easy.\nOf all the Bon Jovi classics, why did you pick this one to remix?\nObviously, “Living on a Prayer” is the biggest Bon Jovi track. But [his team] said, “We’re okay with [anything] except that one, because it’s been done.” I got that, and his repertoire is humongous.\nThe great thing about “Keep the Faith” is that it was easy to translate into my EDM world, which always has a BPM challenge. It was 128 BPM, and obviously we sped it up. We made the tempo faster to fit my set. The original, compared to my version, doesn’t really feel a lot faster. When I started working on the mix, I told everybody to let me first get a draft version going, to make sure everybody was happy with the rough idea.\nAlso, for myself, I asked, “Is this going to persuade a crowd going crazy at Ultra Music Festival? All of a sudden they hear all these guitars coming in and Bon Jovi onstage. How am I going to translate that into an Ultra world, which obviously is very challenging?” People at Ultra have a certain expectation. Dance music has a certain sound.\nHow did you actually get Jon onstage with you at Ultra?\n[While I was making it] I wasn’t even sure if Jon Bon Jovi would be up for doing a live performance, because he had problems with his vocal cords. But I didn’t know that at the time. His manager told me there was a chance [he would come], and that she’d ask him. He actually lives close to Miami, so I asked if we could persuade him to come to Ultra Music Festival.\nApparently, he’s not very enthusiastic about remixes — but he called his manager after he got the first draft of the remix and said, like, “This is insane. I love it so much, and I want to perform this live, but I can’t sing.” Then when he showed up at Ultra. We had time to take photos backstage. We had time to chat a little bit. He even gave me a gift. It was incredible.\nWhat did he give you?\nHe gave me a very special limited edition Bon Jovi jacket that I still haven’t touched to this day. I’m afraid to wear it. He was very, very nice. I mean, it’s rare, you know — I’ve met quite a few superstars in my career, and was lucky enough to work with a few superstars in the studio, and there’s always this disappointment a little bit after. You know how they say, “Don’t meet your heroes?”\nBut with Jon Bon Jovi it was the other way around. He was super nice. He was super humble. He was very interested in what I was doing, and he was like, “I don’t know much about the dance music world, but tell me.”\nThat’s so cool.\nAnd then the climax story, obviously, is that he came onstage. I told [the crowd], “He’s my childhood hero. Here he is, Mr. Jon Bon Jovi” — and completely non-planned, he started actually singing along with the song, which was so random and so great. But he couldn’t really sing, because his doctor strictly forbade him from using his vocal cords, because he just had a massive surgery on his vocal cords. So I was like, “What? He’s singing!” That was the cherry on top. But I was afraid, because I was like, “What if he hurt his vocal cords? What if he hurt his throat?”\nWe agreed that he was just going to come on, say a few words, we would vibe to the drop, and that’s it. But he sang along, and that’s super special.\nDid he say anything after about what compelled him to start singing?\nI didn’t meet him straight after, because he left and my performance lasted for another hour. But I texted him after, like, “So dude, you just started singing.” He’s like, “Yeah, I don’t know. Spur of the moment.”\nI mean, that has to be a big compliment though.\nWell, at that point he hadn’t been on a big stage for a while, so maybe he felt the energy. But you have to imagine, for me, Ultra Music Miami is always one of the most important gigs of the year. I get Bon Jovi on stage, and I’m super nervous, because I’m playing something completely new — which is always a bit uncomfortable with the crowd, because they don’t know what to expect, and they don’t know what you’ve created. And then he comes on. It was a climax, absolutely.\nThe remix seemed very well received in the moment, and then well received online when the performance video was posted to YouTube. Did you feel that momentum as you were playing it?\nYeah, but I was a little bit afraid. I mean, Bon Jovi has a lot of really big fans. Like, fans that follow him around. He’s a superstar. It’s kind of like ruining one of his paintings, in a way. It’s so out of my world. I was just afraid that people would be upset for kind of ruining the original song, because I have so much respect for the original. The the way it was produced and the way it was mastered, it just sounds so great. It’s a timeless record.\nBut then I keep telling myself that this is not supposed to replace the original version, it’s just an addition and my interpretation of his great work with the band. I think it adds to the lifespan of the song, and I hope a young generation will appreciate this.\nWas it always clear that it would become an official release?\nNo, not at all. I mean, it’s very difficult, because it’s signed to Universal. It’s a major record company, so you have to really ask politely. That’s why it took a year after the performance to come out. Because he had a documentary coming out, he had an album coming out, and obviously his release schedule can’t be interfered with, so you have to be very delicate.\nBut that’s all up to management, and I wasn’t involved in that, but that’s the reason why it took a year. The track was done. We haven’t really changed a lot from the version I did at Ultra. We’re thinking about maybe [releasing] another more commercial or radio-friendly version — but the version we’re releasing now is the version pretty close to the version that I did at Ultra Music Festival Miami, because there’s so much demand for it.",
      "author": "Katie Bain",
      "published_date": "2025-02-28",
      "word_count": 1732,
      "fetch_timestamp": "2025-08-20T16:00:42.520582",
      "metadata": {
        "char_count": 9464,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:00:42.520573"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/jon-bon-jovi-trace-band-history-anthology-bon-jovi-forever-1235876283/",
      "source": "billboard",
      "artist_name": "Bon Jovi",
      "title": "Jon Bon Jovi to Trace Band’s History in New Anthology, ‘Bon Jovi: Forever’",
      "content": "---\ntitle: Jon Bon Jovi to Trace Band’s History in New Anthology, ‘Bon Jovi: Forever’\nauthor: Tyler Jenke\nurl: https://www.billboard.com/music/music-news/jon-bon-jovi-trace-band-history-anthology-bon-jovi-forever-1235876283/\nhostname: billboard.com\ndescription: \"I was single-minded. There was no plan B, even before there was an audience,\" Jon Bon Jovi writes in the upcoming book.\nsitename: Billboard\ndate: 2025-01-15\ncategories: ['Music News']\ntags: ['Bon Jovi, jon bon jovi']\n---\nMore than 40 years after the formation of New Jersey rock outfit Bon Jovi, the group’s frontman is set to trace the band’s history in an upcoming book.\nFittingly titled Bon Jovi: Anthology, the forthcoming volume is an extensive look into the history of the band, with Jon Bon Jovi penning a 35,000 word account of their four decades of fame, complete with hundred of photographs and memorabilia items from the band’s personal archives.\n“As band members, you share a unique bond that no one else can truly understand, not even family,” Jon Bon Jovi explains in the book. “That brotherhood comes with a long career like ours. We all felt part of something special, trusted each other, and they trusted me. I never let them down. It was always a give-and-take by everybody.”\nTrending on Billboard\nDescribed as “all-access pass to the world of Bon Jovi”, Bon Jovi: Anthology is set for release in June and is available in a limited edition of 1,150 copies signed by Jon Bon Jovi. The book is also quarter-bound in black vegan leather and comes packaged in a handmade black clamshell box with a silver heart and dagger. Additionally, it includes replicas of pins and badges, tour passes, and a special chrome-colored 7″ record which features two as-yet-unannounced tracks.\n“I was single-minded. There was no plan B, even before there was an audience,” reads another passage from Jon Bon Jovi. “It was just the feeling that you got singing a song, and then playing in a band. There was something in that electricity, in the sheer sound of loud. There was something about it that captured my imagination.”\nBon Jovi first formed in New Jersey in 1983, releasing their self-titled debut album the following year. Though their first two records charted modestly, they achieved a global breakthrough when third album, Slippery When Wet, arrived in 1986 and gave the band their first No. 1 atop the Billboard 200.\nTheir 42-year career has since resulted in a total of 16 studio albums, four No. 1 singles, and induction into the Rock And Roll Hall of Fame in 2018. Bon Jovi: Forever releases in June, with pre-orders available now.",
      "author": "Tyler Jenke",
      "published_date": "2025-01-15",
      "word_count": 423,
      "fetch_timestamp": "2025-08-20T16:00:42.601079",
      "metadata": {
        "char_count": 2604,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:00:42.601071"
      }
    },
    {
      "url": "https://www.billboard.com/music/latin/pitbull-bon-jovi-bring-electrifying-collab-now-or-never-to-2024-latin-grammys-1235829849/",
      "source": "billboard",
      "artist_name": "Bon Jovi",
      "title": "Pitbull & Bon Jovi Bring Riveting Collab ‘Now Or Never’ to the 2024 Latin Grammys",
      "content": "---\ntitle: Pitbull & Bon Jovi Bring Riveting Collab ‘Now Or Never’ to the 2024 Latin Grammys\nauthor: Sigal Ratner-Arias\nurl: https://www.billboard.com/music/latin/pitbull-bon-jovi-bring-electrifying-collab-now-or-never-to-2024-latin-grammys-1235829849/\nhostname: billboard.com\ndescription: The song, a remix of the rocker's classic ‘It’s My Life,' was released today (Nov. 14)\nsitename: Billboard\ndate: 2024-11-15\ncategories: ['Latin']\ntags: ['Latin GRAMMY Awards']\n---\nMiami and New Jersey came together at the 25th anniversary of the Latin Grammys, as global superstar Pitbull and Bon Jovi performed their newly released “Now Or Never,” a remix of the band’s classic “It’s My Life,” at the Thursday night (Nov. 14) ceremony.\nThe Cuban-American rapper and singer, and the legendary American rock star, lit the stage with their riveting performance, while the audience bopped their heads singing.\nPitbull and Jon Bon Jovi struck up a friendship after meeting at the 2017 Songwriters Hall of Fame induction and awards ceremony. Since then, they notably hit the stage together last April at the Hollywood Bowl for a duet of “Thank God & Jimmy Buffett” during the Keep The Party Going: A Tribute To Jimmy Buffett. In September, Jon Bon Jovi surprised Pitbull’s fans at the Jones Beach Theater, during the New York stop of his Party After Dark Tour, where they sang “It’s My Life” together for the very first time.\nTrending on Billboard\nNow, they give the song a spin with their new remix. In “Now Or Never,” the track’s instantly recognizable riff and chorus ring out as powerfully as ever, with Pitbull adding fresh verses like “Me, I am a man of my word, and I live it” and “Just live your life like Frank Sinatra, your way, and have no fear.”\nThe 25th anniversary of the Latin Grammy Awards can be seen on Univision, Galavisión and ViX. The ceremony is set to feature performances from Alejandro Fernández, Becky G, Carín León, Eladio Carrión, Jon Bon Jovi, Kali Uchis and Residente, among others. For a second year in a row, songwriter and producer Edgar Barrera leads the list of nominees with nine nods. He is followed by superstars Karol G and Bad Bunny, who got eight mentions each. To see the updating list of winners, click here.\nFor more updates on performances, special awards and behind-the-scenes action from the night, check out Billboard.com.",
      "author": "Sigal Ratner-Arias",
      "published_date": "2024-11-15",
      "word_count": 377,
      "fetch_timestamp": "2025-08-20T16:00:42.682683",
      "metadata": {
        "char_count": 2355,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:00:42.682674"
      }
    },
    {
      "url": "https://www.billboard.com/music/latin/bon-jovi-pitbull-now-or-never-song-its-my-life-remix-announcement-1235818533/",
      "source": "billboard",
      "artist_name": "Bon Jovi",
      "title": "Bon Jovi & Pitbull Announce Collab ‘Now Or Never,’ a Remix of the Classic ‘It’s My Life’",
      "content": "---\ntitle: Bon Jovi & Pitbull Announce Collab ‘Now Or Never,’ a Remix of the Classic ‘It’s My Life’\nauthor: Sigal Ratner-Arias\nurl: https://www.billboard.com/music/latin/bon-jovi-pitbull-now-or-never-song-its-my-life-remix-announcement-1235818533/\nhostname: billboard.com\ndescription: Bon Jovi and Pitbull are collaborating on \"Now Or Never,\" a remix of the band's classic \"It’s My Life.\" The new track will arrive on Nov. 14.\nsitename: Billboard\ndate: 2024-11-04\ncategories: ['Latin']\ntags: ['Latin, Music News, rock']\n---\nMiami and New Jersey come together as global superstar Pitbull joins forces with Bon Jovi again for a new remix of the band’s classic “It’s My Life,” Billboard Español can announce. The collaboration, titled “Now Or Never,” will be released on Nov. 14, the same day of the 2024 Latin Grammys.\nAccording to a press release, Pitbull and Jon Bon Jovi, the frontman and founding member of Bon Jovi, struck up a friendship after meeting at the 2017 Songwriters Hall of Fame induction and awards ceremony. Since then, they notably hit the stage together last April at the Hollywood Bowl for a duet of “Thank God & Jimmy Buffett” during the Keep The Party Going: A Tribute To Jimmy Buffett. And, in September, Jon Bon Jovi surprised Pitbull’s fans at the Jones Beach Theater, during the New York stop of his Party After Dark Tour, where they sang “It’s My Life” together for the very first time.\nNow, the Cuban-American rapper-singer and the New Jersey rock star are giving the song a spin with their new remix. In “Now Or Never,” the track’s instantly recognizable riff and chorus ring out as powerfully as ever, with Pitbull adding fresh verses like “Me, I am a man of my word, and I live it” and “Just live your life like Frank Sinatra, your way, and have no fear.”\nTrending on Billboard\nThe accompanying music video captures their joint performance at Jones Beach, the release release says.\n“Now Or Never” is set to arrive on the day of the 25th Annual Latin Grammy Awards, where both Pitbull and Jon Bon Jovi have been announced as a performers. Mr. Worldwide is also returning this month to Las Vegas for his 2024-2025 Vegas After Dark The Residency at the Fontainebleau.",
      "author": "Sigal Ratner-Arias",
      "published_date": "2024-11-04",
      "word_count": 361,
      "fetch_timestamp": "2025-08-20T16:00:42.779099",
      "metadata": {
        "char_count": 2194,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:00:42.779090"
      }
    },
    {
      "url": "https://www.billboard.com/music/latin/jon-bon-jovi-joe-jonas-dj-khaled-join-2024-latin-grammys-performers-1235818499/",
      "source": "billboard",
      "artist_name": "Bon Jovi",
      "title": "Jon Bon Jovi, Joe Jonas & DJ Khaled to Participate at 2024 Latin Grammys",
      "content": "---\ntitle: Jon Bon Jovi, Joe Jonas & DJ Khaled to Participate at 2024 Latin Grammys\nauthor: Sigal Ratner-Arias\nurl: https://www.billboard.com/music/latin/jon-bon-jovi-joe-jonas-dj-khaled-join-2024-latin-grammys-performers-1235818499/\nhostname: billboard.com\ndescription: The Latin Recording Academy announced additional performers for the Nov. 14 ceremony, including Ángela Aguilar, Residente, Myke Towers and more.\nsitename: Billboard\ndate: 2024-11-04\ncategories: ['Latin']\ntags: ['Latin, Latin Grammys, Music News']\n---\nGrammy-winning artists Jon Bon Jovi and DJ Khaled, as well as Grammy-nominated artist Joe Jonas, will help celebrate Latin music this month, when they perform at the 25th anniversary of the Latin Grammys.\nThe Latin Recording Academy announced on Monday (Nov. 4) additional performers for the Nov. 14 ceremony, including current nominees Ángela Aguilar, Álvaro Díaz, Tiago Iorc, Quevedo, Residente, Myke Towers, Trueno and The Warning, along with previous nominee Leonardo Aguilar.\nÁngela Aguilar is nominated for album of the year and Álvaro Díaz earned two nominations for best reggaeton performance and best urban music album. Tiago Iorc scored a nomination for best singer-songwriter song, while Quevedo is nominated for best urban song. Residente has three nominations, including album of the year and song of the year. Myke Towers has two nods in the best urban song category. Trueno is nominated for best urban fusion/performance and best urban music album, and The Warning are nominated for best rock song.\nTrending on Billboard\nPreviously announced performers include current nominees Anitta, Edgar Barrera, Becky G, David Bisbal, Eladio Carrión, DARUMAS, Emilia, Alejandro Fernández, Luis Fonsi, Leonel García, Grupo Frontera, Juan Luis Guerra, Carin León, Danny Ocean, Silvia Pérez Cruz, Carlos Rivera, Elena Rose, Ela Taubert and Kali Uchis, as well as the 2024 Latin Recording Academy Person of the Year, Carlos Vives, and previous nominees Pitbull and Reik.\nFor the second consecutive year, Mexican hitmaker Edgar Barrera leads the list of nominees with nine nods, including songwriter of the year and producer of the year. He is followed by superstars Karol G and Bad Bunny, who got eight mentions each. For a full list of nominations, click here.\nThe three-hour telecast will be produced by TelevisaUnivision, and will air live on Univision, UniMás, Galavisión and ViX from the Kaseya Center in Miami beginning at 8 p.m. ET/PT (7 p.m. Central), preceded by a one-hour pre-show starting at 7 p.m. ET/PT.\nThe Latin Grammy Premiere, where the majority of the categories are awarded, will be hosted by Latin Grammy nominees Maria Becerra, Juliana and Luísa Sonza, and will feature performances by Ale Acosta, Alok, Valeria Castro, Deorro, Fonseca, Leonel García, Grupo Niche, Draco Rosa, Rozalén and Vikina. It will be live streamed across the Latin Recording Academy platforms from the Miami Beach Convention Center beginning at 1 p.m. ET.",
      "author": "Sigal Ratner-Arias",
      "published_date": "2024-11-04",
      "word_count": 443,
      "fetch_timestamp": "2025-08-20T16:00:42.863293",
      "metadata": {
        "char_count": 2973,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:00:42.863285"
      }
    },
    {
      "url": "https://www.billboard.com/music/rock/jon-bon-jovi-endorsement-kamala-harris-president-truth-matters-1235800897/",
      "source": "billboard",
      "artist_name": "Bon Jovi",
      "title": "Jon Bon Jovi Announces His Endorsement of Kamala Harris for President: ‘The Truth Matters’",
      "content": "---\ntitle: Jon Bon Jovi Announces His Endorsement of Kamala Harris for President: ‘The Truth Matters’\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/rock/jon-bon-jovi-endorsement-kamala-harris-president-truth-matters-1235800897/\nhostname: billboard.com\ndescription: Bon Jovi singer Jon Bon Jovi announced his endorsement of Kamala Harris for president in a post in which he said 'the truth matters.'\nsitename: Billboard\ndate: 2024-10-15\ncategories: ['Rock']\ntags: ['Music News, nsfs, politics, rock']\n---\nJon Bon Jovi announced his endorsement of Democrat Kamala Harris for president in a song on Friday (Oct. 11), spotlighting the patriotic Forever tune “The People’s House” featuring the War and Treaty in an Instagram post explaining his decision.\n“The People’s House is a song that celebrates this beautiful place that we call home, from sea to shining sea. @thewarandtreaty,” Bon Jovi wrote. “The truth matters. And the truth is on election day I’ll be voting for @KamalaHarris and @TimWalz because I believe in the power of we, not of me. I’ve written a song reminding us that out of many, we are still one.”\nSecond gentleman Doug Emhoff thanked the Jersey rocker in a Bon Jovi-quoting post on X, writing, “It’s my wife, and it’s now or never. Election’s coming in November. Thanks for supporting Kamala, @JonBonJovi!” alongside a pic of him posing with the band’s singer.\nBon Jovi has long been a supporter of the Democratic party, lining up behind President Joe Biden at the current commander in chief’s 2021 inauguration day Celebrating America concert, where he performed an acoustic take on the Beatles’ “Here Comes the Sun,” as well as a pre-election I Will Vote concert that also featured Jennifer Hudson, Ciara, Ne-Yo, Sara Bareilles, A$AP Ferg, P!nk, John Legend and others.\nAfter replacing Biden following the president’s surprise decision to drop out of the race in July following a disastrous debate performance against three-time candidate Donald Trump, Harris has racked up a bumper crop of A-list endorsements. Among the chart-topping musicians lining up behind the vice president and Minnesota Gov. Tim Walz are P!nk, Billie Eilish, Charli XCX, Beyoncé, Neil Young, Stevie Wonder, Megan Thee Stallion, Olivia Rodrigo and Taylor Swift.\nTwice-impeached former president Trump reacted with his typical disdain when Swift helped cap August’s Democratic National Convention by posting a full-throated endorsement of Harris, announcing on his Truth Social platform, “I HATE TAYLOR SWIFT.”\nSee Bon Jovi’s post endorsing Kamala Harris below:",
      "author": "Gil Kaufman",
      "published_date": "2024-10-15",
      "word_count": 388,
      "fetch_timestamp": "2025-08-20T16:00:42.941728",
      "metadata": {
        "char_count": 2565,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:00:42.941720"
      }
    }
  ],
  "total_articles": 8,
  "total_words": 5201,
  "extracted_at": "2025-08-20T16:00:43.480723",
  "urls_processed": [
    "https://www.billboard.com/music/pop/bon-jovi-best-pop-star-1987-1235824745/",
    "https://www.billboard.com/music/music-news/my-chemical-romance-bon-jovi-livin-on-a-prayer-new-jersey-1236040304/",
    "https://www.billboard.com/music/music-news/bon-jovi-armin-van-buuren-keep-the-faith-remix-official-release-ultra-music-festival-1235912117/",
    "https://www.billboard.com/music/music-news/jon-bon-jovi-trace-band-history-anthology-bon-jovi-forever-1235876283/",
    "https://www.billboard.com/music/latin/pitbull-bon-jovi-bring-electrifying-collab-now-or-never-to-2024-latin-grammys-1235829849/",
    "https://www.billboard.com/music/latin/bon-jovi-pitbull-now-or-never-song-its-my-life-remix-announcement-1235818533/",
    "https://www.billboard.com/music/latin/jon-bon-jovi-joe-jonas-dj-khaled-join-2024-latin-grammys-performers-1235818499/",
    "https://www.billboard.com/music/rock/jon-bon-jovi-endorsement-kamala-harris-president-truth-matters-1235800897/"
  ]
}