{
  "artist_name": "Questlove",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/video/questlove-joseph-patel-sly-lives-documentary-billboard-in-conversation/",
      "source": "billboard",
      "artist_name": "Questlove",
      "title": "Ahmir ‘Questlove’ Thompson & Joseph Patel Discuss ‘Sly Lives!’ | Billboard in Conversation",
      "content": "---\ntitle: Ahmir ‘Questlove’ Thompson & Joseph Patel Discuss ‘Sly Lives!’ | Billboard in Conversation\nauthor: Katie Cao\nurl: https://www.billboard.com/video/questlove-joseph-patel-sly-lives-documentary-billboard-in-conversation/\nhostname: billboard.com\ndescription: Questlove and Joseph Patel talk about the 'Sly Lives!' documentary with Billboard. Watch the interview.\nsitename: Billboard\ndate: 2025-02-13\ncategories: ['Videos']\ntags: ['Billboard, genre hiphop, HuluSlyStone2025, Partner Content']\n---\nBillboard‘s Deputy Editorial Director Damien Scott spoke with Ahmir “Questlove” Thompson (executive producer and director) and Joseph Patel (producer) of Sly Lives! (aka the Burden of Black Genius) about the film’s creation and the enduring impact of Sly Stone’s legacy, both historically and in today’s culture. Check out the documentary, available now Hulu.\nDamien Scott:\nWhat’s up, everyone. I’m Damien Scott. I’m the deputy editorial director at Billboard, and today we have two very special guests. I’m joined by the Academy Award winning duo Amir “Questlove” Thompson and Joseph Patel, the director and producer of these groundbreaking work Sly Lives! I’ll say the whole title, just so everyone knows when you see it: Sly Lives! (aka the Burden of Black Genius). Thank you …\nAhmir “Questlove” Thompson:\nThank you for having us.\nDamien Scott:\n… for coming through to Billboard today. Most people know Sly Stone as an innovator. He’s the guy who essentially blended all of the popular genres together to create this newfound gumbo that became … what became basically American pop music, in a way. Why did you choose to focus on Sly right now?\nAhmir “Questlove” Thompson:\nI believe that we chose Sly or Sly chose us. Sly is in a very unique position in the American music pantheon, and Sly is essentially the first Black megastar, kind of in an era, and I’ll say this lightly with air quotes, where there was supposed to be no limits. Sly’s success is a little bit different than Ray Charles or Chuck Berry or James Brown, anyone that was entertaining during either the Reconstruction period or the Civil Rights period. So Sly is basically kind of the embodiment of what Martin Luther King’s “I Have a Dream” speech was about, like this utopian multiracial mix of Black and whites, men and women together.\nKeep watching for more!",
      "author": "Katie Cao",
      "published_date": "2025-02-13",
      "word_count": 361,
      "fetch_timestamp": "2025-08-20T16:14:48.948429",
      "metadata": {
        "char_count": 2335,
        "extraction_method": "trafilatura",
        "content_type": "interview",
        "extracted_at": "2025-08-20T16:14:48.948396"
      }
    },
    {
      "url": "https://www.billboard.com/music/awards/2025-iheartpodcast-awards-nominations-list-1235870694/",
      "source": "billboard",
      "artist_name": "Questlove",
      "title": "Questlove & Joe Budden Among Nominees for 2025 iHeartPodcast Awards: Full List",
      "content": "---\ntitle: Questlove & Joe Budden Among Nominees for 2025 iHeartPodcast Awards: Full List\nauthor: Paul Grein\nurl: https://www.billboard.com/music/awards/2025-iheartpodcast-awards-nominations-list-1235870694/\nhostname: billboard.com\ndescription: Here’s a full list of nominees for the 2025 iHeartPodcast Awards across 29 categories.\nsitename: Billboard\ndate: 2025-03-06\ncategories: ['Awards']\ntags: ['Awards, iHeartMedia, Podcasts']\n---\nUPDATE (March 6): Jack O’Brien and Miles Gray of The Daily Zeitgeist podcast are set to host the 2025 iHeartPodcast Awards Live at SXSW, which will be held on March 10 at ACL Live at The Moody Theater in Austin, Texas.\nPresenters for the event will include Annaleigh Ashford and Melissa Moore, Cam Jordan, Chelsea Handler, Dennis Quaid, Ed Helms, Georgia Hardstark and Karen Kilgiraff, Joe Manganiello, Kyle MacLachlan, Sarah Spain and Sophia Bush.\nPREVIOUSLY (Jan. 7): Song Exploder, Questlove Supreme, Popcast, The Wonder of Stevie and The Joe Budden Podcast are vying for best music at the 2025 iHeartPodcast Awards, in partnership with South by Southwest (SXSW). The annual event will take place live on March 10 at 7 p.m. CT at ACL Live at The Moody Theater in Austin, Texas. In addition to the in-person show, the ceremony will also be live-broadcasted on select iHeartMedia Radio Stations, on the iHeartRadio app and on iHeartRadio’s YouTube Channel.\nTrending on Billboard\nNew Heights With Jason & Travis Kelce is among the nominees for best sports. Travis Kelce has become a household name since he began dating pop superstar Taylor Swift. The other nominees in that category are The Herd with Colin Cowherd, The Dan Le Batard Show With Stugotz, The Bill Simmons Podcast and All the Smoke\nWinners in each category will be determined by a panel of podcast industry leaders and creatives. Each year, podcast fans help decide the winner of the podcast of the year award by voting online at the awards’ website. Fan voting will begin Tuesday, Jan. 7, and runs through Feb. 16.\nThe 2025 iHeartPodcast Awards will also present three icon awards. Sarah Spain, host of Good Game, will be honored with the 2025 social impact award for her role in championing equity in sports coverage, equal pay for female athletes and better investment in women’s sports infrastructure. Dan Taberski will be honored with the 2025 audible audio pioneer award for his influence in the podcasting landscape, including his latest podcast Hysterical (nominated for podcast of the year and more). The 2025 innovator award will honor Daniel Alarcón, a Peruvian-American journalist and novelist, for his work on The Good Whale (nominated for podcast of the year), which revisits the life of Keiko, the orca who gained fame as the star of the 1993 film Free Willy.\n“Following our in-person return to SXSW last year, we’re thrilled to be bringing the iHeartPodcast Awards to an even bigger stage in 2025,” Conal Byrne, CEO of iHeartMedia’s Digital Audio Group, said in a statement. “Podcasting is growing in both scale and influence every year, and SXSW brings a level of innovative spirit and excitement that makes it the perfect setting to celebrate the very best of our industry.”\n“We’re thrilled to once again partner with iHeartMedia for the return of the Podcast Awards, amplifying its impact within an even larger footprint at SXSW,” said Peter Lewis, SXSW chief partnerships officer. The iHeartPodcast Awards will be open to select SXSW badge holders for the first time.\nExecutive producers for the 2025 iHeartPodcast Awards are John Sykes, Tom Poleman, Conal Byrne and Bart Peters for iHeartMedia. Audible is a sponsor of the 2025 iHeartPodcast Awards.\nHere’s a full list of 2025 iHeartPodcast Award nominees across 29 categories.\nPodcast of the Year\nNormal Gossip\nThree\nGiggly Squad\nCall Her Daddy\nLas Culturistas With Matt Rogers and Bowen Yang\nHysterical\nThe Telepathy Tapes\nWho Killed JFK?\nEmpire City: The Untold Origin Story of the NYPD\nThe Good Whale\nBest Overall Host\nAlex Cooper (Call Her Daddy)\nJamie Loftus (Sixteenth Minute (of Fame))\nSabrina Tavernise (The Daily)\nMel Robbins (The Mel Robbins Podcast)\nDan Taberski (Hysterical)\nBest Overall Ensemble\nWe Can Do Hard Things\nMy Favorite Murder With Karen Kilgariff and Georgia Hardstark\nHandsome\nArmchair Expert With Dax Shepard\nThe Breakfast Club\nBest Music\nSong Exploder\nQuestlove Supreme\nPopcast\nThe Wonder of Stevie\nThe Joe Budden Podcast\nBest TV & Film\nFilms to Be Buried With With Brett Goldstein\nTwo Ts in a Pod with Teddi Mellencamp and Tamra Judge\nHow Did This Get Made?\nThe Rewatchables\nBlank Check with Griffin & David\nBest Pop Culture\nLas Culturistas With Matt Rogers and Bowen Yang\nThe World’s First Podcast With Erin & Sara Foster\nStill Processing\nKeep It!\nPop Culture Happy Hour\nBest Sports\nNew Heights With Jason & Travis Kelce\nThe Herd With Colin Cowherd\nThe Dan Le Batard Show With Stugotz\nThe Bill Simmons Podcast\nAll the Smoke\nBest Kids & Family\nGood Inside With Dr. Becky\nKoala Moon – Kids Bedtime Stories & Meditations\nSmash Boom Best: A Funny, Smart Debate Show for Kids and Family\nStory Pirates\nWow in the World\nBest Comedy\nThe Nikki Glaser Podcast\nFly on the Wall With Dana Carvey and David Spade\nNormal Gossip\nThe Joe Rogan Experience\nCall Her Daddy\nBest Spanish Language\nRadio Ambulante\nDuolingo Spanish Podcast\nLeyenda Legendarias\nMija Podcast\nEscuela Secreta\nBest Business & Finance\nPlanet Money\nHow to Money\nNetworth and Chill With Your Rich BFF\nMoney Rehab With Nicole Lapin\nThe Ramsey Show\nBest Crime\nThree\nBetrayal\nUp and Vanished\nCounterClock\nSomething Was Wrong\nBest Food\nGastropod\nChristopher Kimball’s Milk Street Radio\nBe My Guest With Ina Garten\nThe Recipe With Kenji and Deb\nThe Sporkful\nBest Wellness & Fitness\nHuberman Lab\nThe Mel Robbins Podcast\n10% Happier With Dan Harris\nA Slight Change of Plans\nWe Can Do Hard Things\nBest History\nThe Rest Is History\nEmpire City: The Untold Origin Story of the NYPD\nThroughline\nAmerican History Tellers\nYou’re Wrong About\nBest News\nThe Journal.\nThe Daily\nUp First from NPR\nPivot\nToday, Explained\nBest Fiction\nHello From the Magic Tavern\nWelcome to Night Vale\nImpact Winter\nThe Magnus Archives\nMidnight Burger\nBest Science\nHidden Brain\nStarTalk Radio\nStuff To Blow Your Mind\nOlogies With Alie Ward\nScience Vs\nBest Technology\nAll-In with Chamath, Jason, Sacks & Friedberg\nHard Fork\nBetter Offline\nDarknet Diaries\nTed Radio Hour\nBest Ad Read\nConan O’Brien Needs a Friend\nWhere Everybody Knows Your Name with Ted Danson and Woody Harrelson (Sometimes)\nMy Brother, My Brother and Me\nSmartLess\nOffice Ladies\nBest Political\nNative Land Pod\nThe NPR Politics Podcast\nPod Save America\nThe Megyn Kelly Show\nBreaking Points With Krystal and Saagar\nBest Advice/Inspirational\nWiser Than Me With Julia Louis-Dreyfus\nOn Purpose With Jay Shetty\nThe Mel Robbins Podcast\nLife Kit\nSavage Lovecast\nBest Beauty & Fashion\nNaked Beauty\nThe goop Podcast\nGlowing Up\nBreaking Beauty Podcast\nLipstick on the Rim\nBest Travel\nTravel With Rick Steves\nThe Atlas Obscura Podcast\nZero to Travel Podcast\nWomen Who Travel\nJUMP With Traveling Jackie\nBest Green\nUnf–king the Future\nEnvironmental Insights: Conversations on Policy and Practice From the Harvard Environmental Economics Program\nGreen Dreamer: Seeding Change Towards Collective Healing, Sustainability, Regeneration\nThreshold\nTED Climate\nBest Spirituality & Religion\nElevation With Steven Furtick\nOprah’s Super Soul\nWHOA That’s Good Podcast\nBible in a Year With Jack Graham\nTransformation Church\nBest Branded Podcast\nNerdwallet’s Smart Money Podcast\nInto the Mix (Ben and Jerry’s)\nSymptomatic: A Medical Mystery Podcast (Novartis)\nYou Can’t Make This Up (Netflix)\nMind the Business: Small Business Success Stories (Intuit Quickbooks)\nBest Emerging\nNot Gonna Lie With Kylie Kelce\nSo True With Caleb Hearon\nHysterical\nWild Card With Rachel Martin\nShell Game\nBest International\nThe Business of Doing Business With Dwayne Kerrigan – Canada\nMamamia Out Loud – Australia\nBetween Two Beers Podcast – New Zealand\nThe Diary of a CEO with Steven Bartlett – United Kingdom\nLas Alucines – Mexico",
      "author": "Paul Grein",
      "published_date": "2025-03-06",
      "word_count": 1296,
      "fetch_timestamp": "2025-08-20T16:14:49.025711",
      "metadata": {
        "char_count": 8067,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:14:49.025704"
      }
    },
    {
      "url": "https://www.billboard.com/music/awards/questlove-summerstage-icon-city-parks-foundation-1236025125/",
      "source": "billboard",
      "artist_name": "Questlove",
      "title": "Questlove to Be Honored With ‘SummerStage Icon Award’ at 2025 City Parks Foundation Benefit",
      "content": "---\ntitle: Questlove to Be Honored With ‘SummerStage Icon Award’ at 2025 City Parks Foundation Benefit\nauthor: Joe Lynch\nurl: https://www.billboard.com/music/awards/questlove-summerstage-icon-city-parks-foundation-1236025125/\nhostname: billboard.com\ndescription: Questlove: City Parks Foundation to honor the Roots' drummer this fall at SummerStage benefit.\nsitename: Billboard\ndate: 2025-07-18\ncategories: ['Awards']\ntags: ['Awards, genre hiphop']\n---\nThough born and raised in Philadelphia, Ahmir “Questlove” Thompson has become something of a New York City fixture ever since Jimmy Fallon brought in The Roots to be the house band on The Tonight Show Starring Jimmy Fallon more than a decade ago. If there’s a cool event in the city – a concert underplay, a charity fundraiser, a hard-to-get-into party – chances are high that Questo will be there, either as a guest enjoying himself or as a DJ providing the vibes based on his inestimable knowledge of music and music history.\nCome September, the Grammy-winning hip-hop drummer and Oscar-winning filmmaker will be honored by New York’s City Parks Foundation with the SummerStage Icon Award at its annual fundraiser. The City Parks Foundation, through its Capital One City Parks Foundation SummerStage Festival, provides free arts and cultural programs to New Yorkers and helps bring public spaces to life (CPF describes its ethos as “thriving parks mean thriving communities”).\nTrending on Billboard\nThe organization’s 2025 dinner and dance party fundraiser will take place Sept. 25 at the SummerStage venue in Manhattan’s Central Park and will wrap with a private dance party DJ’d by Questlove. Additionally, the event will find the City Parks Foundation honoring Brooklyn Sports and Entertainment (Barclays Center/New York Liberty/Brooklyn Nets owners) with the People & Parks Award. Tables and tickets for the event are available here.\nThe Roots are slated to play SummerStage at Queens’ Flushing Meadows-Corona Park this Sunday (July 20). This year’s SummerStage lineup also includes Soccer Mommy, Femi Kuti & The Positive Force, Rakim, Celia Cruz Centennial Celebration, Big Freedia, Camilo, Jessica Pratt, Bob Sinclair, IZA, Hurray for the Riff Raff, Awich, Frankie Negrón, La Sonora Poceña and Morgan Freeman’s Symphonic Blues. You can find more about the 2025 SummerStage lineup here.\nQuestlove received three Primetime Emmy nominations on Tuesday (July 15) for his work on three different programs: outstanding directing for a documentary/nonfiction program for Ladies & Gentlemen…50 Years of SNL Music; outstanding music direction for SNL50: The Homecoming Concert; and outstanding documentary or nonfiction special for Sly Lives! (Aka The Burden of Black Genius). These are his first Emmy nods.",
      "author": "Joe Lynch",
      "published_date": "2025-07-18",
      "word_count": 407,
      "fetch_timestamp": "2025-08-20T16:14:49.076320",
      "metadata": {
        "char_count": 2759,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:14:49.076313"
      }
    },
    {
      "url": "https://www.billboard.com/music/rb-hip-hop/questlove-kendrick-lamar-the-roots-gnx-video-1235979961/",
      "source": "billboard",
      "artist_name": "Questlove",
      "title": "Questlove Says He Was ‘Shocked’ to See Kendrick Lamar Pay Homage to The Roots With ‘GNX’ Video",
      "content": "---\ntitle: Questlove Says He Was ‘Shocked’ to See Kendrick Lamar Pay Homage to The Roots With ‘GNX’ Video\nauthor: Michael Saponara\nurl: https://www.billboard.com/music/rb-hip-hop/questlove-kendrick-lamar-the-roots-gnx-video-1235979961/\nhostname: billboard.com\ndescription: Questlove said he was \"shocked\" to learn that Kendrick Lamar honored The Roots in a 'GNX' video.\nsitename: Billboard\ndate: 2025-05-23\ncategories: ['R&B/Hip-Hop']\ntags: ['genre hiphop, Music News']\n---\nKendrick Lamar is a student of the rap game, and Questlove was surprised to see the West Coast hip-hop savant pay homage to The Roots with his “Squabble Up” video.\nThe Roots drummer stopped by The Jennifer Hudson Show on Thursday (May 22), where he opened up about Lamar recreating the scene from the Philly band’s 1999 “The Next Movement” video with the olive open-room set of the GNX visual.\n“I was so shocked because the way that people told me — I woke up to 30 K. Dot texts,” Questlove said. “I thought, ‘Oh no.’ He just dissed us. I thought it was something else. And they were like, ‘No, he paid tribute to y’all in this video.'”\nTrending on Billboard\nHe continued to salute Dot: “It’s an honor, but it’s also a surprise when you see people acknowledging you after all this time.”\nWhile Hudson was surprised to see Quest’s humility when it comes to the band’s influence, he explained that it’s from The Roots being “not super mainstream, but we’re niche, but we’re not overexposed popular.”\nProduced by Sounwave and Jack Antonoff, “Squabble Up” arrived as a standout on Kendrick Lamar’s GNX album in November. A Calmatic-directed visual paying homage to The Roots was released just a few days later on Nov. 25.\nThe Debbie Deb-sampling anthem debuted atop the Billboard Hot 100 to give Lamar his fifth No. 1 hit and third of 2024 at the time. GNX brought about a domination of the Hot 100, with Lamar occupying the entire top five. (“TV Off” featuring Lefty Gunplay, “Luther” with SZA, “Wacced Out Murals” and “Hey Now” featuring Dody6 came in at Nos. 2-5).\nWatch Questlove’s full interview above, and revisit the “Squabble Up” video below:",
      "author": "Michael Saponara",
      "published_date": "2025-05-23",
      "word_count": 346,
      "fetch_timestamp": "2025-08-20T16:14:49.127652",
      "metadata": {
        "char_count": 2120,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:14:49.127644"
      }
    },
    {
      "url": "https://www.billboard.com/music/awards/2025-emmy-nominees-music-categories-list-1236021589/",
      "source": "billboard",
      "artist_name": "Questlove",
      "title": "Here Are the 2025 Primetime Emmy Nominees in All 7 Music Categories: Full List",
      "content": "---\ntitle: Here Are the 2025 Primetime Emmy Nominees in All 7 Music Categories: Full List\nauthor: Paul Grein\nurl: https://www.billboard.com/music/awards/2025-emmy-nominees-music-categories-list-1236021589/\nhostname: billboard.com\ndescription: Here’s the complete list of nominees for 2025 Primetime Emmy Awards in the seven music categories, with Kendrick Lamar, Questlove and more.\nsitename: Billboard\ndate: 2025-07-15\ncategories: ['Awards']\ntags: ['Awards, Emmys, Music News, TV / Film']\n---\nKendrick Lamar and Ahmir “Questlove” Thompson are among the 2025 Primetime Emmy nominees for outstanding music direction. Lamar is nominated for The Apple Music Super Bowl LIX Halftime Show Starring Kendrick Lamar, alongside co-nominee Tony Russell. Questlove is nominated for SNL50: The Homecoming Concert, alongside co-nominee James Poyser.\nThe other nominees in the category are Rickey Minor for The Kennedy Center Honors; Michael Bearden for The Oscars; and Lenny Pickett, Leon Pendarvis, Eli Brueggemann for SNL50: The Anniversary Special.\nGabe Hilfer had three of the six nominations for outstanding music supervision. He’s nominated for his work on The Studio, The White Lotus and The Righteous Gemstones (the latter alongside DeVoe Yates). Ariel Marx had two of the six nominations for outstanding music composition for a limited or anthology series, movie or special. He’s nominated for his work on both Black Mirror and Dying for Sex. Cristobal Tapia de Veer received two nominations in different categories for his work on The White Lotus.\nTrending on Billboard\nTwo SNL alums are competing for outstanding original music and lyrics. Adam Sandler is nominated for “Adam Sandler’s Song: 50 Years,” which he co-wrote with Dan Bulla for SNL50: The Anniversary Special. Kristen Wiig is competing with “Harper and Will Go West,” which she cowrote with Sean Douglas and Josh Greenbaum for Harper and Will Go West. The latter song was shortlisted for an Oscar for best original song late last year, but wasn’t nominated.\nThomas Newman and Julia Newman share a nomination for outstanding music composition for a limited or anthology series, movie or special for their work on Monsters: The Lyle and Erik Menendez Story. Thomas is Julia’s father. This is the first time he has collaborated with another composer in writing a score. Thomas and Julia collaborated last year on Feud: Capote vs. the Swans in which he wrote the main title theme and Julia wrote the original music for each episode of the series. For Monsters: The Lyle and Erik Menendez Story, they wrote the music for each episode together.\nFirst-round voting in the Primetime Emmys runs from Aug. 18 to 27. The Creative Arts Emmys will be will be presented over two nights, Saturday, Sept. 6, and Sunday, Sept. 7, at the Peacock Theater at L.A. Live. Highlights from the two ceremonies will air Saturday, Sept. 13, at 8 p.m. PT on FXX.\nThe Primetime Emmys will be telecast live coast-to-coast on Sunday, Sept. 14, from 8 to 11 p.m. ET on CBS and available to stream live and on demand on Paramount+. Comedian Nate Bargatze is hosting for the first time.\nHere’s the complete list of nominees in the seven music categories:\nOutstanding Music Direction\nThe Apple Music Super Bowl LIX Halftime Show Starring Kendrick Lamar • FOX • Roc Nation, DPS, Jesse Collins Entertainment and pgLang; Kendrick Lamar, Tony Russell, Music Directors\nThe Kennedy Center Honors • CBS • Done + Dusted in association with Rok Productions; Rickey Minor, Music Director\nThe Oscars • ABC • Academy of Motion Picture Arts and Sciences; Michael Bearden, Music Director\nSNL50: The Anniversary Special • NBC • SNL Studios in association with Universal Television and Broadway Video; Lenny Pickett, Leon Pendarvis, Eli Brueggemann, Music Directors\nSNL50: The Homecoming Concert • Peacock • SNL Studios in association with Universal Television and Broadway Video; James Poyser, Music Director, Ahmir “Questlove” Thompson, Music Director\nOutstanding Music Composition for a Series (Original Dramatic Score)\nAndor • “Who Are You?” • Disney+ • Lucasfilm Ltd.; Brandon Roberts, Composer\nBased on a True Story • “Relapse” • Peacock • UCP, Aggregate Films, and Parasox; Sherri Chung, Composer\nCobra Kai • “Blood In Blood Out” • Netflix • Sony Pictures Television for Netflix; Leo Birenberg, Zach Robinson, Composers\nSeverance • “Cold Harbor” • Apple TV+ • Fifth Season in association with Apple; Theodore Shapiro, Composer\nThe Studio • “The Missing Reel” • Apple TV+ • Lionsgate Television in association with Apple; Antonio Sánchez, Composer\nThe White Lotus • “Amor Fati” • HBO | Max • HBO in association with Rip Cord and MC Pictures; Cristobal Tapia de Veer, Composer\nOutstanding Music Composition for a Limited or Anthology Series, Movie or Special (Original Dramatic Score)\nBlack Mirror • “Hotel Reverie” • Netflix • Broke & Bones for Netflix; Ariel Marx, Composer\nBlack Mirror • “USS Callister: Into Infinity” • Netflix • Broke & Bones for Netflix; Daniel Pemberton, Composer\nDying For Sex • “It’s Not That Serious” • FX on Hulu • 20th Television; Ariel Marx, Composer\nMonsters: The Lyle and Erik Menendez Story • “Spree” • Netflix • Ryan Murphy Productions for Netflix; Thomas Newman, Julia Newman, Composers\nThe Penguin • “After Hours” • HBO | Max • HBO in association with Acid and Tender Productions, 6th & Idaho Motion Picture Company, Dylan Clark Productions, Chapel Place Productions, Zobot Projects, DC Studios, and Warner Bros. Television; Mick Giacchino, Composer\nThe Supremes at Earl’s All-You-Can-Eat • Hulu • Searchlight Pictures presents A Temple Hill production; Kathryn Bostic, Composer\nOutstanding Music Composition for a Documentary Series or Special (Original Dramatic Score)\nThe Americas • “Andes” • NBC • BBC Studios Natural History Unit in association with Universal Television Alternative Studio; Hans Zimmer, Anže Rozman, Kara Talve, Composers\nChef’s Table • “José Andrés” • Netflix • Boardwalk Pictures and David Gelb Planetarium for Netflix; Duncan Thum, David Bertok, Composers\nLeonardo Da Vinci • PBS • Florentine Films & WETA; Caroline Shaw, Composer\nPlanet Earth: Asia • “Beneath the Waves” • BBC America • A BBC Studios Natural History Unit production co-produced with BBC America and ZDF for BBC; Jacob Shea, Laurentia Editha, Composers\nSuper/Man: The Christopher Reeve Story • HBO | Max • DC Studios presents in association with HBO Documentary Films and CNN Films in association with Words+Pictures, a Passion Pictures and Misfits Entertainment production in association with Jenco Films; Ilan Eshkeri, Composer\nOutstanding Original Music and Lyrics\nAgatha All Along • “Circle Sewn With Fate” / “Unlock Thy Hidden Gate” / Song Title: “The Ballad of the Witches’ Road” • Disney+ • Marvel Television; Kristen Anderson-Lopez, Robert Lopez, Music & Lyrics\nAndor • “Who Are You?” / Song Title: “We are the Ghor (Planetary Anthem)” • Disney+ • Lucasfilm Ltd.; Nicholas Britell, Tony Gilroy, Music & Lyrics\nThe Boys • “We’ll Keep the Red Flag Flying Here” / Song Title: “Let’s Put the Christ Back in Christmas” • Prime Video • Amazon MGM Studios, Sony Pictures Television with Kripke Enterprises, Original Film, and Point Grey Pictures; Christopher Lennertz, Music & Lyrics\nSNL50: The Anniversary Special • Song Title: “Adam Sandler’s Song: 50 Years” • NBC • SNL Studios in association with Universal Television and Broadway Video; Adam Sandler, Dan Bulla, Music & Lyrics\nWill & Harper • Song Title: “Harper and Will Go West” • Netflix • A Netflix Documentary / A Wayfarer Studios Film / A Delirio Films Production / A Gloria Sanchez Production; Sean Douglas, Kristen Wiig, Music & Lyrics; Josh Greenbaum, Lyrics\nOutstanding Original Main Title Theme Music\nDept. Q • Netflix • A Netflix Series / A Left Bank Pictures Production, Carlos Rafael Rivera, Scott Frank, Composers\nDune: Prophecy • HBO | Max • HBO presents a Legendary Television production in association with Flying Life Productions, Herbert Properties LLC, and Wandering Jew Productions; Volker Bertelmann, Composer\nLazarus • Adult Swim • Sola Entertainment and Studio MAPPA; Kamasi Washington, Composer\nThe Residence • Netflix • A Netflix Original Series in association with shondalandmedia; Mark Mothersbaugh, Composer\nThe White Lotus • HBO | Max • HBO in association with Rip Cord and MC Pictures; Cristobal Tapia de Veer, Composer\nYour Friends & Neighbors • Apple TV+ • Apple Studios / Tropper Ink; Dominic Lewis, Hamilton Leithauser, Composers\nOutstanding Music Supervision\nHacks • “I Love LA” • HBO | Max • Universal Television in association with Paulilu, First Thought Productions, Fremulon Productions, 3 Arts Entertainment; Matt Biffa, Music Supervisor\nThe Last of Us • “The Price” • HBO | Max • HBO in association with Sony Pictures Television, PlayStation Productions, Word Games, The Mighty Mint, and Naughty Dog; Evyen Klean, Ian Broucek, Music Supervisors\nThe Righteous Gemstones • “You Hurled Me Into the Depths, Into the Very Heart of the Seas” • HBO | Max • HBO in association with Rough House Pictures; DeVoe Yates, Gabe Hilfer, Music Supervisors\nSeverance • “Cold Harbor” • Apple TV+ • Fifth Season in association with Apple, George Drakoulias, Music Supervisor\nThe Studio • “The Promotion” • Apple TV+ • Lionsgate Television in association with Apple; Gabe Hilfer, Music Supervisor\nThe White Lotus • “Same Spirits, New Forms” • HBO | Max • HBO in association with Rip Cord and MC Pictures; Gabe Hilfer, Music Supervisor",
      "author": "Paul Grein",
      "published_date": "2025-07-15",
      "word_count": 1505,
      "fetch_timestamp": "2025-08-20T16:14:49.550566",
      "metadata": {
        "char_count": 9455,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:14:49.550558"
      }
    },
    {
      "url": "https://www.billboard.com/video/nicki-minaj-katt-williams-tour-beyonces-makes-chart-history-billboard-news/",
      "source": "billboard",
      "artist_name": "Questlove",
      "title": "Nicki Minaj Invites Katt Williams on Tour, Beyoncé’s Makes Chart History & More | Billboard News",
      "content": "---\ntitle: Nicki Minaj Invites Katt Williams on Tour, Beyoncé’s Makes Chart History & More | Billboard News\nauthor: Emily Fuentes\nurl: https://www.billboard.com/video/nicki-minaj-katt-williams-tour-beyonces-makes-chart-history-billboard-news/\nhostname: billboard.com\ndescription: Ariana Grande reveals tracks for new album ‘Eternal Sunshine.’ Nicki Minaj has invited Katt Williams on tour. Questlove defends Sexyy Red. And more!\nsitename: Billboard\ndate: 2024-02-22\ncategories: ['Videos']\ntags: ['bbnews, billboard news, Katt Williams, saturday night live, snl']\n---\nAriana Grande is gearing up to release her new album ‘Eternal Sunshine.’ The singer has revealed a few song titles and has been announced as a musical guest on ‘SNL’ next month. Nicki Minaj has invited comedian and actor Katt Williams on tour. Questlove defends Sexyy Red after she is announced to perform at the 2024 Roots Picni. Beyoncé’s “Texas Hold ‘Em” debuts at No. 1 on Billboard’s Hot Country Songs Chart making her the first woman to have topped both the Hot Country Songs and Hot R&B/Hip-Hop Songs charts since October 1958. We go behind the video with LE SSERAFIM. And more!\nTetris Kelly\nAriana Grande’s ‘Eternal Sunshine’ era is almost here. Nicki tries to bring the funny to Gag City, QuestLove got Sexyy Red’s back and Beyoncé breaks the charts yet again and explain WIM’s Group Of The Year NewJeans’ success. Plus we highlight some amazing black women making moves in the music industry. Happy Wednesday music lovers I’m Tetris, this is Billboard News and we have all your music tea sip on February 21. I’m so excited to talk about some of my fave K-Pop groups. But before we get to that we must talk news starting with Ms. “Yes, And ?” Ariana Grande is set to take the ‘SNL’ stage after revealing some of her new tracklist.\nTetris Kelly\nA Hot 100 No. 1, a remix with Mariah and an ‘SNL’ performance announcement. Ariana’s next era isn’t even officially here and she’s already dominating. For those that can’t wait to hear the track names before ‘Eternal Sunshine’ drops on March 8th. Ariana revealed them, kind of censoring the titles with beeps. And if you love “Yes And ?” Ariana says there’s even better track to come comparing the new track to “Thank U Next.”\nTetris Kelly\nWhich tracks are you most excited to hear? And what do you think the next single will be? Let us know in the comments.\nWatch the full video above!",
      "author": "Emily Fuentes",
      "published_date": "2024-02-22",
      "word_count": 395,
      "fetch_timestamp": "2025-08-20T16:14:49.592725",
      "metadata": {
        "char_count": 2406,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:14:49.592718"
      }
    }
  ],
  "total_articles": 6,
  "total_words": 4310,
  "extracted_at": "2025-08-20T16:14:49.593082",
  "urls_processed": [
    "https://www.billboard.com/video/questlove-joseph-patel-sly-lives-documentary-billboard-in-conversation/",
    "https://www.billboard.com/music/awards/2025-iheartpodcast-awards-nominations-list-1235870694/",
    "https://www.billboard.com/music/awards/questlove-summerstage-icon-city-parks-foundation-1236025125/",
    "https://www.billboard.com/music/rb-hip-hop/questlove-kendrick-lamar-the-roots-gnx-video-1235979961/",
    "https://www.billboard.com/music/awards/2025-emmy-nominees-music-categories-list-1236021589/",
    "https://www.billboard.com/video/nicki-minaj-katt-williams-tour-beyonces-makes-chart-history-billboard-news/"
  ]
}