{
  "artist_name": "Dave Grohl",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/music/music-news/dave-grohl-wife-jordyn-blum-appear-together-secret-baby-1236012734/",
      "source": "billboard",
      "artist_name": "Dave Grohl",
      "title": "Dave Grohl, Wife Jordyn Blum Make First Public Appearance Since He Had Baby ‘Outside of My Marriage’",
      "content": "---\ntitle: Dave Grohl, Wife Jordyn Blum Make First Public Appearance Since He Had Baby ‘Outside of My Marriage’\nauthor: Hannah Dailey\nurl: https://www.billboard.com/music/music-news/dave-grohl-wife-jordyn-blum-appear-together-secret-baby-1236012734/\nhostname: billboard.com\ndescription: Dave Grohl and wife Jordyn Blum attended Wimbledon, marking the couple's first appearance together since the drummer's secret baby was announced.\nsitename: Billboard\ndate: 2025-07-02\ncategories: ['Music News']\ntags: ['Music News']\n---\nDave Grohl and Jordyn Blum have made their first public outing as a couple since the rocker revealed he had fathered a baby outside of his marriage, attending the third day of the Wimbledon Tennis Championships in London together Wednesday (July 2).\nIn photos from the event, Grohl looks dapper in a navy suit while the former television producer sports a light peach blazer-and-trouser set. After entering the All England Lawn Tennis and Croquet Club together, the couple flashed smiles and chatted with their seat neighbors.\nThe Foo Fighters frontman and Blum also attended Wimbledon together in 2024. Just a few months after that, Grohl revealed that he had welcomed a baby girl “outside of my marriage,” writing in a statement on Instagram, “I love my wife and my children, and I am doing everything I can to regain their trust and earn their forgiveness.”\nTrending on Billboard\n“I plan to be a loving and supportive parent to her,” he’d added at the time. “We’re grateful for your consideration toward all the children involved, as we move forward together.”\nGrohl married Blum in 2003. They share three daughters — 19-year-old Violet, 16-year-old Harper and 10-year-old Ophelia.\nThe former Nirvana drummer has been inactive on his own Instagram account since posting his statement about the baby, but he has kept busy over the past few months. In January, he volunteered to help families in need by serving meals in Los Angeles amid the devastating wildfire crisis, and in February, he took part in the Saturday Night Live 50th anniversary concert special.\nGrohl also delivered some special performances in April, taking the stage at Coachella before playing an L.A. benefit concert a few weeks later. And on July 2, the Foo Fighters dropped a new track called “Today’s Song,” celebrating 30 years of the band’s debut album, and paired with it a statement remembering drummer Taylor Hawkins, who died in March 2022.",
      "author": "Hannah Dailey",
      "published_date": "2025-07-02",
      "word_count": 379,
      "fetch_timestamp": "2025-08-20T18:16:17.518067",
      "metadata": {
        "char_count": 2443,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:16:17.518047"
      }
    },
    {
      "url": "https://www.billboard.com/music/rock/dave-grohl-covers-lcd-soundsystem-bowie-school-fundraiser-1235957652/",
      "source": "billboard",
      "artist_name": "Dave Grohl",
      "title": "Dave Grohl Covers LCD Soundsystem, David Bowie During Surprise L.A. School Benefit Fundraiser",
      "content": "---\ntitle: Dave Grohl Covers LCD Soundsystem, David Bowie During Surprise L.A. School Benefit Fundraiser\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/rock/dave-grohl-covers-lcd-soundsystem-bowie-school-fundraiser-1235957652/\nhostname: billboard.com\ndescription: Dave Grohl covered LCD Soundsystem, David Bowie and the Knack during a surprise school benefit fundraiser featuring guests Luke Spiller and Lisa Loeb.\nsitename: Billboard\ndate: 2025-04-29\ncategories: ['Rock']\ntags: ['genre rock, Music News']\n---\nDave Grohl popped into a benefit show at for L.A.’s Oakwood School at Avalon Hollywood over the weekend for a surprise set of covers of some of his favorite songs from LCD Soundsystem, The Knack and David Bowie. Accompanied by Foo Fighters bandmate keyboardist Rami Jaffee, as well as Studio 606 engineer and drummer John Lousteau and Birds of Satan bassist Wiley Hodgden, the quartet had some help from a few of their famous friends as well.\nThe set blasted off with a rip through their supercharged cover of LCD Soundsystem’s “Daft Punk Is Playing at My House,” followed by The Knack’s 1979 power pop classic “My Sharona.” The group then made their way through Queen and David Bowie’s “Under Pressure” with expert help from The Struts singer and solo artist Luke Spiller.\nTrending on Billboard\nThe run ended with a surprise appearance by Lisa Loeb, who joined the group on lead vocals for a cover of Bowie’s “Moonage Daydream.”\nThe Foo Fighters don’t have any tour dates scheduled for 2025 at the moment, but Grohl has been popping up all over the place lately, including during the first weekend of Coachella on April 19. The rocker hopped on stage with his trusty guitar to join maestro Gustavo Dudamel and the Los Angeles Philharmonic for amped-up orchestral takes on the Foos’ “The Sky Is a Neighborhood” and “Everlong,” marking the first time Grohl has played Foos songs in public since revealing last fall that he’d fathered a child out of his marriage.\nIn January, he reunited with his former Nirvana bandmate Krist Novoselic and a variety of female singers — including Joan Jett, Kim Gordon, St. Vincent and his daughter, Violet — for a set of Nirvana covers at the FireAid benefit show that also featured Nirvana/Foos guitarist Pat Smear. A month later, Nirvana came together again, with Post Malone on lead vocals, at the SNL 50th anniversary concert.",
      "author": "Gil Kaufman",
      "published_date": "2025-04-29",
      "word_count": 377,
      "fetch_timestamp": "2025-08-20T18:16:17.571311",
      "metadata": {
        "char_count": 2383,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T18:16:17.571304"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/dave-grohl-coachella-2025-la-philharmonic-gustavo-dudamel-1235950920/",
      "source": "billboard",
      "artist_name": "Dave Grohl",
      "title": "Foo Fighters’ Dave Grohl Performs ‘Everlong’ & More With LA Philharmonic at Coachella 2025",
      "content": "---\ntitle: Foo Fighters’ Dave Grohl Performs ‘Everlong’ & More With LA Philharmonic at Coachella 2025\nauthor: Mitchell Peters\nurl: https://www.billboard.com/music/music-news/dave-grohl-coachella-2025-la-philharmonic-gustavo-dudamel-1235950920/\nhostname: billboard.com\ndescription: Dave Grohl surprised Coachella 2025 with orchestral versions of Foo Fighters hits alongside Gustavo Dudamel and the LA Phil on April 19.\nsitename: Billboard\ndate: 2025-04-20\ncategories: ['Music News']\ntags: ['Classical, Coachella, genre rock, Music News']\n---\nDave Grohl made a surprise appearance during weekend two of Coachella 2025.\nOn Saturday (April 19), the Foo Fighters frontman took the stage with his guitar to join Venezuelan maestro Gustavo Dudamel and the Los Angeles Philharmonic for powerful orchestral renditions of Foos songs “The Sky Is a Neighborhood” and “Everlong” at the Outdoor Theatre of the Indio, Calif., music festival.\nThe occasion marked Grohl’s first time performing Foo Fighters tracks in public since revealing last fall that he had fathered a child outside his marriage.\n“I love my wife and my children, and I am doing everything I can to regain their trust and earn their forgiveness,” the musician shared in a September 2024 Instagram post.\nTrending on Billboard\nIn the months since, Grohl has returned to the stage for several high-profile appearances, including performances with his surviving Nirvana bandmates Krist Novoselic and Pat Smear — joined by guest vocalists — at the FireAid LA benefit concert in January and the SNL50: The Homecoming Concert in February.\nGrohl wasn’t the only surprise during Saturday’s star-studded Coachella set. Wicked actress Cynthia Erivo, who plays Elphaba opposite Ariana Grande’s Glinda in the live-action adaptation of the Broadway musical, also appeared to perform what is believed to be “Brick by Brick,” a ballad from her forthcoming sophomore album, I Forgive You, according to Rolling Stone.\nErivo followed up with a soulful rendition of Prince’s “Purple Rain.” “Hello Coachella, nice to see you. Would you like a little Prince?” she asked the crowd, who erupted in cheers. “OK, Prince for you then.”\nOther guest performers included Natasha Bedingfield, who sang her 2004 hit “Unwritten,” as well as Laufey and Argentine duo Paco Amoroso and Ca7riel.\nDudamel and the LA Phil made their Coachella debut during weekend one on April 12, with an eclectic lineup of special guests including Becky G and LL Cool J. This appearance marks a historic moment for the orchestra, as it’s their first time performing at the festival. The 2025–2026 season will also be Dudamel’s final year as music and artistic director of the LA Phil.\nWeekend two of Coachella wraps up Sunday with performances by Post Malone, Travis Scott, Megan Thee Stallion, JENNIE, Zedd, Kraftwerk, and more.",
      "author": "Mitchell Peters",
      "published_date": "2025-04-20",
      "word_count": 430,
      "fetch_timestamp": "2025-08-20T18:16:17.622430",
      "metadata": {
        "char_count": 2828,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:16:17.622419"
      }
    },
    {
      "url": "https://www.billboard.com/music/rock/jack-black-dave-grohl-minecraft-soundtrack-i-feel-alive-1235929738/",
      "source": "billboard",
      "artist_name": "Dave Grohl",
      "title": "Jack Black Teams With Dave Grohl For Rocking ‘Minecraft’ Soundtrack Song ‘I Feel Alive’",
      "content": "---\ntitle: Jack Black Teams With Dave Grohl For Rocking ‘Minecraft’ Soundtrack Song ‘I Feel Alive’\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/rock/jack-black-dave-grohl-minecraft-soundtrack-i-feel-alive-1235929738/\nhostname: billboard.com\ndescription: Jack Black has teamed up with Foo Fighters' Dave Grohl for the rocking 'A Minecraft Movie' soundtrack song 'I Feel Alive.'\nsitename: Billboard\ndate: 2025-03-24\ncategories: ['Rock']\ntags: ['Billboard Family, genre rock, Music News']\n---\nJack Black is fired up and ready to rock on the first soundtrack song from his upcoming adventure flick A Minecraft Movie. And he’s bringing along some friends. Black dropped the classic rock burner “I Feel Alive” last week, a thundering jam featuring Who-like screams and 1970s KISS disco rock vibes.\n“I was stuck like a stone/ Down in the nether ’til you came along/ But your faith in me/ Gave me the power to set me free/ I don’t wanna be running from zombies for the rest of our lives/ Let’s be creative ’til the day that we die/ Now, do I have to tell ya one more time?,” Black growls over a skittery beat until things explode on the massive chorus.\nThose booming drums and banging cow bell sounds? Of course they’re courtesy of Black’s pal and Foo Fighters leader Dave Grohl, who pounds the skins on the Andrew Wyatt-produced track that also features Queens of the Stone Age guitarist Troy Van Leeuwen, background vocals from Black’s movie co-star Danielle Brooks, keyboards from Jellyfish’s Roger Manning and bass and rhythm guitar by song composer Mark Ronson.\nTrending on Billboard\n“Found the love/ I’m dreaming of/ Yes now I’m never ever looking back/ ‘Cause I feel alive/ I move mountains with my mind/ I feel the high/ With the power of the wolf inside/ Here we go/ I feel alive,” Black thunders on the chorus of the glam rock anthem. A Minecraft Movie, directed by Jared Hess (Napoleon Dynamite), also stars Jason Momoa, Brooks, Jennifer Coolidge, Sebastian Hansen and Emma Myers.\nBlack is slated to host Saturday Night Live with musical guests Elton John & Brandi Carlile on April 5.\nListen to “I Feel Alive” below.",
      "author": "Gil Kaufman",
      "published_date": "2025-03-24",
      "word_count": 346,
      "fetch_timestamp": "2025-08-20T18:16:17.674997",
      "metadata": {
        "char_count": 2131,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T18:16:17.674990"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/dave-grohl-added-saturday-night-live-50th-anniversary-concert-1235891783/",
      "source": "billboard",
      "artist_name": "Dave Grohl",
      "title": "Dave Grohl Added to ‘Saturday Night Live’ 50th-Anniversary Concert",
      "content": "---\ntitle: Dave Grohl Added to ‘Saturday Night Live’ 50th-Anniversary Concert\nauthor: Tyler Jenke\nurl: https://www.billboard.com/music/music-news/dave-grohl-added-saturday-night-live-50th-anniversary-concert-1235891783/\nhostname: billboard.com\ndescription: Saturday Night Live's upcoming Homecoming Concert will be headlined by Bad Bunny, Lady Gaga and Miley Cyrus, with Dave Grohl now joining the lineup.\nsitename: Billboard\ndate: 2025-02-04\ncategories: ['Music News']\ntags: ['Bad Bunny, Dave Grohl, Foo Fighters, Lady GaGa, Miley Cyrus, nirvana, saturday night live']\n---\nWith under two weeks to go until Saturday Night Live host their homecoming concert as part of their 50th-anniversary celebrations, the prolific Dave Grohl has been added to the lineup of performers.\nHosted by Jimmy Fallon, the SNL 50: The Homecoming Concert will take place at 8 p.m. ET on Feb. 14 at Radio City Music Hall in New York City, with live streaming available on Peacock. It’s part of the iconic show’s ongoing birthday celebrations which have also included the premiere of the 50 Years of SNL Music documentary on Jan. 27, and the SNL50: Beyond Saturday Night documentary on Jan. 16.\nOn Thursday (Jan. 30), SNL announced the names which will feature in their upcoming concert, with previous show hosts and performers Bad Bunny, Lady Gaga and Miley Cyrus appearing atop the bill.\nTrending on Billboard\nElsewhere, the likes Post Malone, Jelly Roll and the Backstreet Boys can also be found on the bill, in addition to Arcade Fire, Bonnie Raitt, Brandi Carlile, Chris Martin, David Byrne, DEVO, Eddie Vedder, Jack White, Mumford & Sons, The B-52s and The Roots.\nAt the time, it was noted that more performers would be announced leading up to the show, with Consequence now confirming that Grohl will also be joining the lineup.\nThough absent from the initial announcement, a promotional video for the event has since mentioned Grohl’s presence. Notably, Grohl is the only artist featured in the video who was not named in last week’s lineup, though the clip also overlooks mention of confirmed performers Brittany Howard, Preservation Hall Jazz Band, and Robyn.\nThe Foo Fighters founder has been largely absent from the public eye since September 2024 when he announced he had become the father of a new baby born outside of his marriage to Jordyn Blum. “I love my wife and my children, and I am doing everything I can to regain their trust and earn their forgiveness,” a statement released by Grohl at the time read.\nGrohl’s upcoming contribution to the SNL’s Homecoming Concert makes sense, however. To date, he holds the record for most musical appearances on the show, with 15 performances between 1992 and 2023.\nThese include nine times with the Foo Fighters, twice with Nirvana, once as a drummer for Tom Petty and the Heartbreakers, and once as a member of Them Crooked Vultures. The Foo Fighters have also appeared as a special guest with Mick Jagger in 2012, and Grohl also performed with his Nirvana bandmates alongside Paul McCartney later that same year.\nMore recently, Grohl also appeared in the 50 Years of SNL Music documentary, and on Thursday (Jan. 30), took part in a Nirvana reunion as part of the FireAid LA Benefit Concert. Appearing alongside bandmates Krist Novoselic and Pat Smear, the four-song set featured guest vocalists St. Vincent, Kim Gordon, and Joan Jett, with Grohl’s own daughter Violet closing out proceedings with a rendition of “All Apologies”.",
      "author": "Tyler Jenke",
      "published_date": "2025-02-04",
      "word_count": 553,
      "fetch_timestamp": "2025-08-20T18:16:17.727347",
      "metadata": {
        "char_count": 3465,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:16:17.727341"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/dave-grohl-l-a-wildfire-victims-meals-birthday-1235876811/",
      "source": "billboard",
      "artist_name": "Dave Grohl",
      "title": "Dave Grohl Helps Serve Meals to L.A. Wildfire Victims on 56th Birthday",
      "content": "---\ntitle: Dave Grohl Helps Serve Meals to L.A. Wildfire Victims on 56th Birthday\nauthor: Hannah Dailey\nurl: https://www.billboard.com/music/music-news/dave-grohl-l-a-wildfire-victims-meals-birthday-1235876811/\nhostname: billboard.com\ndescription: Dave Grohl helped serve L.A. wildfire victims and firefighters meals on his 56th birthday. Get the details.\nsitename: Billboard\ndate: 2025-01-15\ncategories: ['Music News']\ntags: ['Music News, nsfs']\n---\nDave Grohl spent his 56th birthday giving back to families in need amid the ongoing wildfire crisis in the Los Angeles area.\nIn videos posted to Instagram Stories Tuesday (Jan. 14) by Feed the Streets — an L.A.-based charity with which the Foo Fighters frontman has volunteered in the past — Grohl helps stir homemade chili and laughs cheerfully with his other volunteers. A few hours later, the organization shared that it was in the process of packaging dinners for displaced families and inmate firefighters.\nThe videos were posted on the same day Grohl turned 56, about one full week after fires first broke out Pacific Palisades and rapidly spread across L.A. county faster than first responders could snuff out the flames. More blazes later broke out in other parts of the city, destroying countless structures and forcing tens of thousands of residents to evacuate. At least 25 people have died so far, CNN reports.\nAs the city attempts to recover, multiple industry events have been canceled or postponed — including numerous concerts and pre-Grammys parties. Billboard announced Tuesday (Jan. 14) that all of its Grammy week gatherings in the area had been duly canceled, writing in a company statement, “Our hearts are with the people of Los Angeles as they face the reality of these devastating fires.”\n“Many members of our staff and community have been personally affected, and our core focus at this time is allocating the resources we have to support long term recovery for the city we call home,” it added.\nGrohl is just one of many figures in the music industry who has rallied to support L.A. in light of the crisis, with Doja Cat recently partnering with the American Red Cross to raise funds for wildfire relief through a line of custom merch. ASCAP, Guitar Center Music Foundation and more music companies have organized emergency funds and resource pools for those affected, while Beyoncé’s BeyGood Foundation, Sony Music Group, Warner Music Group and more have made sizable donations to the cause.",
      "author": "Hannah Dailey",
      "published_date": "2025-01-15",
      "word_count": 388,
      "fetch_timestamp": "2025-08-20T18:16:17.776810",
      "metadata": {
        "char_count": 2470,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:16:17.776800"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/dave-grohls-daughter-violet-reportedly-readying-debut-album-1235861477/",
      "source": "billboard",
      "artist_name": "Dave Grohl",
      "title": "Dave Grohl’s Daughter Violet Reportedly Readying Her Debut Album",
      "content": "---\ntitle: Dave Grohl’s Daughter Violet Reportedly Readying Her Debut Album\nauthor: Tyler Jenke\nurl: https://www.billboard.com/music/music-news/dave-grohls-daughter-violet-reportedly-readying-debut-album-1235861477/\nhostname: billboard.com\ndescription: 18-year-old Violet Grohl previously made her official music debut with a cover of X's 'Nausea' in 2021.\nsitename: Billboard\ndate: 2024-12-19\ncategories: ['Music News']\ntags: ['beck, Dave Grohl, Foo Fighters, nirvana, st. vincent, taylor hawkins, Violet Grohl']\n---\nViolet Grohl, the daughter of rock veteran Dave Grohl, is reportedly in the process of preparing her debut album.\nPer The Hollywood Reporter, Violet has been working on new material in a studio space that she had been gifted for her birthday by her father. Having performed alongside Dave in the past and also releasing music as a solo artist, Violet is has been described as being “incredibly committed” to the musical process and “to growing as an artist” by an unnamed source.\nCurrently, her studio time has seen her working with producer Justin Raisen, who has worked with artists as varied as Charli XCX, Drake, and John Legend, and most recently, Kim Gordon on her Grammy-nominated album The Collective.\nViolet first emerged as a musician in 2018 at the age of 12, performing a cover of Adele’s “When We Were Young” with her father. Since then, she has also joined her father and other surviving members of Nirvana for a cover of “Heart-Shaped Box”, in addition to providing backing vocals for the likes of St. Vincent and Beck.\nTrending on Billboard\nShe’s also provided backing vocals on songs released the Foo Fighters‘ Medicine at Midnight and But Here We Are albums, and performed as part of the tribute concerts to late drummer Taylor Hawkins. In 2021, she also released her debut single, covering X’s “Nausea”, again in collaboration with her father.\n“She’s a true torch singer,” a source told The Hollywood Reporter of her recent material. “Her vocals are tremendous. She’s very talented.”\nCurrently, official details relating to Violet’s full-length debut are being kept under wraps, including whether the music will be released via the Foo Fighters’ Roswell Records imprint of RCA Records – as was her “Nausea” single.\nDave Grohl and the remainder of his family have been relatively absent from the public eye since September, when Dave shared he had become the father of a daughter born outside of his marriage. “I plan to be a loving and supportive parent to her,” he wrote on social media.\n“I love my wife and my children, and I am doing everything I can to regain their trust and earn their forgiveness,” he added. “We’re grateful for your consideration toward all the children involved, as we move forward together.”",
      "author": "Tyler Jenke",
      "published_date": "2024-12-19",
      "word_count": 436,
      "fetch_timestamp": "2025-08-20T18:16:17.829122",
      "metadata": {
        "char_count": 2754,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:16:17.829114"
      }
    },
    {
      "url": "https://www.billboard.com/artist/dave-grohl/chart-history/tlp",
      "source": "billboard",
      "artist_name": "Dave Grohl",
      "title": "Dave Grohl | Biography, Music & News | Billboard",
      "content": "---\ntitle: Dave Grohl | Biography, Music & News | Billboard\nauthor: Wp-Block-Co-Authors-Plus-Coauthors Is-Layout-Flow\nurl: https://www.billboard.com/artist/dave-grohl/\nhostname: billboard.com\ndescription: Explore Dave Grohl's music on Billboard. Get the latest news, biography, and updates on the artist.\nsitename: Billboard\ndate: 2018-08-25\n---\n×\nSkip to main content\nOpen menu\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nBillboard\nBillboard\nCharts\nMusic\nVideo\nShop\nAwards\nBusiness\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nAccount\nManage Account\nLog Out\nAccount\nLOGIN\nLogin\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nOpen menu\nBillboard\nCharts\nMusic\nVideo\nShop\nAwards\nBusiness\nLOGIN\nLogin\nAccount\nManage Account\nLog Out\nAccount\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nBillboard Hot 100™\nBillboard 200™\nGlobal 200\nArtist 100\nOpen menu\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nBillboard\nBillboard\nCharts\nMusic\nVideo\nShop\nAwards\nBusiness\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nAccount\nManage Account\nLog Out\nAccount\nLOGIN\nLogin\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nAll Charts\nClose the menu\nTop Charts\nExpand top-charts menu\nBillboard Hot 100™\nBillboard 200™\nBillboard Artist 100\nEmerging Artists\nStreaming Songs\nRadio Songs\nDigital Song Sales\nTop Album Sales\nTop Streaming Albums\nIndependent Albums\nVinyl Albums\nIndie Store Album Sales\nGlobal\nExpand global menu\nBillboard Global 200\nBillboard Global Excl. U.S.\nAfrobeats\nExpand afrobeats menu\nBillboard U.S. Afrobeats Songs\nHits of the World\nExpand hits-of-the-world menu\nBillboard Arabic Hot 100\nBillboard Arabic Artist 100\nBillboard Argentina Hot 100\nBillboard Brasil Hot 100\nBillboard Canadian Hot 100\nBillboard Canadian Albums\nBillboard Italy Hot 100\nBillboard Italy Albums Top 100\nBillboard Japan Hot 100\nBillboard Philippines Hot 100\nBillboard Philippines Top Philippine Songs\nBillboard Thailand Top Thai Songs\nBillboard Thailand Top Thai Country Songs\nBillboard Vietnam Hot 100\nBillboard Vietnam Top Vietnamese Songs\nThe Official U.K. Singles Chart\nThe Official U.K. Albums Chart\nAustralia Songs\nAustralia Albums\nAustria Songs\nBelgium Songs\nBolivia Songs\nChile Songs\nChina TME UNI Chart\nCroatia Songs\nCzech Republic Songs\nDenmark Songs\nEcuador Songs\nFinland Songs\nFrance Songs\nGermany Songs\nGermany Albums\nGreece Songs\nGreece Albums\nHong Kong Songs\nHungary Songs\nIceland Songs\nIndia Songs\nIndonesia Songs\nIreland Songs\nLuxembourg Songs\nMalaysia Songs\nMexico Songs\nNetherlands Songs\nNew Zealand Songs\nNorway Songs\nPeru Songs\nPoland Songs\nPortugal Songs\nRomania Songs\nSingapore Songs\nSlovakia Songs\nSouth Africa Songs\nSpain Songs\nSweden Songs\nSwitzerland Songs\nTaiwan Songs\nTurkey Songs\nU.K. Songs\nGreatest of All Time\nExpand greatest-of-all-time menu\nGreatest of All Time Artists\nGreatest of All Time Hot 100 Songs\nGreatest of All Time Hot 100 Artists\nGreatest of All Time Billboard 200 Albums\nGreatest of All Time Billboard 200 Artists\nTop Artists of the 21st Century\nTop Hot 100 Songs of the 21st Century\nTop Billboard 200 Albums of the 21st Century\nTop Women Artists of the 21st Century\nGreatest of All Time Hot 100 Women Artists\nGreatest of All Time Hot 100 Songs by Women\nGreatest of All Time Billboard 200 Women Artists\nGreatest of All Time Billboard 200 Albums by Women\nGreatest of All Time Songs of the '80s\nGreatest of All Time Songs of the '90s\nGreatest of All Time Holiday 100 Songs\nGreatest of All Time Top Holiday Albums\nGreatest of All Time Songs of the Summer\nGreatest of All Time Hot 100 No. 2 Hits\nGreatest of All Time Pop Songs Artists\nGreatest of All Time Pop Songs\nGreatest of All Time Adult Contemporary Artists\nGreatest of All Time Adult Contemporary Songs\nGreatest of All Time Adult Pop Songs Artists\nGreatest of All Time Adult Pop Songs\nGreatest of All Time Top Country Artists\nGreatest of All Time Hot Country Songs\nGreatest of All Time Top Country Albums\nTop Country Artists of the 21st Century\nTop Hot Country Songs of the 21st Century\nTop Country Albums of the 21st Century\nGreatest of All Time Top R&B/Hip-Hop Artists\nGreatest of All Time Hot R&B/Hip-Hop Songs\nGreatest of All Time Top R&B/Hip-Hop Albums\nGreatest of All Time Alternative Artists\nGreatest of All Time Alternative Songs\nGreatest of All Time Adult Alternative Artists\nGreatest of All Time Adult Alternative Songs\nGreatest of All Time Mainstream Rock Artists\nGreatest of All Time Mainstream Rock Songs\nGreatest of All Time Latin Artists\nGreatest of All Time Hot Latin Songs Artists\nGreatest of All Time Hot Latin Songs\nGreatest of All Time Top Dance Club Artists\nPop\nExpand pop menu\nPop Airplay\nAdult Contemporary\nAdult Pop Airplay\nCountry\nExpand country menu\nHot Country Songs\nTop Country Albums\nCountry Streaming Songs\nCountry Airplay\nCountry Digital Song Sales\nBluegrass Albums\nAmericana/Folk Albums\nRock & Alternative\nExpand rock-alternative menu\nHot Rock & Alternative Songs\nTop Rock & Alternative Albums\nRock & Alternative Airplay\nHot Rock Songs\nTop Rock Albums\nRock Streaming Songs\nRock Digital Song Sales\nHot Alternative Songs\nTop Alternative Albums\nAlternative Streaming Songs\nAlternative Airplay\nAlternative Digital Song Sales\nHot Hard Rock Songs\nTop Hard Rock Albums\nHard Rock Streaming Songs\nHard Rock Digital Song Sales\nAdult Alternative Airplay\nMainstream Rock Airplay\nR&B/Hip-Hop\nExpand rb-hip-hop menu\nHot R&B/Hip-Hop Songs\nTop R&B/Hip-Hop Albums\nR&B/Hip-Hop Streaming Songs\nR&B/Hip-Hop Airplay\nR&B/Hip-Hop Digital Song Sales\nHot R&B Songs\nTop R&B Albums\nR&B Streaming Songs\nR&B Digital Song Sales\nHot Rap Songs\nTop Rap Albums\nRap Streaming Songs\nRap Airplay\nRap Digital Song Sales\nMainstream R&B/Hip-Hop Airplay\nAdult R&B Airplay\nRhythmic Airplay\nLatin\nExpand latin menu\nHot Latin Songs\nTop Latin Albums\nLatin Airplay\nLatin Streaming Songs\nLatin Digital Song Sales\nHot Regional Mexican Songs\nTop Regional Mexican Albums\nRegional Mexican Airplay\nHot Latin Pop Songs\nTop Latin Pop Albums\nLatin Pop Airplay\nHot Tropical Songs\nTop Tropical Albums\nTropical Airplay\nHot Latin Rhythm Songs\nTop Latin Rhythm Albums\nLatin Rhythm Airplay\nDance\nExpand dance menu\nHot Dance/Electronic Songs\nHot Dance/Pop Songs\nTop Dance Albums\nDance Streaming Songs\nDance Digital Song Sales\nDance/Mix Show Airplay\nChristian\nExpand christian menu\nHot Christian Songs\nTop Christian Albums\nChristian Streaming Songs\nChristian Airplay\nChristian Digital Song Sales\nChristian AC Airplay\nGospel\nExpand gospel menu\nHot Gospel Songs\nTop Gospel Albums\nGospel Streaming Songs\nGospel Airplay\nGospel Digital Song Sales\nSongwriters & Producers\nExpand songwriters-producers menu\nHot 100 Songwriters\nHot 100 Producers\nCountry Songwriters\nCountry Producers\nRock & Alternative Songwriters\nRock & Alternative Producers\nRock Songwriters\nRock Producers\nAlternative Songwriters\nAlternative Producers\nHard Rock Songwriters\nHard Rock Producers\nR&B/Hip-Hop Songwriters\nR&B/Hip-Hop Producers\nR&B Songwriters\nR&B Producers\nRap Songwriters\nRap Producers\nLatin Songwriters\nLatin Producers\nDance/Electronic Songwriters\nDance/Electronic Producers\nDance/Pop Songwriters\nDance/Pop Producers\nChristian Songwriters\nChristian Producers\nGospel Songwriters\nGospel Producers\nClassical\nExpand classical menu\nClassical Albums\nClassical Crossover Albums\nTraditional Classical Albums\nJazz\nExpand jazz menu\nJazz Albums\nContemporary Jazz Albums\nTraditional Jazz Albums\nSmooth Jazz Airplay\nWorld\nExpand world menu\nWorld Albums\nWorld Digital Song Sales\nHoliday\nExpand holiday menu\nHoliday 100\nTop Holiday Albums\nHoliday Streaming Songs\nHoliday Airplay\nHoliday Digital Song Sales\nHoliday 100 Songwriters\nHoliday 100 Producers\nSummer\nExpand summer menu\nSongs of the Summer\nStage & Screen\nExpand stage-screen menu\nCast Albums\nSoundtracks\nAdditional Genres\nExpand additional-genres menu\nBlues Albums\nComedy Albums\nKid Albums\nNew Age Albums\nReggae Albums\nAdditional Charts\nExpand additional-charts menu\nBubbling Under Hot 100\nTop Current Album Sales\nCatalog Albums\nCompilation Albums\nLyricFind U.S.\nLyricFind Global\nExplore\nDave Grohl\nBillboard 200™\n0\nNo. 1 Hits\n1\nTitles\n0\nTop 10 Hits\nBillboard 200™\nBillboard 200™\nTop Album Sales\nHot Rock & Alternative Songs\nTop Rock Albums\nMainstream Rock Airplay\nAlternative Airplay\nRock & Alternative Airplay\nTop Alternative Albums\nTop Hard Rock Albums\nHard Rock Digital Song Sales\nHot Rock Songs\nTop Rock & Alternative Albums\nTop Current Album Sales\nSoundtracks\nBillboard Canadian Albums\nHeritage Rock\nHard Rock Songwriters\nVinyl Albums\nActive Rock\nAlternative Songwriters\nRock & Alternative Songwriters\nRock Songwriters\nDebut Date\nPeak Pos.\nPeak Date\nWks. on Chart\nPlay (EP) (Soundtrack)\nDave Grohl\n8/25/18\n124\n12 Wks\n8/25/18\n1\nBrowse\nLatest News\nMusic News\nDave Grohl, Wife Jordyn Blum Make First Public Appearance Since He Had Baby ‘Outside of My Marriage’\n7/2/25\nHannah Dailey\nRock\nFoo Fighters Book First Show of 2025 at Singapore F1 Grand Prix\n5/14/25\nGil Kaufman\nRock\nDave Grohl Covers LCD Soundsystem, David Bowie During Surprise L.A. School Benefit Fundraiser\n4/29/25\nGil Kaufman\nMusic News\nFoo Fighters’ Dave Grohl Performs ‘Everlong’ & More With LA Philharmonic at Coachella 2025\n4/20/25\nMitchell Peters\nRock\nJack Black Teams With Dave Grohl For Rocking ‘Minecraft’ Soundtrack Song ‘I Feel Alive’\n3/24/25\nGil Kaufman\nMusic News\nDave Grohl Added to ‘Saturday Night Live’ 50th-Anniversary Concert\n2/3/25\nTyler Jenke\nRock\nAll the Times Nirvana Has Performed Live Since Kurt Cobain’s Death\n1/31/25\nGil Kaufman\nRock\nNirvana Reunites With St. Vincent, Kim Gordon, Joan Jett & Violet Grohl on Vocals\n1/31/25\nJoe Lynch\nMusic News\nDave Grohl Helps Serve Meals to L.A. Wildfire Victims on 56th Birthday\n1/15/25\nHannah Dailey\nMusic News\nDave Grohl’s Daughter Violet Reportedly Readying Her Debut Album\n12/18/24\nTyler Jenke\nRead More\nLogin\nLogin\nAccount\nManage Account\nLog Out\nClose the menu\nCharts\nExpand charts menu\nAll Charts\nBillboard Hot 100™\nBillboard 200™\nGlobal 200\nHits Of The World™\nChart Beat\nSongs Of The Summer\nYear-End Charts\nDecade-End Charts\nMusic\nExpand music menu\nMusic News\nPop\nR&B/Hip-Hop\nLatin\nRock\nAwards\nChart Beat\nConcerts\nFeatures\nReviews\nVideos\nExpand videos menu\nCulture\nExpand culture menu\nEvents\nLifestyle\nPolitics\nTV/Film\nMedia\nExpand media menu\nLists\nPhotos\nPodcasts\nVideos\nBusiness\nExpand business menu\nBusiness News\nLegal\nTouring\nPublishing\nRadio\nRecord Labels\nView All Pro\nPro Tools\nExpand pro-tools menu\nSongwriters & Producers\nSong Index\nArtist Index\nRoyalty Calculator\nMarket Watch\nIndustry Events Calendar\nBillboard Español\nExpand billboard-espanol menu\nNoticias\nMúsica\nNegocios\nCultura y Entretenimiento\nSwitching Stages\nExpand switching-stages menu\nGET ACCESS TODAY\nad",
      "author": "Wp-Block-Co-Authors-Plus-Coauthors Is-Layout-Flow",
      "published_date": "2018-08-25",
      "word_count": 1629,
      "fetch_timestamp": "2025-08-20T18:16:18.468261",
      "metadata": {
        "char_count": 10757,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T18:16:18.468246"
      }
    }
  ],
  "total_articles": 8,
  "total_words": 4538,
  "extracted_at": "2025-08-20T18:16:18.536215",
  "urls_processed": [
    "https://www.billboard.com/music/music-news/dave-grohl-wife-jordyn-blum-appear-together-secret-baby-1236012734/",
    "https://www.billboard.com/music/rock/dave-grohl-covers-lcd-soundsystem-bowie-school-fundraiser-1235957652/",
    "https://www.billboard.com/music/music-news/dave-grohl-coachella-2025-la-philharmonic-gustavo-dudamel-1235950920/",
    "https://www.billboard.com/music/rock/jack-black-dave-grohl-minecraft-soundtrack-i-feel-alive-1235929738/",
    "https://www.billboard.com/music/music-news/dave-grohl-added-saturday-night-live-50th-anniversary-concert-1235891783/",
    "https://www.billboard.com/music/music-news/dave-grohl-l-a-wildfire-victims-meals-birthday-1235876811/",
    "https://www.billboard.com/music/music-news/dave-grohls-daughter-violet-reportedly-readying-debut-album-1235861477/",
    "https://www.billboard.com/artist/dave-grohl/chart-history/tlp"
  ]
}