{
  "artist_name": "Merle Haggard",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/10056-last-of-the-breed/",
      "source": "pitchfork",
      "artist_name": "Merle Haggard",
      "title": "Willie Nelson / Merle Haggard / Ray Price: Last of the Breed",
      "content": "---\ntitle: Willie Nelson / Merle Haggard / Ray Price: Last of the Breed\nauthor: Stephen M Deusner\nurl: https://pitchfork.com/reviews/albums/10056-last-of-the-breed/\nhostname: pitchfork.com\ndescription: These three country legends-- no strangers to collaboration with one another-- offer a 2xCD set that includes two Nelson/Haggard tracks plus 20 covers of tracks penned by Lefty Frizzell, Floyd Tillman, and Kris Kristofferson, among others.\nsitename: Pitchfork\ndate: 2007-03-30\n---\nBetween them, Willie Nelson, Merle Haggard, and Ray Price have been recording and touring for more than 150 years: Nelson made his name as a DJ and songwriter in the 1950s, when Ray was establishing his own career as a smooth crooner and Haggard was getting ready to parlay his prison experience into one of the most successful country careers of the 60s and 70s. During that time they've collaborated repeatedly, most notably on Nelson and Haggard's Pancho & Lefty in 1980 and Nelson and Price's San Antonio Rose in 1990 and Run That By Me One More Time in 2003. They're so woven into the fabric of country music and popular culture that the title Last of the Breed doesn't come off as a self-aggrandizing boast.\nIn fact, that title might as well apply to the 22 tracks on this 2xCD set instead of the artists singing them. Besides the two new-ish compositions by Nelson and Haggard, these songs are calculable in age by decades, credited to the swinging pens of Cindy Walker, Lefty Frizzell, Floyd Tillman, Jesse Ashlock, and Harlan Howard, among others. In such company, Kris Kristofferson, represented here by \"Why Me\", counts as a young buck. These are simple, direct songs with easy melodies, witty lyrics, and true-to-life sentiments-- generally perceived to be the kind spurned by mainstream country musicians. Nashville still has its share of talented songwriters, but the myth of the good ol' days is nice and reassuring, allowing listeners to disregard contemporary country wholesale.\nOn Last of the Breed, which accompanies a well-received joint tour with Asleep at the Wheel as their backing band, these three grizzled vets sound supremely comfortable, trading verses and songs with easy camaraderie. Even at 81, Price still sounds robust, especially on \"My Life's Been a Pleasure\", and the grizzled texture just adds seen-it-all authority to Merle's voice, especially on his new composition \"Sweet Jesus\". Willie's infamous against-the-meter phrasing has always sounded extemporaneous, as if even he doesn't know what his voice will do next; even when he slurs his lines on \"My Mary\" and \"Mom and Dad's Waltz\", he still shows an intuitively loose control that hasn't diminished with age. Their distinct voices combine gracefully on \"Sweet Memories\" and \"I Love You Because\", but they sound best on Kristofferson's \"Why Me\". That song has always seemed like a solitary prayer (especially on Johnny Cash's lonely American Recordings version), but sung by a veteran trio, it almost sounds like a career retrospective, as if they're humbled by their large audience, long legacies, and close friendship.\nProducer Fred Foster, returning after Nelson's 2006 Cindy Walker tribute, shows a light touch on these songs, creating a light, loping backdrop that lacks the snap of his previous work. Despite the presence of a crack backing band that includes pedal steel master Buddy Emmons and backing vocals by the Jordanaires, Last of the Breed never seems as good as it should be: there are fine versions of strong songs, but not a single definitive take. \"Lost Highway\" comes close, as do \"Heartaches by the Number\" and \"Goin' Away Party\", but most of these songs sound like the trio are trying to re-create a style long past rather anchor these songs in the here and now. That retrospective orientation is strange because none of these artists could be accused of being stuck in the past; in fact, their willingness to adapt to new styles without compromising their standards is partly what makes them the last of their breed. So it's a shame Last of the Breed isn't better-- not only do they have a lot to say about these old songs, they also have a lot to say through them.",
      "author": "Stephen M Deusner",
      "published_date": "2007-03-30",
      "word_count": 681,
      "fetch_timestamp": "2025-08-20T07:43:52.219974",
      "metadata": {
        "char_count": 4163,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:43:52.219954"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/9599-hag-the-best-of-merle-haggard/",
      "source": "pitchfork",
      "artist_name": "Merle Haggard",
      "title": "Merle Haggard: Hag: The Best of Merle Haggard",
      "content": "---\ntitle: Merle Haggard: Hag: The Best of Merle Haggard\nauthor: Stephen M Deusner\nurl: https://pitchfork.com/reviews/albums/9599-hag-the-best-of-merle-haggard/\nhostname: pitchfork.com\ndescription: The honky-tonk legend's career is celebrated with a 26-track album that covers 40 years of honest, American, working-man pride.\nsitename: Pitchfork\ndate: 2006-11-15\n---\nSimple, American, working-man pride. That's the organizing theme of Hag: The Best of Merle Haggard, which features a generous 26-song tracklist spanning nearly 40 years. Haggard is proud to be an American, and to disagree is to provoke him. He's proud to be a square who doesn't buy into hippie immorality. On \"I Take a Lot of Pride in Who I Am\", which could have served as the title for this compilation, he sings in the voice of a down-and-out drifter who stands tall despite his poverty and would never consider taking welfare hand-outs. On \"Branded Man\", he's an ex-con who has paid his dues to society but can't shake the stigma of prison. This pride, so forcefully conveyed in all these songs, must have been attractive to Haggard's audiences in the late 1960s and early 70s-- average Americans who scorned the counterculture for its destructiveness, but felt abandoned by the larger pop culture. He was proud to fill that gap, to maintain strong American morals even as the rest of the country went to hell. Maybe pride was easy: \"Okie from Muskogee\" made him the most popular country singer in the nation in 1969, and \"The Fightin' Side of Me\" cemented that status.\nIronically, while that pride helps give the music its rugged virility, it may have cost him fans over the years and deflated his legacy. Haggard doesn't have the stature he should: He's less conflicted than Johnny Cash, less contemplative than Willie Nelson, lacking their broad popularity outside the confines of country music. Partly this is because his two most popular songs are \"Okie\" and \"Fightin' Side\", whose political and cultural tangles overshadow his actual music. These provocative tunes have lost none of their divisiveness, thanks in part to Toby Keith's recent exploitive cover of \"Fightin'\", but also because Haggard's negative generalizations about hippies (they don't like \"living right and being free\") are identical to current generalizations about liberals. But even in his underdog status Haggard seems to take a certain pride: His last few albums on smaller labels have been wily and inspired, and current Nashville acts like Keith and Gretchen Wilson have introduced him to a younger audience.\nThis misperception about Haggard's politics made Capitol Nashville's reissues of Haggard's first eight albums earlier this year seem revelatory, and Hag is strategically timed and sequenced to take advantage of this renewed interest. The compilation focuses primarily on his early career, when he released a string of albums that are as solid and exciting as anything country music has ever produced. Most of these tracks predate the mid-1970s, when his popularity was at a peak. There are only three from the 1980s, none from the 90s, and too few from recent releases like If I Could Only Fly and Chicago Wind, which weren't comebacks so much as reminders that he was still around and relevant.",
      "author": "Stephen M Deusner",
      "published_date": "2006-11-15",
      "word_count": 521,
      "fetch_timestamp": "2025-08-20T07:43:52.254350",
      "metadata": {
        "char_count": 3255,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:43:52.254344"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/11752-strangersswinging-doors-and-the-bottle-let-me-down-im-a-lonesome-fugitivebranded-sing-me-back-homethe-legend-of-bonnie-and-clyde-mama-triedproud-of-what-i-am-hagsomeday-well-look-back/",
      "source": "pitchfork",
      "artist_name": "Merle Haggard",
      "title": "Merle Haggard: Strangers/Swinging Doors and The Bottle Let Me Down / I'm a Lonesome Fugitive/Branded / Sing Me Back Home/The Legend of Bonnie and Clyde / Mama Tried/Proud of What I Am / Hag/Someday We'll Look Back",
      "content": "---\ntitle: Merle Haggard: Strangers/Swinging Doors and The Bottle Let Me Down / I'm a Lonesome Fugitive/Branded / Sing Me Back Home/The Legend of Bonnie and Clyde / Mama Tried/Proud of What I Am / Hag/Someday We'll Look Back\nauthor: Stephen M Deusner\nurl: https://pitchfork.com/reviews/albums/11752-strangersswinging-doors-and-the-bottle-let-me-down-im-a-lonesome-fugitivebranded-sing-me-back-homethe-legend-of-bonnie-and-clyde-mama-triedproud-of-what-i-am-hagsomeday-well-look-back/\nhostname: pitchfork.com\ndescription: Capitol finally gets around to issuing 10 full-lengths from country legend Merle Haggard's 1965-71 peak era.\nsitename: Pitchfork\ndate: 2006-02-27\n---\nFew singers, country or otherwise, sound so downhearted as Merle Haggard. He specialized (still does, actually) in barroom laments that worry a sentiment threadbare in only a few verses, before moving on to a just-slightly-different sentiment in a new song. His lyrics, which expound on the typical honkytonk subjects of prison, poverty, sobriety, and doomed romance, are dense with wrenching wordplay and reversals of phrases that seem to heighten his self-loathing, turning his misery into a joke so half-hearted it'll make you cry just as easily as smile.\nBut it's his delivery that really sells the heartache. Instead of airing his emotions publicly, Haggard stoppers them with a formidably stoic front. Crucially, his masculine façade always sounds on the verge of crumbling, but not even a line like \"I'll give my everything, but you don't even try\" (from \"You Don't Even Try\") can unleash the flood. Haggard's tears always remain private, but rather than closing off these songs, his brave-faced delivery makes them all the more sympathetic, which is their most important quality. Country music is best when listeners can relate to the songs and invest them with their own experiences-- a notion Haggard obviously buys into. He even lays it all out in \"Someone Told My Story\", explaining the relationship between singer and audience better than any critic could:\nI played a brand-new record on the jukebox\nAnd I scarcely could believe the song I heard\nIt told of how you left me for another\nIt was almost like I'd written every word\nSomeone told my story in a song\nThe lyrics told of happiness and home\nThen it told of how you done me wrong\nSomeone told my story in a song\nThat song is from Haggard's 1967 album I'm a Lonesome Fugitive, one of ten included in Capitol's generous reissue set: five discs containing two albums each (four of the ten have never been available on CD before), along with more than 20 bonus tracks. Listening to them chronologically-- starting with Strangers in 1965 and ending with 1971's Someday We'll Look Back-- is like reading an epic American novel: Haggard has Twain's wit (no exaggeration), Steinbeck's eye for the vagaries of poor America, and Horatio Alger's bootstrap sentimentality. These albums are weighty with lyrical details drawn from Haggard's own life (his dirt-poor upbringing, rebellious adolescence, and numerous incarcerations, escapes, and marriages) and reveal an artist torn between his birthplace of California and his family's home in Oklahoma, between the familiarity of heartache and the suspected complacency of happiness, between the security of home and the lure of hopping that freight and seeing what's a little farther down the line.",
      "author": "Stephen M Deusner",
      "published_date": "2006-02-27",
      "word_count": 511,
      "fetch_timestamp": "2025-08-20T07:43:52.292826",
      "metadata": {
        "char_count": 3374,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:43:52.292821"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/3704-if-i-could-only-fly/",
      "source": "pitchfork",
      "artist_name": "Merle Haggard",
      "title": "Merle Haggard: If I Could Only Fly",
      "content": "---\ntitle: Merle Haggard: If I Could Only Fly\nurl: https://pitchfork.com/reviews/albums/3704-if-i-could-only-fly/\nhostname: pitchfork.com\ndescription: After languishing on Curb Records during the '90s, releasing albums that no\\n\\ one paid attention to (including, it sometimes ...\nsitename: Pitchfork\ndate: 2000-10-10\ncategories: ['reviews']\n---\nAfter languishing on Curb Records during the '90s, releasing albums that no one paid attention to (including, it sometimes seemed, himself), Merle Haggard signed with the Epitaph subsidiary Anti-. This move afforded the prolific veteran an opportunity to do exactly what made him a legend in the first place: compose excellent, commercially-unconcerned country music. But there's a discernible difference: Merle Haggard has grown into his surname, and it suits him well.\n\"Watching while some old friends do a line/ Holding back the want to in my own addicted mind\" is the lyric that opens If I Could Only Fly, an album strong enough to remind one of Haggard's work in the '60s and '70s. Accompanied by an acoustic guitar, snare brushes, occasional electric pickings and a barely audible organ, Haggard continues, \"Wishing it was still the thing even I could do/ Wishing all these old things were new.\" Its subtle power is enough to make my 23 year-old body somehow feel old and tired.\nAs strong as the opening track is, a whole album of it would leave me a shriveled heap of flesh and bone. Haggard, of course, realizes this. So he quickly jumps into the Hank Williams-inspired \"Honky Tonky Mama,\" which he delivers in an odd, but engaging, swallowed voice. After the laid back slide guitar of \"Turn to Me,\" the album hits another high point with its title track. Largely just an acoustic guitar, a harmonica and his smooth baritone, Haggard sings, \"I feel so good and then I feel so bad/ I wonder what I ought to do.\" Written here, it reads like the sad, simplistic reflections of an old man. Yet, everything about the song is so beautifully understated as to make one understand, if not sympathize.\nBut, again, Haggard moves through various subgenres with impressive ease. \"Crazy Moon\" sounds as if it were written from the shores of Hawaii; \"Bareback\" is Bob Wills-style country swing; \"Proud to Be Your Old Man\" is a blues-inflected ragtime number. And through Haggard's consistently subtle approach, the songs flow together with no disruption.\nDespite these worthy numbers, the best moments here are when, as on \"Wishin' All These Old Things Were New,\" and \"If I Could Only Fly,\" Haggard sticks closely to his acoustic guitar and alludes to his past. \"I'm Still Your Daddy,\" for instance, opens with the nearly spoken lines, \"I knew someday you'd find out about San Quentin.\" An unsettling harmonica rides through before he resumes: \"It's time you knew the truth about your papa/ I've not always been the man I am today.\" With compelling, confessional honesty, he goes on to address his criminal past, his former youthful naiveté, and to admit his wrongfulness.\nThe stripped-down \"Uncle John\" begins with a reference to the death of his father. Then, he informs us how his career began: \"Looking back, it all looks like a marathon/ And it started with an E chord I learned from Uncle John.\" The final number, \"Listening to the Wind,\" is just what you might expect: the description of a man at the latter end of his life, alternately listening to everything around him, and to the concerns in his own mind.\nThe obvious comparison is to Bob Dylan. Both men, thankfully, still have a message, albeit of a nature quite different from their earlier years. Although Dylan's Time Out of Mind is certainly a greater triumph, If I Could Only Fly shows that perhaps Haggard has more to say, given the upheaval of his youth. In either case, that Dylan and Haggard are still making music is a blessing to the rest of us. Perhaps, in listening to their reflections on aging and the accompanying doubts, we can learn how to face our own mortality with greater equanimity and fewer regrets.",
      "author": null,
      "published_date": "2000-10-10",
      "word_count": 672,
      "fetch_timestamp": "2025-08-20T07:43:52.343884",
      "metadata": {
        "char_count": 4026,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:43:52.343880"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "Merle Haggard",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-20\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nRap\nStar Line\nChance the Rapper\nBy\nAlphonse Pierre\nAugust 20, 2025\nRock\nLove Is Like\nMaroon 5\nBy\nLinnie Greene\nAugust 20, 2025\nExperimental\nKhadim\nMark Ernestus’ Ndagga Rhythm Force\nBy\nRae-Aila Crumble\nAugust 20, 2025\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-20",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-20T07:43:52.830067",
      "metadata": {
        "char_count": 7698,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:43:52.830056"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/",
      "source": "pitchfork",
      "artist_name": "Merle Haggard",
      "title": "The Pitchfork Review: All of the Latest Episodes",
      "content": "---\ntitle: The Pitchfork Review: All of the Latest Episodes\nauthor: Condé Nast\nurl: https://pitchfork.com/podcast/the-pitchfork-review/\nhostname: pitchfork.com\ndescription: Listen to every episode of Pitchfork’s podcast for music fans and obsessives.\nsitename: Pitchfork\ndate: 2024-01-11\ntags: ['web']\n---\nBrought to you by the music critics at Pitchfork, The Pitchfork Review is a show for music fans and obsessives who can’t wait to talk about the latest releases. Co-hosted by Pitchfork editor-in-chief Puja Patel and Reviews Editor Jeremy D. Larson, this podcast pulls back the curtain on our reviews and scores, dives deep into new music, and gives an expert guide to what’s exciting, what’s great, and what’s just plain terrible.\nListen to every episode of Pitchfork’s podcast for music fans and obsessives.\nRelated Articles\nThe Origins and Influence of Brian Eno’s Pioneering Album Ambient 1: Music for Airports\nIn the latest episode of Pitchfork’s podcast, our critics revisit the legendary producer’s classic 1978 LP, which was recently featured in our Sunday Review series.\nBy Pitchfork\nJeff Tweedy on Rock Criticism, the Pitfalls of Music Snobbery, and His New Book\nThe musician and author discusses World Within a Song, in which he writes about 50 songs that rearranged his brain, Wilco’s new album, and more.\nBy Pitchfork\nThe 2023 Music Grab Bag: Trends, Scandals, and Theories\nIn this episode of the Pitchfork Review podcast, our critics talk about the rise of the musical theater girlie, the fall of the 1975’s Matty Healy, and more. Plus: Alvvays’ Molly Rankin reveals the song she wishes she wrote.\nBy Pitchfork\nThe Best, Worst, and Most Surprising Albums of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about some of their faves from our 50 Best Albums of 2023 list and lament a few of the year’s biggest disappointments.\nBy Pitchfork\nWhy the Replacements’ Tim Is the Best Reissue of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about the revelatory new version of the beloved rock band’s 1985 LP. Plus, Replacements bassist Tommy Stinson reveals his perfect-10 album.\nBy Pitchfork\nBreaking Down Bad Bunny’s New Album and the Future of Puerto Rican Rap and Reggaeton\nIn this episode of The Pitchfork Review podcast, our critics dissect Bad Bunny’s latest and highlight a few new queer artists from Puerto Rico who are taking the island’s music to exciting new places.\nBy Pitchfork\nDebating the Best Songs of 2023, Part Two\nIn this episode of the Pitchfork Review podcast, our critics battle it out over some of their favorite songs of the year, by artists including Troye Sivan, Kendrick Lamar, Big Thief and more. Plus: Devendra Banhart tells us all about his dream collaboration.\nBy Pitchfork\nDebating the Best Songs of 2023, Part One\nIn this episode of the Pitchfork Review podcast, our critics take sides and discuss which tracks by some of 2023’s most exciting artists deserve a spot on our upcoming year-end lists.\nBy Pitchfork\nThe Good, the Bad, and the Swiftie of Taylor’s Eras Tour Concert Film\nIn this episode of The Pitchfork Review podcast, our critics wade through the ups and downs of the pop superstar’s new record-breaking live movie.\nBy Pitchfork\nWhat Drake Is Doing Wrong—and How He Can Fix It\nIn this episode of the Pitchfork Review podcast, our critics talk about what made them care about Drake in the first place, why his new album For All the Dogs is so frustratingly mid, and what he should do next.\nBy Pitchfork",
      "author": "Condé Nast",
      "published_date": "2024-01-11",
      "word_count": 579,
      "fetch_timestamp": "2025-08-20T07:43:52.882694",
      "metadata": {
        "char_count": 3506,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:43:52.882689"
      }
    },
    {
      "url": "https://pitchfork.com/features/",
      "source": "pitchfork",
      "artist_name": "Merle Haggard",
      "title": "Music Articles & Features",
      "content": "---\ntitle: Music Articles & Features\nauthor: Condé Nast\nurl: https://pitchfork.com/features/\nhostname: pitchfork.com\ndescription: Longform and in-depth analysis about the most exciting and important music being released today\nsitename: Pitchfork\ndate: 2025-08-14\ntags: ['web']\n---\nDekmantel Is a Dance Festival Shedding Light on the Underground\nWe touched down in Amsterdam for the 2025 edition of the left-of-center electronic festival and came back with some thoughts about live sets, drum heads, speaker cabinets, bass fiends, techno lords, and the simple power of naming some club-ready bangers.\nBy Jeremy D. Larson\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nNight Out 2025: Pitchfork and Them’s Showcase for the Future of Queer Music\nBy Olivier LafontantPhotography by Dillon Edlin\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nWhat Happened at Pitchfork’s Bladee Zine Launch\nBy PitchforkPhotography by Caroline Friedman\nA Rare Interview With Bladee, the Mystic Oracle of Internet Rap\nBy Meaghan GarveyPhotography by Jason Nocito\nHighlights From Pitchfork’s 2024 Year in Music Club Night\nBy PitchforkPhotography by Sam Wachs\nHighlights From Pitchfork and Thought Enthusiast’s Year in Music Panel\nBy PitchforkPhotography by Sam Wachs\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 18 Best Moments From Pitchfork Music Festival 2024\nBy Boutayna Chokrane, Nina Corcoran, and Heven Haile\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nHow Waxahatchee Made the Album of Her (Second) Life\nBy Andy CushPhotography by Bobby Doherty\nChasing the Goblin With Mabe Fratti, the Guatemalan Cellist at the Heart of Mexico City’s Avant-Rock Scene\nBy Philip SherburnePhotography by Filip Preis",
      "author": "Condé Nast",
      "published_date": "2025-08-14",
      "word_count": 347,
      "fetch_timestamp": "2025-08-20T07:43:53.165531",
      "metadata": {
        "char_count": 2280,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:43:53.165524"
      }
    },
    {
      "url": "https://pitchfork.com/features/lists-and-guides/",
      "source": "pitchfork",
      "artist_name": "Merle Haggard",
      "title": "Lists & Guides",
      "content": "---\ntitle: Lists & Guides\nauthor: Condé Nast\nurl: https://pitchfork.com/features/lists-and-guides/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2025-08-06\ntags: ['web']\n---\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nThe 62 Best Albums of 2023 So Far\nBy Dylan Green, Anna Gaca, Jeremy D. Larson, Sam Sodomsky, and Cat Zhang\nThe 48 Most Anticipated Albums of Fall 2023\nBy Madison Bloom, Nina Corcoran, Allison Hussey, Hattie Lindert, Evan Minsker, Jazz Monroe, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres\n17 Artists on Their All-Time Favorite Rap Songs\nBy Andy Cush, Jayson Greene, Clover Hope, and Alphonse Pierre\nThese Queens Can Sing: The 15 Best Songs by Today’s Drag Performers\nBy Julianne Escobedo Shepherd\nThe 30 Best Queer Music Movies\nBy Eric Torres, Nadine Smith, Tatiana Lee Rodriguez, Michelle Hyun Kim, and Emma Madden\nThe 46 Most Anticipated Albums of Summer 2023\nBy Alphonse Pierre, Madison Bloom, Evan Minsker, Eric Torres, Allison Hussey, Nina Corcoran, Jazz Monroe, Marc Hogan, and Matthew Ismael Ruiz\nThe 30 Best Music Festivals of 2023\nBy Evan Minsker, Jazz Monroe, Allison Hussey, Madison Bloom, Nina Corcoran, Eric Torres, and Matthew Strauss\nThe 43 Most Anticipated Albums of Spring 2023\nBy Jazz Monroe, Evan Minsker, Allison Hussey, Eric Torres, Nina Corcoran, Madison Bloom, and Matthew Strauss\nThe 34 Most Anticipated Albums of 2023\nBy Jazz Monroe, Rob Arcand, Marc Hogan, Eric Torres, Allison Hussey, Nina Corcoran, and Matthew Strauss\nThe 34 Most Anticipated Albums of Fall 2022\nBy Rob Arcand, Madison Bloom, Jane Bua, Nina Corcoran, Heven Haile, Allison Hussey, Evan Minsker, Jazz Monroe, Quinn Moreland, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres\nThe 37 Most Anticipated Albums of Summer 2022\nBy Madison Bloom, Nina Corcoran, Allison Hussey, Evan Minsker, Quinn Moreland, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres",
      "author": "Condé Nast",
      "published_date": "2025-08-06",
      "word_count": 410,
      "fetch_timestamp": "2025-08-20T07:43:53.455610",
      "metadata": {
        "char_count": 2614,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:43:53.455604"
      }
    },
    {
      "url": "https://pitchfork.com/features/lists-and-guides/the-story-of-outlaw-country-in-33-songs/",
      "source": "pitchfork",
      "artist_name": "Merle Haggard",
      "title": "The Story of Outlaw Country in 33 Songs",
      "content": "---\ntitle: The Story of Outlaw Country in 33 Songs\nauthor: Pitchfork\nurl: https://pitchfork.com/features/lists-and-guides/the-story-of-outlaw-country-in-33-songs/\nhostname: pitchfork.com\ndescription: Starring Johnny Cash, Tanya Tucker, Willie Nelson, Townes Van Zandt, and a host of other hell-raisers\nsitename: Pitchfork\ndate: 2018-10-29\ncategories: ['features']\n---\nThe story of outlaw country starts in very different places, depending on who is spinning the yarn. Historian Joe Nick Patoski wonders if it all started in 1972, after Willie Nelson’s home outside Nashville caught fire, prompting him to move back to Austin and play dancehalls around Texas. “Outlaws & Armadillos,” the Country Music Hall of Fame’s current exhibition, insists the movement started with Bobby Bare in the 1970s, when the headstrong country star negotiated a new contract with RCA Records that allowed him to produce his own albums; soon, Nelson and Waylon Jennings scored similar deals and made thematically cohesive albums like 1974’s Phases & Stages and 1973’s Honky Tonk Heroes. Or, as Steve Earle recalls—and he’s an expert—the whole affair happened because of Doug Sahm. (More on that in a minute.)\nWhile the locations and players change, what all these origin stories have in common is motivation: The outlaws wanted freedom. The singers wanted to sing the songs they liked, written by people like Guy Clark, Ray Wylie Hubbard, and Billy Joe Shaver, among others. They wanted to record at independent studios like Tompall Glaser’s “Hillbilly Central,” the Nashville hub for pretty much everybody even tangentially associated with the outlaw movement. They wanted to play the dancehalls like Armadillo World Headquarters in Austin, where long-haired hippies and buzzcut rednecks struck a precarious truce to enjoy some good tunes together. In short, they wanted to control their own musical destinies.\nEven before the term “outlaw” was popularly used to describe this movement, many of these artists were writing about their lives on the road with sophisticated self-reflection, self-deprecating humor, and desperado pathos. The outlaw lifestyle became their most prominent subject, for better or for worse. Jennings summed it all up with two crucial questions: In 1975, he released his signature hit, “Are You Sure Hank Done It This Way?”—a self-aware consideration of the changing nature of the industry. Three years later, he followed it with “Don’t You Think This Outlaw Bit’s Done Got Out of Hand?” which chronicled the drug busts and break-ups that accompanied the outlaw mantle.\nBy the late 1970s, the scene was already dying down. Nelson moved out to L.A., even recording an album of standards called Stardust in 1978. Armadillo World Headquarters closed two years later. But while the movement may have sputtered, the animating idea behind it remained powerful well into the ’80s, when the country mainstream made room for twangy eccentrics like k.d. lang and Lyle Lovett, as well as upstarts like Earle, Dwight Yoakam, and Lucinda Williams. In the ’90s, it was largely supplanted by alt-country rebels flipping the bird in the general direction of Nashville; however, in the last 10 years, the outlaw ethos has inspired a new generation of artists such as Miranda Lambert, Jason Isbell, and Sturgill Simpson, who provide a musical—and often political—alternative to the arena country mainstream.\nIn compiling these 33 representative songs, we’ve tried to keep our definition of “outlaw country” as broad as possible, in order to track many of its phases and stages. Our list, while by no means exhaustive, traces this music’s grit and glory from its contested origins to the present moment, from Texas dancehalls to streaming playlists, from Johnny Cash to Miranda Lambert.\nBut before we dig into all that, let’s take a moment to check in with a man who has seen every stage of the outlaw movement and lived to tell the tale: Steve Earle. A Texas native who cut his teeth in the Texas outlaw scene before moving to Nashville and learning the ropes from Guy Clark and Townes Van Zandt, he’s released 16 studio albums in the last 30 years—the most recent of which, last year’s So You Wannabe an Outlaw, reconsiders the heroes of his youth.\nSteve Earle: The outlaw thing happened because of Doug Sahm. Doug, mainly because he couldn’t get Big Red—a bright-red soft drink that tastes like bubblegum—leaves Mill Valley [outside San Francisco] and goes back to Texas. It was Doug who told Willie Nelson he should play Armadillo World Headquarters, and he told [Atlantic president] Jerry Wexler, “If you want progressive country music, you need to sign Willie.” That’s how we got Shotgun Willie and Phases & Stages.\nI saw a lot of weirdness and rampant drug and alcohol use in Texas. Not that I didn’t use alcohol and drugs, but it was out of control. I though Nashville would be more serious.\nWhen I got there, in November of ’74, the inmates were in charge of the fucking asylum. But it was shocking how few places there were to play, but that actually turned out to be a strength. One place was called Bishop’s Pub, and you could do a set and pass the hat or you could have two beers, but you couldn’t do both. There was a place called the Village, which is still there. Once a month there was the original Nashville writers’ night at the Exit/In. That was really hard to get on.\nI got on it because Guy Clark insisted. There was always an established act that closed the night, and he volunteered in order to get me on the show. Since there were so few places to play, any night of the week, we'd be at somebody’s house or in a hotel room, a bunch of people with guitars. We were trying to impress each other with what we’d written—or, mainly, we were trying to impress [Guy Clark’s wife] Susanna.\nCoke hadn’t quite hit yet when I got there. When I got there, it was just pot and a lot of alcohol and speed. There was a doctor named Snap, believe it or not, in East Nashville. My initiation was: Somebody took me out to him ’cause I was another person who could have a prescription. There wasn't enough speed to go around to get the songs written. First thing Guy Clark did when he met me was ask me if I had any, because I was so wired up. But I just kinda came like that. That’s one drug I’ve never taken a lot of.\nThat’s one of those things that makes me cry. I’d been furloughed out of jail into a treatment center, and it’s pretty emotional when you’re detoxing. I got letters from my parents and my uncle, but I got three letters from other musicians. I got one from Johnny Cash, I got one from Emmy [Harris], and I got one from Waylon. There wasn’t even a letter, just a letter with a snapshot of him, and on the back of it in his big, huge scrawl, it said, “I’m wearing this bandana for you.” It was a big deal for me.\nWaylon was complicated. He was pretty hard-headed, but he liked me for some reason, once I got on his radar. He recorded my song “The Devil’s Right Hand” and then later brought it into a Highwaymen session with Johnny, Willie, and Kris [Kristofferson]. I also produced a bonus track for the 20th anniversary of Wanted! The Outlaws [the best-selling 1976 compilation album with Jennings, Nelson, and more]. He did a song of mine called “Nowhere Road,” a duet with Willie. That might have been the last time I saw him. It was only a couple years before he passed away. I was on the road all the time and he was on the road all the time. Then he got sick. He lost a leg. But he kept working right up ’til the end.\nThe part of it that you’re talking about, where it began to document itself, is part of its demise. The worst of all those songs David Allan Coe wrote was “Willie, Waylon, and Me.” I really hate it. And I wrote some of those songs, like “It’s Our Town” and “Little Rock ’N’ Roller.” So I’m not innocent in this, but I didn’t do it on purpose. I didn’t do it because I was smart. I stumbled into it, but I learned a lesson from it.\nI remember reading in Country Music magazine, I think it was [the art and music critic] Dave Hickey who wrote about being on an airplane and sitting next to this roughneck coming in from an offshore rig. They got to talking, and he asked Dave what he did. He said, “I write about country music.” That guy says, “Those country singers, they used to sing about us. Now all they do is sing about each other.”\nYou do lose touch with your audience. Johnny Cash told me once, “I really love that song of yours, ‘Little Rock ’N’ Roller.’” About a week later, I was at a truck stop, and this truck driver came up to me and said the same thing. That was when the light went on. The reason they both relate to that song is because they both have kids and they both miss their kids when they’re on the road. That song is still valid because it wasn’t just about people feeling sorry for themselves because they’re riding around on a bus that cost more than most people’s houses. That’s what audiences don’t want to hear.\nA lot of them are girls. Miranda Lambert’s last record is a fucking masterpiece. Women are being marginalized in country music more than ever, just because bro country thinks it’s such a dude thing. Women are reacting to it and they’re the best songwriters. A lot of it’s Brandy Clark. She’s in the middle of it all and she’s a badass.\nEssay and interview by Stephen Deusner\nListen to selections from this list on our Spotify playlist and Apple Music playlist.\nBobby Bare: “Streets of Baltimore” (1966)\nGram Parsons may have made it famous, but “Streets of Baltimore” belongs to Bobby Bare, who first recorded the dramatic tune in 1966. From his album of the same name, “Streets of Baltimore” is a relic of Bare’s first stint on the RCA Victor label, widely regarded to be his breakout period in country music. Lyrically, the Tompball Glaser and Harlan Howards-penned song takes romantic devotion to its heart-wrenching extreme, telling of a man who “sold the farm to take [his] woman where she longed to be,” before getting unceremoniously kicked to the curb. Bare’s tender croon lends the song believable longing and regret, while the otherwise simple arrangement ups the drama with countrypolitan “oohs” and “ahhs.” Bare would go on to work with a laundry list of country artists, including Kris Kristofferson and Rosanne Cash, but “Streets of Baltimore” is a classic look at how he began with a truly outsider spirit: lonely, defiant, and searching for home. –Brittney McKenna\nListen: Bobby Bare, “Streets of Baltimore”\nJohnny Cash: “Folsom Prison Blues” (Live) (1968)\n“I sat with my pen in my hand, trying to think up the worst reason a person could have for killing another person, and that’s what came to mind.” This is how Johnny Cash explained the pivotal lyric in his signature song: “I shot a man in Reno/Just to watch him die,” sung near the beginning of “Folsom Prison Blues.” Originally appearing on his 1957 debut With His Hot and Blue Guitar, the shuffling, nihilistic prisoner’s anthem was delivered in its definitive form at Folsom in 1968.\nCash’s inimitable voice—both stern and desperate, unbreaking in the face of the inmates’ spontaneous applause—codified how we define the outlaw persona in country. Of course, nothing about “Folsom” is exactly as it seems: The crowd’s roar of approval after he introduces himself was rehearsed; the applause after that infamous lyric was added in post-production; that crucial lyric was possibly inspired by a Leadbelly recording of a traditional murder ballad. Yet, somehow, nothing can alter the song’s dark magic: Cash sings his blues like the gospel. –Sam Sodomsky\nListen: Johnny Cash, “Folsom Prison Blues” (Live)\nSir Douglas Quintet: “Mendocino” (1969)\nA childhood prodigy who wore handmade Western suits to play the steel guitar before he even hit puberty, Doug Sahm changed the landscape of the Texas sound—and country music as a whole—with the help of his ace collective, the Sir Douglas Quintet. Breaking through several Lone Star stereotypes, they fused the spirit of psychedelic California with funk, soul, and Tejano, all while paying close attention to the melodies and mod adornments pouring over from the British Invasion (so much so that Dick Clark once asked the band, “Where in England are you guys from?”). Actually hailing from San Antonio but based outside San Francisco, Sahm and crew dug into the rich culture of their home state for “Mendocino,” a radio hit that praised the spirit of West Coast free love while making deep references to Mexican music, and not superficially, either: Sahm was an extremely knowledgeable student of the arts, and could pull as easily from Mexico City’s underground rock as he did its traditional horns. With “Mendocino,” the Quintet proved that country could be just as groovy as the Grateful Dead, and with endless malleability, too. –Marissa R. Moss\nListen: Sir Douglas Quintet, “Mendocino”\nKris Kristofferson: “Sunday Mornin’ Comin’ Down” (1970)\nIn the late ’60s, Johnny Cash was the Man in Black and Kris Kristofferson was the Guy With the Broom. Working as a janitor at CBS’ recording studios, the former Army captain, Rhodes scholar, and aspiring literature teacher eavesdropped on Cash’s sessions and went home to write his own songs, with the dream of maybe running in the same circles someday. Soon, he befriended June Carter Cash, who checked out his tapes and played her favorites for Johnny when he got home at night. “That man’s a poet,” Cash responded. “Pity he can’t sing.”\nSomewhere along the way, all the rejection led Kristofferson to write the song of his lifetime: a sweeping, broken ballad called “Sunday Mornin’ Comin’ Down.” It was the one that turned Cash into a convert, painting such a stark, unglamorous portrait of a man at the end of his rope that you can’t help but hear yourself in it. When Cash debuted his hit cover, he refused to change a particularly controversial line (“Wishing, lord, that I was stoned”) so as not to lose the integrity of Kristofferson’s message. Since then, a lot of singers have taken it on, but the song remains tethered to Kristofferson’s legacy. As he came to terms with his strengths and limitations—he never really did learn to sing—it remains his unforgettable ode to the trying times behind him and the hope that’s always just around the corner. –Sam Sodomsky\nListen: Kris Kristofferson, “Sunday Mornin’ Comin’ Down”\nWillie Nelson: “Me and Paul” (1971)\nBefore Willie Nelson was a national treasure and our collective wise, stoned grandfather, he was a down-and-out kid with a guitar, selling songs around Nashville. His 1971 masterpiece Yesterday’s Wine was somehow already his 13th studio album, and he was pushing 40 by the time of its release. Still, he was far from a household name. Facing career frustrations, a recent divorce, and a burnt-down ranch in Tennessee, he compiled this record of older compositions and heady new, astrologically-linked concept songs that put him even further from the good graces of his label.\nNear the end of the album is its stubborn, road-weary highlight, “Me and Paul.” The “Paul” in the title referred to his drummer, Paul English, the backbeat of his band and his reminder to always push onward, in both a musical and spiritual sense. It’s an ode to the travels they’d undertaken together, the unfriendly faces they’d seen along the way and the drive they inspired in each other to fight onward. Unsurprisingly, Yesterday’s Wine would be another commercial failure, but the outlaw anthem at its heart proved prophetic. Willie was receiving his education on the road, and soon America would be learning from him, too. –Sam Sodomsky\nListen: Willie Nelson, “Me and Paul”\nSammi Smith: “Kentucky” (1972)\nSammi Smith begins “Kentucky” pillow-talk quiet, the approach that two years earlier launched her signature hit, a gender-switched version of Kris Kristofferson’s “Help Me Make It Through the Night.” Smith rarely gets mentioned in outlaw country discussions because lush, pop-inclined records like “Help Me…” were countrypolitan exemplars of what the outlaws were presumably fighting. Also not helping her cause: She was a woman in a good-ol’-boys club that fetishized not being tied down and included so few women, you could count them on your cowboy boots. But Smith ran with outlaws from the start. Her tourmate Waylon Jennings dubbed her a “girl hero,” not a “girl singer” as country women were then commonly known, and Willie Nelson booked her for his first Fourth of July Picnic in 1973.\nHere, she’s the outlaw—on the road, alone and free—when she hears a man called “Kentucky” sing and falls in love. In real life, this was Kentucky-born Jody Payne, her husband and guitarist for Willie Nelson’s Family Band. In the raucous second verse, which abandons countrypolitan for glorious outlaw-predicting rock and includes more cymbal crashes than any other country record could handle, she and Payne roam from gig to gig together. But Sammi’s singing lead. –David Cantwell\nListen: Sammi Smith, “Kentucky”\nTownes Van Zandt: “Pancho and Lefty” (1972)\nYou can’t talk about outlaw country music without talking about “Pancho and Lefty,” one of the genre’s best-loved songs—and you can’t talk about songwriting without paying respect to Townes Van Zandt, one of music’s finest songwriters, genre be damned. Willie Nelson and Merle Haggard’s take on “Pancho and Lefty” may have topped the charts, but it’s Van Zandt’s original—which appeared on his 1972 album The Late Great Townes Van Zandt—that truly captures the complexity of its characters. The storied songwriter follows two Mexican bandits whose relationship is marked by betrayal, ending with Pancho dead at the hands of the federales. (Some folks theorize that Pancho is the real-life bandit Pancho Villa.) With his gently picked guitar and aching vocals, Van Zandt makes the case for the alienation felt by both men, imploring the listener, “Save a few [prayers] for Lefty too.” It cemented Van Zandt’s legend, as he knew; as he introduces the song in the 1981 documentary film Heartworn Highways, “I’ll play a medley of my hit.” –Brittney McKenna\nListen: Townes Van Zandt, “Pancho and Lefty”\nThe Flatlanders: “Dallas” (1972)\nOne of the biggest flops of the outlaw movement eventually became one of its biggest successes. Formed in 1972, the Flatlanders were a strange-even-for-the-’70s band, distinguished by Jimmie Dale Gilmore’s high warble, Steve Wesson’s cosmic singing saw, and an abiding interest in Buddhism. For a year or so, they were one of the most promising groups in the Texas Panhandle, but their first single, a soaring country tune called “Dallas,” went nowhere. It’s a shame, too: Featuring some dusty harmonies and a stately melody that’s both old-school country and new-school outlaw, the song is similar to Gram Parsons’ “Sin City,” minus the moralizing. It depicts the Texas city as the antithesis of both Lubbock and its music scene: Here, the city may look beautiful from a DC-9 at night, but it’s ugly at street level. When “Dallas” failed to burn bright, the Flatlanders were dropped by their label and quietly went their separate ways. But Gilmore, Hancock, and Ely all enjoyed such prominent solo careers in the late 1970s that the Flatlanders became a cult commodity over the next few decades, thanks to Rounder Records’ appropriately titled More a Legend Than a Band. –Stephen Deusner\nListen: The Flatlanders, “Dallas”\nBilly Joe Shaver: “I Been to Georgia on a Fast Train” (1973)\nThe pride of Corsicana, Texas, was one of the finest songwriters associated with the outlaw movement, as he depicted country life with humor, wit, and a dusty poetic style. His debut single, “I Been to Georgia on a Fast Train,” off his needs-to-be-reissued Old Five and Dimers Like Me, was covered by Johnny Cash, Emmylou Harris, and…Phish? And Waylon Jennings recorded a full album of Shaver’s tunes, 1973’s epic Honky Tonk Heroes.\nWith its runaway-train drumbeat and rambling guitar licks, “Georgia” is a sharply defiant and studiously autobiographical tune; in it, he describes his mother leaving him “the day I was born,” his grandmother raising him, and quitting school after eighth grade. However, it doesn’t capture two of the most alarming details of Shaver’s life: He lost a few fingers in a factory accident when he was a young man, and he shot somebody during a bar brawl when he was an old man. Of the latter incident, he described it as only he could: “I hit him right between a mother and a fucker.” –Stephen Deusner\nGary P. Nunn: “London Homesick Blues (Home With the Armadillo)” (1973)\nGary P. Nunn had to travel halfway around the world to really appreciate the Lone State State. In the early 1970s, he was playing bass with Michael Murphey, then a rising country star on a major label and a world tour. During a stopover in England, Nunn found himself stuck in a cramped flat with no heat and a cowboy wardrobe that drew jeers from everyone on the street. From this miserable experience he got “London Homesick Blues,” in which he enumerates the joys of Texas: armadillos and good country music, not to mention “the friendliest people and the prettiest women you’ve ever seen.” Armadillos, it should be noted, was a popular nickname for outlaw country fans back in Texas, which makes the song an affectionate anthem for the scene he’d left behind.\nOf course it didn’t take long for Nunn to get back home, whereupon he joined Jerry Jeff Walker’s legendary Lost Gonzo Band. Walker put his new bass player on the spot for an unrehearsed performance of “London Homesick Blues” at the Luckenbach Dancehall, and thank god the tapes were rolling. That performance caps Walker’s landmark 1973 live-ish album Viva Terlingua! and eventually became the theme song for “Austin City Limits.” –Stephen Deusner\nListen: Gary P. Nunn, “London Homesick Blues (Home With the Armadillo)”\nRay Wylie Hubbard: “Up Against the Wall, Redneck Mother” (1973)\nThe rednecks and the hippies may have found common ground at the Texas dancehalls where Willie and Waylon and Jerry Jeff played, but that doesn’t mean the truce between these two culturally oppositional groups was always easy. In fact, Ray Wylie Hubbard’s signature tune suggests that old tensions and prejudices remained. Born of an errant beer run that put the long-haired Hubbard in a middle-of-nowhere hick bar, “Up Against the Wall, Redneck Mother” pokes fun at both rednecks and their mothers, the latter of whom are responsible for the former “hanging out in honkytonks, just kicking hippies’ asses and raising hell.” Thanks to Jerry Jeff Walker’s rousing cover on his 1973 album Viva Terlingua!, the song became an outlaw standard, albeit one that Hubbard still finds a little embarrassing. “The way I this song is, this song probably shoulda never been written, let alone recorded, let alone recorded again,” he stated in a 1998 live performance. “I feel bad about it, except twice a year I go out to my mailbox. I get a letter and there’s a check in it, and by God, it ain’t that bad.” –Stephen Deusner\nListen: Ray Wylie Hubbard, “Up Against the Wall, Redneck Mother”\nGuy Clark: “L.A. Freeway” (1975)\nIf Townes Van Zandt was the poet of the folk-country outlaws, then Guy Clark was the prophet, spinning masterful, vivid tales about wayward wanderers, his Texas childhood, even the beauty of a homegrown tomato. But when Clark wrote “L.A. Freeway,” he was living in Los Angeles, working in a dobro factory and wondering if his work would ever see the light of day in risk-averse, mainstream Nashville. Anchored by his warm, dusty vocals and simple but effective guitar riff, “L.A. Freeway,” from Clark’s debut album Old No.1, was built from the intimate details of his vagabond life that resonated deeply with a restless generation. (Part of his genius was that he incorporated everyday items, like unpacked dishes and moldy wafers, into his tales.) Who didn’t have a place they were dying to leave, if they could only make it out alive—be it a relationship, a hometown, or state of mind? With songs like “L.A. Freeway,” Clark helped to introduce an emotional side to outlaw country, opening up the genre to not only buck Music Row expectations but its carefully curated masculinity, too. –Marissa R. Moss\nListen: Guy Clark, “L.A. Freeway”\nJerry Jeff Walker: “Pissin’ in the Wind” (1975)\nJerry Jeff Walker is an unlikely outlaw legend: Born in upstate New York, he was a Greenwich Village folkie in the ’60s best known for the cloying “Mr. Bojangles.” In 1970, he decamped to Texas, hoisted his freak flag high, toured his Lost Gonzo Band all over the state, and developed a reputation as a dynamic outlaw showman. In 1975, when he was at his most popular, he closed out his studio album Ridin’ High with this ode to stalled creativity and the pressures of outlaw fame. He opens with a dead-on parody of Kristofferson’s phlegmatic intro to “The Pilgrim – Chapter 33” and closes with a gleefully vulgar twist on Dylan’s “Blowin’ in the Wind.” In between are four minutes of drunken self-deprecation and hilarious industry in-jokes, as Walker wonders why anybody would ever trust him with a song or, god forbid, money to book studio time: “Pissin’ in the wind, and it’s blowin’ on all our friends.” Who else could turn an outlaw pisstake into such an inviting sing-along? Who else would want to? –Stephen Deusner\nListen: Jerry Jeff Walker, “Pissin’ in the Wind”\nDavid Allen Coe: “You Never Even Called Me By My Name” (1975)\nJohn Prine, a modern patriarch of the Americana community, isn’t always considered a true figure in the outlaw country movement thanks to his folk pedigree. That doesn’t mean he didn’t contribute to the genre, though: With Steve Goodman, Prine penned “You Never Even Called Me By My Name,” a lonesome-sounding shuffle that would become one of David Allen Coe’s biggest hits. Musically, the song plays like any other barroom tale of brokenness and bad luck, with chiming piano and swooning vocal harmonies. A cursory listen to the lyrics, though, reveals a biting critique of the Nashville music industry and the Music Row mentality. A biting monologue from Coe at the song’s bridge breaks down the “perfect country and Western song” before turning to a satirical verse, ending on a truly laugh-out-loud line about his fictional mother’s untimely demise. A big, fat fuck-you to the music industry, the song holds more power in Coe’s hands than it would have in Prine’s, with the former’s pitch-perfect balance of sarcastic and somber making the track as hummable as it is thought-provoking. –Brittney McKenna\nListen: David Allen Coe, “You Never Even Called Me By My Name”\nJessi Colter: “I’m Not Lisa” (1975)\nThe early days of outlaw country music skewed heavily male, and figures like Merle Haggard and Waylon Jennings still serve as figureheads for the genre today. Women like Jessi Colter brought new perspectives to the mix, though, a dynamic clearly heard in Colter’s 1975 song “I’m Not Lisa.” Off her 1975 sophomore album I’m Jessi Colter, “I’m Not Lisa” showed Colter to be not just a formidable vocalist but a gifted songwriter, spinning a yarn about a woman somberly trying to connect with a lover who still pines for an old flame. Like a lonesome inverse of Dolly Parton’s “Jolene,” “I’m Not Lisa” is a clever take on a heartbreak song, a well-trod subject in outlaw country, made all the more powerful by Colter’s stirring vocals and aching delivery. The track was not just a country hit but a pop one, too, bringing outlaw music to the Top 40. The song would be covered by Rosemary Clooney, Marianne Faithfull, and Faith Hill over the years, and Colter would go on to be remembered as an essential player in the outlaw movement for it—earning, among other accolades, a Grammy Hall of Fame Award in 2007 for her part of the compilation Wanted! The Outlaws. –Brittney McKenna\nListen: Jessi Colter, “I’m Not Lisa”\nWaylon Jennings: “Are You Sure Hank Done It This Way” (1975)\nWaylon Jennings’ signature hit, off his 1975 Dreaming My Dreams, is a lot of different songs all at once. On the surface, it’s a midtempo jam defined by Billy Ray’s liquid guitar coursing through Cowboy Jack Clement’s pristinely gritty production: a new sound in country music. Dig a little deeper and it’s an indictment of country music, which Jennings depicts as too mired in the past. He’s not using Hank Williams as a cudgel against the mainstream, because his hero wore rhinestone suits and drove shiny new cars, too. “We need to change,” Jennings asserts, even as he subtly transforms the song into an anthem of self-reckoning.\nA first-wave outlaw, Waylon got his start playing for Buddy Holly in the ’50s and had been gigging for more than a decade with “a five-piece band looking at the back side of me.” Here, he’s wondering aloud what all those years on the road will add up to. But at its core, “Are You Sure Hank Done It This Way?” is an outlaw mission statement—make that a mission question—that challenges Waylon and his friends to shed the burden of their heroes’ influence. That change they need involves breaking old rules, finding new sounds, and ultimately blazing new trails. Don’t do it like Hank. Do it your own way. –Stephen M. Deusner\nListen: Waylon Jennings, “Are You Sure Hank Done It This Way”\nEmmylou Harris: “Bluebird Wine” (1975)\nEmmylou Harris’ rendition of Rodney Crowell’s “Bluebird Wine,” which kicks off her classic 1975 album Pieces of the Sky, was the moment when the Birmingham, Alabama singer defined what she’d do for the rest of her career. On her major label debut, she told stories from her travels (“Boulder to Birmingham,” a ballad for her late mentor, friend, and collaborator Gram Parsons), reinterpreted songs so creatively you’d forget you’d ever heard them before (the Beatles’ “For No One”), and sang it all with an inimitable sense of grace and heartbreak.\nHarris opens the record with “Bluebird Wine,” a raucous song that might be about a toxic, enabling relationship between two alcoholics. It’s hard to tell from her performance, though: As she hollers about hitting her stride over fiddles and banjos and low electric guitars like revving engines, it sounds like the start of a celebration. Even now, if you ask Harris, the music feels as hopeful as a bright, blue sky: “I never thought of it as a hedonistic song,” she reflected in 2013. “I see it more as a song about possibilities.” –Sam Sodomsky\nListen: Emmylou Harris, “Bluebird Wine”\nMarshall Chapman: “Somewhere South of Macon” (1976)\n“Somewhere South of Macon” opens with little more than one of the bouncing, burping bass lines so identified with the outlaw sound. But then the renowned singer-songwriter Marshall Chapman, one of the few women artists among the founding outlaws, begins to sing about the little town she’s from and its stifling expectations for teen girls. Despite her mother’s warnings to hide not only her petticoats but her unconventional emotions, she’s gone her own way, even making love for the first time out in dark woods. Now she’s leaving, preferring to “roam and ramble and live until I die” than stay and become some working stiff’s wife. Spooky violins and humid cellos play call-and-response with her itchy alto, and Chapman’s melody and Southern gothic arrangement create an atmosphere of claustrophobic mystery. But the only real mystery is why Chapman stuck around so long: “My folks, they feel forsaken,” she cries as the bus pulls out of town. “Me, I’m feelin’ free.” –David Cantwell\nListen: Marshall Chapman, “Somewhere South of Macon”\nTanya Tucker: “Texas (When I Die)” (1978)\nTanya Tucker was nine albums into her career, yet still only 20 years old, when she released “Texas (When I Die),” a cover of a song initially recorded by Ed Bruce one year earlier. Commercially, Tucker’s version—off her album TNT—flattened Bruce’s, climbing Billboard’s Hot Country Chart before peaking at Number Five. It remains one of Tucker’s best-loved songs, encapsulating her devil-may-care attitude in both its hell-raising subject matter (“When I die, I may not go to heaven”) and in her decision not to swap mentions of “cowboy” to “cowgirl.” Sonically, the song was one of just a few on TNT that stayed true to Tucker’s country roots; much of the album showed her growing interest in rock music, including the covers of Chuck Berry and Elvis Presley songs. Soulful piano, wailing slide guitar, and a Willie Nelson name-drop all cemented Tucker’s firm place in the outlaw country scene, a pedigree she’s held on to even while exploring rock and pop later in her career. –Brittney McKenna\nListen: Tanya Tucker, “Texas (When I Die)”\nGary Stewart: “Single Again” (1978)\nGary Stewart sings like he doesn’t want you to listen. His voice quivers with an earnest, country jumpiness, less Grand Ole Opry and more like he reluctantly grabbed the microphone at a karaoke bar and started spilling his soul to the strangers around him. It’s this vulnerable quality that allows the Kentucky-born songwriter to sell barstool ballads (like his stunningly titled breakthrough single “She’s Actin’ Single (I’m Drinkin’ Doubles)”) just as well as his more upbeat rockers.\n“Single Again,” from his fifth album, 1978’s Little Junior, combines these two styles in a beer-soaked stomper about embracing loneliness that’s never quite as sturdy as he wants you to think. Just hear those long gaps between his words as he recalls seeing his ex “drinking champagne…. Showing off a diamond ring.” The music plays tough with its macho southern rock chug, but don’t be fooled: He’d take her back in a heartbeat. –Sam Sodomsky\nListen: Gary Stewart, “Single Again”\nRodney Crowell: “I Ain’t Living Long Like This” (1978)\nRodney Crowell’s “I Ain’t Living Long Like This” is a straight shot of back-to-basics pride, a wild ride of roadhouse boogie-woogie rock ‘n’ roll with allusions to forefather Jimmie Rodgers’ oft-covered “In the Jailhouse Now” and Elvis’ “Jailhouse Rock.” At the same time, it’s a record that incorporates more recent influences: the Band, Gram Parsons, even new wave. In it, the Houston-bred Crowell keeps getting hauled off in handcuffs and fears for his mortality—but his adenoidal twang, randy eye, and witty charm suggest he’s having too much fun to stop the outlaw game anytime soon. (As he intones, “Go on and do it but just don’t get caught!”) A few years later, Waylon Jennings covered the song for his first 1980s Number One, and by the new decade’s end, Crowell was scoring country hits of his own, as both producer for then-wife Rosanne Cash and as a chart-topping solo act. –David Cantwell\nListen: Rodney Crowell, “I Ain’t Living Long Like This”\nTerry Allen: “Amarillo Highway (For Dave Hickey)” (1979)\nBefore he was a songwriter, Terry Allen was an architecture student, professor, painter, sculptor, conceptual artist, and all-around bohemian, as all of those pursuits imply. He is also the only outlaw to dedicate a song to an art critic—in this case, Dave Hickey, the so-called “Bad Boy of Art Criticism” who included two of Allen’s paintings in an early ’70s exhibition in Amarillo. “Amarillo Highway” is a badass outlaw classic about the long drive between that city and Allen’s hometown of Lubbock, off by itself on the vast Llano Estacado region of the Southwest.He debuted the song at one of Willie Nelson’s first Fourth of July picnics, had it covered by Bobby Bare in 1975, and recorded the definitive version himself for his second album, 1979’s Lubbock (on everything).\nShortly before making that album, he assembled what became known as the Panhandle Mystery Band, who lend the song a rickety propulsion, as though the wheels might fly off at any moment. Allen sings that chorus—“I’m a panhandlin’ manhandlin’ post holin’ high rollin’ Dust Bowlin’ daddy”—with a grizzled self-awareness that gives the song its sunbaked philosophical bent, as though “makin’ speed up ol’ 87” to Amarillo was a true hero’s quest. –Stephen Deusner\nListen: Terry Allen, “Amarillo Highway (For Dave Hickey)”\nMerle Haggard: “I Think I’ll Just Stay Here and Drink” (1980)\nMerle Haggard was an outlaw before there was a movement, and not just because he did time: He was a sensitive, thoughtful singer-songwriter with a romantic, chip-on-his-shoulder masculinity and rock ‘n’ roll swagger, and he released a tribute to Bob Wills years before Waylon declared the Western musician “still the king.” By 1980, outlaw country was past its commercial peak, but Merle just carried on as he always had with “I Think I’ll Just Stay Here and Drink,” a barnburner that nails the hard-swinging, improvisational approach of his live shows.\nHere, Haggard is at a bar, stewing over a woman who doesn’t care what he thinks but, he says, couldn’t change his mind even if she did. That premise, though, is really just an excuse to let the band go. Fully three minutes of this rowdy four-and-a-half minute track, an eternity for country radio, is stuffed with solo after thrilling solo—electric guitar, piano, more guitar, saxophone, still more guitar. When they couldn’t land on a shorter edit he liked, Merle said, essentially, screw it, just press it and let the DJs deal with it. It went to Number One. –David Cantwell\nListen: Merle Haggard, “I Think I’ll Just Stay Here and Drink”\nSteve Earle: “Guitar Town” (1986)\nThe debut album by Steve Earle was a long time coming. More than a decade before its release in 1986, the Virginia-born songwriter ran away from home and began searching for his hero, Townes Van Zandt. Once he got to Nashville, not only did the young prodigy work with Townes but he also ended up recording with Guy Clark, writing songs for Carl Perkins, and appearing among his heroes in the definitive country documentary Heartworn Highways. So, when Earle finally got the spotlight and his own record label, how did the young country lifer introduce himself? “Hey pretty baby, are you ready for me?/It’s your good rockin’ daddy down from Tennessee.”\nAs far as origin stories go, the title track to Guitar Town is humble but prescient. More interested in the gritty Americana-influenced rock that Bruce Springsteen had been honing throughout the decade, Earle quickly steered clear of the pearly sheen and dead-eyed twang of so much ’80s country music. While Guitar Town still bears that pristine ’80s sound, you can hear Earle trying to shed it off in those constant grunts and “ha’s!” between his words, like he’s still working this all out. He’d get darker and more political with time; for now, he just wanted to rock. –Sam Sodomsky\nListen: Steve Earle, “Guitar Town”\nLucinda Williams: “Crescent City” (1988)\nA popular legend about Lucinda Williams involves her being kicked out of school in 10th grade for refusing to recite the Pledge of Allegiance. A precocious act of protest, it also reflects the seriousness with which she’s always taken her forms of expression. Williams, a lifelong perfectionist, makes music that sways and swells to her own worn-in, deeply human visions of the country. She sings in a low, bluesy drawl that can sometimes sound just half-awake, like the stranger at the bar you have to lean in close to hear. But once you’re keyed to her rhythm, you find yourself hanging on every word.\nAt the end of the ’80s, Lucinda Williams’ self-titled third album was not an easy sell. Too country for the rock crowd and too heavy for the country folks, her eventual breakthrough record, which she spent eight years composing, seemed like a doomed project. But what some early audiences heard as a flaw, Williams knew was a strength. When it was finally released via Rough Trade, the album’s centerpiece—the swinging singalong “Crescent City,” about her hometown of New Orleans—felt even more triumphant. “This town has said what it had to say,” she sang. “Now I’m headed for that back highway.” Her words rang true; her work ahead would continue to skirt the beaten path with the intensity of someone on a long, mysterious mission, the kind that spans a lifetime. –Sam Sodomsky\nListen: Lucinda Williams, “Crescent City”\nMiranda Lambert: “Kerosene” (2005)\nForget that Miranda Lambert got her start on a reality TV show—and definitely forget that it was a corny “American Idol” knockoff she didn’t even win. When she made her major-label debut, 2005’s Kerosene, she made sure you knew she was allying herself with the outlaws, with a combustible country-rock sound and a branding-iron voice that could convey defiance, humor, and heartbreak all with equal clarity.\nKerosene’s title track train-robs a melody from Steve Earle’s “I Feel Alright” and doesn’t look back. (Though, fairly, Earle is credited as a cowriter.) It’s a song for the dumped that keeps getting distracted by her skepticism of an industry she seemed reluctant to enter: “Dirty hands ain’t good for shakin’/Ain’t a rule that ain’t worth breakin’.” More than a decade later, Lambert still thrives in a business that only plays 10.4% female artists on the radio, and her defiant attitude has inspired subsequent waves of mainstream and fringe country acts, including her fellow Pistol Annies Ashley Monroe and Angaleena Presley, who are just itching to “light ’em up and watch them burn.” –Stephen Deusner\nListen: Miranda Lambert, “Kerosene”\nJamey Johnson: “In Color” (2008)\nBefore Chris Stapleton brought a bearded tinge of baritone soul to the country charts, there was Jamey Johnson, an Alabama-born, surly-bearded renegade who scored a hit with “In Color” from his second album, That Lonesome Song. Deeply melodic but packed with vibrant, heartbreaking storytelling about the power of memory and the importance of passing tales along from one generation to the other, “In Color” was a classic country outlier in the era of pre-pop Taylor Swift and “Chicken Fried” Zac Brown. (It was a typically unpredictable step from Johnson, who also had a hand in “Honky Tonk Badonkadonk,” Trace Adkins’ ridiculous, borderline offensive bro-country precursor.) The fact that “In Color” fared well, and even scored a Grammy nomination, seems to have convinced Johnson that success is both a blessing and a curse: it’s been eight years since his last album of originals. And, sure, that silence has cost him—but, in country music, freedom itself can be priceless. –Marissa R. Moss\nListen: Jamey Johnson, “In Color”\nHayes Carll: “KMAG YOYO” (2011)\nCountry music has a storied tradition of supporting the military; to some, there’s nothing more American than unflinching pride, even when it shields reality. But Houston’s Hayes Carll wasn’t interested in gesturing when he wrote “KMAG YOYO,” a nod to the acronym used by soldiers to mean “Kiss My Ass Guys, You’re On Your Own.” In the style of Bob Dylan’s “Subterranean Homesick Blues,” Carll wrote about what really happens overseas, and the misguided sort of jingoism and heroism that plagues the interests of so many wars, while also illustrating just how easy is it to lose sense of reality in an environment unimaginable to most of us. Fresh from contributing to the soundtrack of Gwyneth Paltrow’s film Country Strong, “KMAG YOYO” certainly wasn’t Carll’s best chance to keep those new fans he made at the box office—instead, many likely KMAG-ed him right back. And his anthem definitely wasn’t from the cash-cow, flag-waving Toby Keith school, either. But it sure told the truth. –Marissa R. Moss\nListen: Hayes Carll, “KMAG YOYO”\nJason Isbell: “Cover Me Up” (2013)\nWhether he’s country, Americana, or something in between, Jason Isbell is a prime example of how to pave a career with nothing but a set of stellar songs, an ace band, and the determination to do it all on your own. And if that’s not outlaw, what is? After leaving the Drive-By Truckers, Isbell released a string of solo LPs before launching his own Southeastern Records, finding kinship in producer Dave Cobb and getting sober to make his transitional masterpiece Southeastern. With backing from members of the 400 Unit, its opening track, “Cover Me Up,” is a love song so steeped in passion and commitment that it transcends genre altogether, anchored in a simple acoustic strum and Isbell’s voice floating from howl to a quiver. Still a live staple for Isbell, it’s also a benchmark of transformation—for how one album can shape the future of a career, and for how giving something up can mean getting so much in return. –Marissa R. Moss\nListen: Jason Isbell, “Cover Me Up”\nSturgill Simpson: “You Can Have the Crown” (2013)\nSturgill Simpson told the New York Times a few years ago that, despite the frequent comparisons, he’d never listened much to Waylon Jennings. Either Simpson was pulling our legs or his Waylon doppelgänger vocal on “You Can Have the Crown,” from his pre-fame debut, is among the most miraculous coincidences in pop history. Simpson’s tone and attack, his references to recreational drug use and the musician’s life, even his just-some-good-ol’-boys allusion to watching reruns of “The Dukes of Hazzard”: This is Waylon 101.\nAt the same time, Simpson’s class consciousness takes him where Jennings rarely ventured. He’s glad he’s struggling to fill the tank of an SUV rather than driving a tank in the Persian Gulf, and he knows his computer searches into the meaning of life will result in just another list of shit he can’t afford. Most current of all are the rhythms driving him, nodding more to punk-aware alt-country than rock-and-swing-loving outlaw country; they’re manic, twitchy, and close to the edge as Sturgill imagines he might actually hold up a bank. Sure, audiences like him, he admits. But at home, his broke ass is still just known as “King Turd.” –David Cantwell\nListen: Sturgill Simpson, “You Can Have the Crown”\nEric Church: “The Outsiders” (2014)\nEric Church and his band’s boasts aren’t really the outsider kind here. As declarations go, calling yourselves “junkyard dogs” and “alley cats” seems quaint; as rebellions go, “we’re the ones burning rubber off our tires” is pretty high-school. As a record, though, “The Outsiders” is pure outlaw, its prime target the bros of mainstream country radio. Where Florida Georgia Line, Luke Bryan, and co. are smooth and self-centered, focused on getting laid and getting buzzed, Church is noisy and self-referential, with thunderous arena beats, screaming guitars, and a bellowed backing chorus; his talk-raps make plain the connections between Charlie Daniels or Hank Williams Jr., say, and hick-hop, the popular country-rap hybrid that’s yet to make a dent at radio. The last section of the record further separates this superstar from the Nashville pack as, following a brief funk-rock segue, his band throws down a pretty fair Metallica imitation. With “The Outsiders,” Church proves himself the rare star trying to change the game from the inside. –David Cantwell\nListen: Eric Church, “The Outsiders”\nMargo Price: “Hands of Time” (2016)\nWhen Margo Price wrote her debut album, Midwest Farmer’s Daughter, she could barely get the time of day from Music Row record labels: It was too traditionally country for modern Nashville, a genre already reluctant to support work from women—especially ones unwilling to shift toward a Hot 100 pop sound. But Price, born in rural Illinois, stuck to her vision, never wavering on her songs like the album opener “Hands of Time,” a six-minute opus that charts her many personal tragedies, including the death of a child and many broken dreams. It returned country music to an era where true storytelling reigned, and it also updated the genre through Price’s smart sense of rock and soul and her urgent, unvarnished production. Since then, Price has made a career out of speaking her mind and staying true to her gut, so it’s no wonder she’s found a kindred spirit in the original outlaw Willie Nelson, who appeared on her second record in the duet “Learning to Lose.” He even let her formulate her own Willie’s Reserve strain of weed. –Marissa R. Moss\nListen: Margo Price, “Hands of Time”\nTyler Childers: “Feathered Indians” (2017)\nThe 27-year-old Tyler Childers’ rise—from years spent chugging on the local Kentucky circuit to opening for John Prine—is one of the most outlaw things about him. Armed with nothing but a set of songs that paint an unshakable picture of both life in modern Appalachia and an uncanny grasp on the meaning of love, he released his Sturgill Simpson and Dave Ferguson-produced debut LP, Purgatory, without any label support and very little traditional media. Since then, he’s amassed a sturdy following, sold-out tours, and streaming numbers that have perplexed an industry that can’t comprehend success unless it comes from a straight-down-the-middle approach. Childers, who grew up on both classic country and grunge, leads by his instincts alone. And it’s his voice, peppered with both the knowledge of the ages and the innocence of youth, that makes a song like “Feathered Indians”—about sex, connection, and the people who finally turn your apathy into optimism —so effective. Then it’s the lyrics, a mix of plain-talk honesty and beguiling metaphors, that tip the scales to timeless. –Marissa R. Moss\nListen: Tyler Childers, “Feathered Indians”\nContributors: David Cantwell, Stephen Deusner, Brittney McKenna, Marissa R. Moss, Sam Sodomsky",
      "author": "Pitchfork",
      "published_date": "2018-10-29",
      "word_count": 8224,
      "fetch_timestamp": "2025-08-20T07:43:53.648583",
      "metadata": {
        "char_count": 49153,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:43:53.648576"
      }
    }
  ],
  "total_articles": 9,
  "total_words": 13264,
  "extracted_at": "2025-08-20T07:43:53.649012",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/10056-last-of-the-breed/",
    "https://pitchfork.com/reviews/albums/9599-hag-the-best-of-merle-haggard/",
    "https://pitchfork.com/reviews/albums/11752-strangersswinging-doors-and-the-bottle-let-me-down-im-a-lonesome-fugitivebranded-sing-me-back-homethe-legend-of-bonnie-and-clyde-mama-triedproud-of-what-i-am-hagsomeday-well-look-back/",
    "https://pitchfork.com/reviews/albums/3704-if-i-could-only-fly/",
    "https://pitchfork.com/reviews/albums/",
    "https://pitchfork.com/features/podcast/",
    "https://pitchfork.com/features/",
    "https://pitchfork.com/features/lists-and-guides/",
    "https://pitchfork.com/features/lists-and-guides/the-story-of-outlaw-country-in-33-songs/"
  ]
}