{
  "artist_name": "Bob Dylan",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/bob-dylan-desire/",
      "source": "pitchfork",
      "artist_name": "Bob Dylan",
      "title": "Bob Dylan: Desire",
      "content": "---\ntitle: Bob Dylan: Desire\nauthor: Elizabeth Nelson\nurl: https://pitchfork.com/reviews/albums/bob-dylan-desire/\nhostname: pitchfork.com\ndescription: Read Elizabeth Nelson’s review of the album.\nsitename: Pitchfork\ndate: 2024-01-14\ntags: ['sunday review']\n---\n[Scene 1: West Village, New York City, 1975. A legendary songwriter, mid-30s, is surveying the neighborhood where he cut his teeth a decade before. A violinist, younger and without his star status, but striking, with long dark hair and mysterious poise, enters stage right.]\nThe passerby was Scarlet Rivera, a previously unknown musician whose hypnotic violin became the signature sound of Bob Dylan’s newly minted touring group, the Rolling Thunder Revue, and his gestational new album, Desire. Naturally, Dylan—world historic genius, generational icon, and general weirdo—pulled over his car, resolved to ask her just exactly what her deal was. For an artist so concerned with myth, this chance encounter must have been irresistible. Was she phantom, muse, or curse? Was she really named Scarlet Rivera? “I meet witchy women. I wish they’d leave me alone,” he told Jonathan Cott, in a 1978 Rolling Stone interview, not stopping to consider the possibility that the feeling was mutual. Not long after the album came out, she vanished from his life and the public eye.\nAs with so much Dylan lore—from the fabled teenage eye contact with Buddy Holly to the arrest in Springsteen’s childhood neighborhood—it seems too unlikely to be true, and too preposterously random to invent. It’s of a piece with the world of Desire, where what’s real and what’s weird are largely indistinguishable.\nDylan’s previous record, the precision-controlled display of omniscient superego that was 1975’s Blood on the Tracks, had set an impossibly high standard for its follow-up. In response, Desire was a fantasia of grave injustices and grave robberies, exotic and dangerous locales, broiling days and fleeting gestures in the face of grim destiny. Its nine songs spread out over 56 minutes, co-mingling protest folk, travelogue tunes, throwback country, and sideways klezmer, all comprising one peculiar episode in the baffling sweep of his career. Blood on the Tracks was a document of personal and romantic trauma that traced an outline around a generation who prized individual freedoms to the point of self-annihilating alienation. Desire is about getting stoned and strange and trying to forget about all of that.\nDesire is not a subtle album, and it does not commence on a subtle note. “Hurricane”—an audacious eight-and-a-half minute recounting of the 1966 arrest and conviction of the middleweight boxer Rubin “Hurricane” Carter on charges of triple homicide—begins with the interweaving and insinuating strains of Dylan’s acoustic guitar and Rivera’s violin. One of seven songs on Desire co-authored with the playwright Jacques Levy, it employs stage directions to set its scenery: “Pistol shots ring out in the barroom night/Enter Patty Valentine from the upper hall.” Intentional or not, the effect of the dramaturgy is to suggest a not-strictly-speaking-literal recounting of events, introducing the queasy sensation that we are being carried along by storytellers whose commitment to the facts is secondary to their impulse to thrill and desperation to deliver a higher truth.",
      "author": "Elizabeth Nelson",
      "published_date": "2024-01-14",
      "word_count": 509,
      "fetch_timestamp": "2025-08-19T19:17:11.444121",
      "metadata": {
        "char_count": 3332,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:17:11.444108"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/bob-dylans-new-album-is-his-latest-of-many-comebacks/",
      "source": "pitchfork",
      "artist_name": "Bob Dylan",
      "title": "The Endurance of Bob Dylan’s Rough and Rowdy Ways",
      "content": "---\ntitle: The Endurance of Bob Dylan’s Rough and Rowdy Ways\nauthor: Pitchfork\nurl: https://pitchfork.com/features/podcast/bob-dylans-new-album-is-his-latest-of-many-comebacks/\nhostname: pitchfork.com\ndescription: A discussion of Bob Dylan’s history of comebacks, culminating in his new album, on the latest episode of our new podcast The Pitchfork Review\nsitename: Pitchfork\ndate: 2020-07-24\ncategories: ['features']\ntags: ['podcast']\n---\nOn June 19, Bob Dylan released his 39th album, Rough and Rowdy Ways—his first full-length album of original songs in eight years. Throughout his career, Dylan has followed moments of silence with something wholly new. In the mid-sixties, after a motorcycle accident brought Dylan’s creative and popular explosion to a halt, he retreated for a year and a half. Then, he released John Wesley Harding—a stark and simple album with standouts like “All Along the Watchtower” and “I Dreamed I Saw St. Augustine.” Thirty years later, in 1997, Dylan released Time Out of Mind, a dark, atmospheric return to form after two albums of folk covers. Similarly, Rough and Rowdy Ways sees Dylan breaking new ground again. Pitchfork Editor Puja Patel is joined by Staff Writer Sam Sodomsky and Contributing Editor Andy Cush as they break down Dylan’s history of comeback albums, and what makes this one so different.\nListen to this week’s episode above, and subscribe to The Pitchfork Review for free on Apple Podcasts, Spotify, Stitcher, or wherever you listen to podcasts. You can also check out an excerpt of the podcast’s transcript below. For more on Bob Dylan, check out Sam’s review of Rough and Rowdy Ways.\nPuja Patel: Digesting this album feels like a guide to essential readings and listenings. It’s so dense that it's overwhelming. Andy, I’ll pose this to you: Why do you think that it saw such incredible success?\nAndy Cush: I think a lot of it probably had to do with circumstances. [“Murder Most Foul”] came out in the middle of a pandemic where everyone was relegated to their homes. And the idea of spending 17 minutes digesting this insane masterpiece that Dylan just dropped on the world, without any kind of announcement...I know for me, it was extremely exciting. And I think probably even if you weren’t a super devoted fan, it’s like, you have the time on your hands to sit with this thing that you might not have had otherwise.\nThe stage was set for it to become, at least for a day, this sort of huge, conversation-driving cultural thing. I think people were just hungry for Dylan music. It’s been a long time since he put something out. And I think also the audacity of releasing that as the first single versus something like “False Prophet,” which was the second or third single. Which is another great song, but a comparatively much more straightforward rock and roll song.\nThe very fact of him releasing this kind of grand, almost impenetrable thing that seems like the opposite of a successful single probably contributed to the fact that it was so successful.\nSam Sodomsky: Yeah, I think that’s a great point. I think it’s also worth noting it doesn’t sound like any other Dylan song that he’s put out, which is a pretty remarkable feat this deep into his career.\nAC: One thing that we haven’t talked about in “Murder Most Foul” is that the entire second half of the song, he starts talking to this famous old DJ, Wolfman Jack. And the second half of the song is just, like, him saying, play this artist, play this song.\nHe creates this whole sort of constellation of music and other historical references that it does feel like, yeah, this is my entire cosmos that I'm giving to you. And it does feel like a great listening assignment list.\nPP: Also in that New York Times interview, he outright said: I’m not worried about my death. I’m worried about the end of human existence. So do you think he’s trying to educate us?\nSS: There’s just so much history on it, and so many illusions and references. To me, it’s the kind of album you can really get lost in and spend a lot of time analyzing. But also in a way that doesn’t feel totally like a distraction. And for how long and rambling the songs are, there are not a lot of wasted lines. I’m a huge fan of 21st century Dylan, but there is a style of writing of songs that are kind of like a type of song. Like, “can’t you hear that Duquesne whistle blowing,” songs that sound almost like they could have been written by anyone at any point in time. And I wouldn't be surprised if that's what he was going for. But you don’t really get a lot of that on this. Everything feels very intentional, very annotated. Which makes me as a listener lean in closer and take it, not more seriously, but apply myself to it in a different way.\nThe song “Key West,” which I think is my favorite on the record, made me want to research William McKinley. Because I kind of just forgot that he was also assassinated. And then I started drawing lines between McKinley and Caesar—because Caesar is also all over the album—and Caesar and JFK.\nTo me, there’s no artist who makes me want to do that more than Dylan. Maybe in a way that’s like a fool’s errand, but also in a way that’s just insanely fun.",
      "author": "Pitchfork",
      "published_date": "2020-07-24",
      "word_count": 904,
      "fetch_timestamp": "2025-08-19T19:17:11.464200",
      "metadata": {
        "char_count": 5186,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-19T19:17:11.464193"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/bob-dylan-rough-and-rowdy-ways/",
      "source": "pitchfork",
      "artist_name": "Bob Dylan",
      "title": "Bob Dylan: Rough and Rowdy Ways",
      "content": "---\ntitle: Bob Dylan: Rough and Rowdy Ways\nauthor: Sam Sodomsky\nurl: https://pitchfork.com/reviews/albums/bob-dylan-rough-and-rowdy-ways/\nhostname: pitchfork.com\ndescription: Six decades into his career, Bob Dylan delivers a gorgeous and meticulous record. It is the rare Dylan album that asks to be understood and comes down to meet its audience.\nsitename: Pitchfork\ndate: 2020-06-18\n---\nFor 60 years, Bob Dylan has been speaking to us. Sometimes breathless, often inscrutable, occasionally prophetic, his words have formed a mythology unto themselves. But his silence holds just as much meaning. Less than a minute into his 39th album, which he has decided to call Rough and Rowdy Ways, the accompaniment seems to fade. It’s a subtle drop; there wasn’t much there in the first place—a muted string ensemble, a soft pedal steel, some funereal motifs from classical and electric guitars. It’s the same twilight atmosphere that comprised Dylan’s last three studio albums, a faithful trilogy of American standards once popularized by Frank Sinatra. But now he’s singing his own words, and about himself. He compares himself to Anne Frank and Indiana Jones, says he says he’s a painter and a poet, confesses to feeling restless, tender, and unforgiving. “I contain a-multituuudes,” he croons, to anybody who hasn’t realized by now.\nThe rest of the album follows this thread: furnished with more space than his words require, sung gracefully at the age of 79, speaking to things we know to be true, using proper nouns and first-hand evidence. In other words, it is the rare Dylan album that asks to be understood, that comes down to meet its audience. In these songs, death is not a heavy fog hanging over all walks of life; it is a man being murdered as the country watches, an event with a time, place, and date. And love is not a Shakespearean riddle or a lusty joke; it is a delicate pact between two people, something you make up your mind and devote yourself to. “The lyrics are the real thing, tangible, they’re not metaphors,” Dylan told the New York Times. So when he sings about crossing the Rubicon, he’s talking about a river in Italy; when he tells you he’s going down to Key West, he wants you to know he’s dressing for the weather.\nStill, he is Bob Dylan, and we are trained to dig deeper. (In that same Times interview, he is asked whether the coronavirus could be seen as a biblical reckoning—a difficult question to imagine posing to any other living musician.) We have learned to come to Dylan with these types of quandaries, and more often than not, we have left satisfied. But for all his allusions to history and literature, the writing drifts toward uncertainty. In a macabre narrative called “My Own Version of You,” Dylan sings about playing god as he scavenges through morgues and cemeteries to reanimate a few notable corpses and absorb their knowledge. Among the questions he poses: “Can you tell me what it means: To be or not to be?” “Is there a light at the end of the tunnel?” We never get the answers; all we hear is the depravity: slapstick horror rendered as existential comedy.",
      "author": "Sam Sodomsky",
      "published_date": "2020-06-18",
      "word_count": 527,
      "fetch_timestamp": "2025-08-19T19:17:11.507303",
      "metadata": {
        "char_count": 3109,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:17:11.507296"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/bob-dylan-murder-most-foul/",
      "source": "pitchfork",
      "artist_name": "Bob Dylan",
      "title": "Bob Dylan: “Murder Most Foul”",
      "content": "---\ntitle: Bob Dylan: “Murder Most Foul”\nauthor: Madison Bloom\nurl: https://pitchfork.com/reviews/tracks/bob-dylan-murder-most-foul/\nhostname: pitchfork.com\ndescription: Dylan’s first original song in eight years is a ballad to the cultural touchstones of American pop music.\nsitename: Pitchfork\ndate: 2020-03-27\n---\nDeep within “Murder Most Foul,” Bob Dylan’s 17-minute ballad about the assassination of J.F.K., he points to the “12 Million souls that are listening in.” On November 22, 1963, all ears were held hostage by the same story. Today, we are a captive audience once again—although under very different circumstances—and listening to Dylan’s first original song in eight years feels all the more significant as a result. Dylan released “Murder Most Foul” late last night, and hearing it slowly unfold for the first time felt like a kind of communion—there were thousands of us, crouched around our radios (OK, laptops), listening to the same thing.\nIn the opening passages of “Murder Most Foul,” President Kennedy is fatally shot in his limousine as it ambles through the streets of Dallas. Dylan elevates that vehicle from a crime scene to a time machine that drives through the decades, soundtracked by icons of each era. “Turn the radio on; don’t touch the dials,” Dylan rasps atop a scaffold of piano and croaking bowed bass. He instructs “Wolfman Jack,” the famed ’60s DJ, to play everything from Etta James, to the Animals, to Queen. “The Beatles are comin’; they’re gonna hold your hand,” Dylan sings, heralding the Fab Four’s single, which arrived Stateside roughly one month after Kennedy’s death. In Dylan’s epic, the Lincoln Continental becomes Kennedy’s mobile resting place, cruising past cultural milestones that seemed to sprout from historical unrest. Dylan acknowledges the assassination as “the soul of a nation being torn away” before listing off some of the most significant American art of the past 60 years. It’s the kind of biting contradiction that Dylan does best—and we’re glad he’s back to deliver.",
      "author": "Madison Bloom",
      "published_date": "2020-03-27",
      "word_count": 319,
      "fetch_timestamp": "2025-08-19T19:17:11.542164",
      "metadata": {
        "char_count": 2036,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:17:11.542159"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/bob-dylan-travelin-thru-featuring-johnny-cash-the-bootleg-series-vol-15/",
      "source": "pitchfork",
      "artist_name": "Bob Dylan",
      "title": "Bob Dylan: Travelin’ Thru, Featuring Johnny Cash: The Bootleg Series Vol. 15",
      "content": "---\ntitle: Bob Dylan: Travelin’ Thru, Featuring Johnny Cash: The Bootleg Series Vol. 15\nauthor: Stephen Thomas Erlewine\nurl: https://pitchfork.com/reviews/albums/bob-dylan-travelin-thru-featuring-johnny-cash-the-bootleg-series-vol-15/\nhostname: pitchfork.com\ndescription: Dylan's latest installment in his long-running Bootleg series is one of the shortest, the highlight of which is his collaboration with Johnny Cash.\nsitename: Pitchfork\ndate: 2019-11-08\n---\nWeighing in at a mere three discs—last year’s More Blood, MoreTracks was twice that size—Travelin' Thru is a relatively trim installment in Bob Dylan’s ongoing Bootleg Series. Instead of opening a door onto a secret history, it adds color and texture to an already well-known story: Dylan's late-’60s sojourn in Nashville, the period in which he recorded John Wesley Harding and Nashville Skyline, capped off by his performance on The Johnny Cash Show in 1969—his first television appearance in nearly five years.\nDylan knew precisely what he wanted for the Harding sessions: just his guitar, bass, and drums. Producer Bob Johnston brought bassist Charlie McCoy and drummer Kenneth Buttrey into the studio, persuaded Bob to add steel guitarist Pete Drake to a couple of tracks, and the entire thing was finished within nine hours. The swift session means there were only a handful of outtakes left behind. Just seven alternate takes made the cut for Travelin’ Thru and apart from Dylan fussing with a few words, these aren’t far removed in form or feel from the versions that made the final album. The outtakes from Nashville Skyline—which includes the unheard song “Western Road,” a loose-limbed blues that happily plays with some well-worn tropes—also aren’t markedly different than what made the cut on the finished LP. The differences here are subtle—”Lay, Lady, Lay” seems a bit muted without its busy percussion and sighing steel—but it’s fun to hear Dylan groove along with these Nashville pros, working up a head of country-funk steam on “Country Pie” with the help of guitarist Charlie Daniels. Unfortunately, there aren't many of these Nashville Skyline outtakes. A bunch of masters were lost when CBS Records Nashville neglected to pay the fees for a storage facility, and while Sony recovered some tapes in a 2008 auction, many reels are still missing, which means the eight cuts on Travelin’ Thru are all that could be salvaged for official release.\nAll this means that the heart of Travelin’ Thru lies in the session Dylan held with Johnny Cash on February 18, 1969, just after he finished work on Nashville Skyline. The pair tested the waters the day before, stumbling through a version of Cash’s “I Still Miss Someone” and playing Dylan’s “Don’t Think Twice, It’s Alright” simultaneously with Johnny’s “Understand Your Man,” a song that lifted the melody from “Don’t Think Twice.” It’s a clever idea, albeit slightly confusing in practice—at one point, Dylan messes up his lyrics and slyly suggests he should be singing Cash’s words instead—but the mash-up illustrates how the two icons were operating on a similar wavelength. More than that, they were on equal footing in 1969. Each had spent the past decade changing the sound of American music by deviating from conventions, each building an image that verged on mythic. What's appealing about their duet session is how it deflates those myths: it’s merely two mutual admirers figuring out how to play music together.",
      "author": "Stephen Thomas Erlewine",
      "published_date": "2019-11-08",
      "word_count": 541,
      "fetch_timestamp": "2025-08-19T19:17:11.580365",
      "metadata": {
        "char_count": 3447,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:17:11.580358"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/bob-dylan-bob-dylan-rolling-thunder-revue-the-1975-live-recordings/",
      "source": "pitchfork",
      "artist_name": "Bob Dylan",
      "title": "Bob Dylan: Bob Dylan: Rolling Thunder Revue: The 1975 Live Recordings",
      "content": "---\ntitle: Bob Dylan: Bob Dylan: Rolling Thunder Revue: The 1975 Live Recordings\nauthor: Stephen Thomas Erlewine\nurl: https://pitchfork.com/reviews/albums/bob-dylan-bob-dylan-rolling-thunder-revue-the-1975-live-recordings/\nhostname: pitchfork.com\ndescription: A mammoth, 14-CD box set released to accompany Martin Scorcese’s documentary captures the 1975 tour in all its ragged glory.\nsitename: Pitchfork\ndate: 2019-06-13\n---\nBob Dylan’s Rolling Thunder Revue didn’t last long. From its conception to its dissolution, it spanned just under a year, not long for a career that’s about to enter its seventh decade. Maybe that’s why Dylan professes ignorance about the inspiration for his roving carnival in Rolling Thunder Revue: A Bob Dylan Story by Martin Scorsese, a lengthily titled documentary that recently premiered on Netflix. In one of the new interviews for the film, the singer-songwriter claims, “I’m trying to get to the core of what this Rolling Thunder thing is all about, and I don’t have a clue because it’s about nothing! It’s just something that happened 40 years [ago]—and that’s the truth of it.”\nOther people remember a lot about Rolling Thunder, though. Since the waning months of 1975—when Dylan roamed New England with a ragged band of musicians, playing small venues at the drop of a hat—the revue has been the thing of legend among Dylan conoscenti. Much of its mystique lies in the way the superior first incarnation of the tour only lasted about as long as a torrid summer squall. A second leg followed in 1976, but by all accounts Dylan was ornery and withdrawn—a contention supported by Hard Rain, a ’76 live set that was the only official document of Rolling Thunder until selections from the 1975 shows were compiled, in 2002, as the fifth volume of Dylan’s ongoing Bootleg Series.\nCertainly, The Bootleg Series, Vol. 5 is easier to digest than The Rolling Thunder Revue: The 1975 Live Recordings, a 14-CD box released to accompany the Scorsese film. Containing Dylan’s sets from the five professionally recorded Rolling Thunder concerts, along with three discs of rehearsals and a disc of oddities taken from the tour, the box assumes a high level of interest from the listener: A set that runs for ten and a half hours is not for dabblers. This ungainly sprawl suits the Rolling Thunder Revue, which was meant not as a mere evening of entertainment but rather an immersive theatrical experience.\nMuch of that heightened sense of drama diminishes on record, but it can still be felt, and the big box occasionally does an excellent job of suggesting the circus taking place both on and off stage. All those rehearsals help build the atmosphere. Here, Dylan and his band of old folkies, new rockers, and unknowns get acquainted, playing folk chestnuts and songs he’d just cut for Desire, which wouldn’t be released until after the first leg of the tour wrapped up. Harmonies are ragged and tempos tentative, but the bonhomie is palpable. What’s also evident is the nature of Dylan’s singing: open-hearted, bold, and clear, qualities decidedly lacking on Before the Flood, a double-album souvenir of his 1974 return to the stage.",
      "author": "Stephen Thomas Erlewine",
      "published_date": "2019-06-13",
      "word_count": 509,
      "fetch_timestamp": "2025-08-19T19:17:11.621842",
      "metadata": {
        "char_count": 3157,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:17:11.621837"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/bob-dylan-more-blood-more-tracks-the-bootleg-series-vol-14/",
      "source": "pitchfork",
      "artist_name": "Bob Dylan",
      "title": "Bob Dylan: More Blood, More Tracks: The Bootleg Series Vol. 14",
      "content": "---\ntitle: Bob Dylan: More Blood, More Tracks: The Bootleg Series Vol. 14\nauthor: Sam Sodomsky\nurl: https://pitchfork.com/reviews/albums/bob-dylan-more-blood-more-tracks-the-bootleg-series-vol-14/\nhostname: pitchfork.com\ndescription: Jokes about the title aside, this payload of alternate takes presents a complex portrait of a complicated time for the singer-songwriter as he made a masterpiece.\nsitename: Pitchfork\ndate: 2018-11-07\n---\nThe lore has always been that there are two versions of Blood on the Tracks. There’s the one that got released in January 1975—the comeback album that reinvigorated Bob Dylan’s career after a stint in the shadows, the classic that begins with the low hurdy-gurdy of “Tangled Up in Blue” and saunters onward like a sad walk through autumn woods. And then there’s the version that Dylan scrapped—the widely bootlegged, mostly acoustic collection he recorded in four days in New York City but second-guessed weeks before its scheduled release. He rewrote and re-recorded half the songs with a full band at home in Minnesota, in two days just after Christmas 1974. A combination became the definitive Blood on the Tracks.\nAnytime during the last 40 years, Sony could have simply released the record’s early version, long known to fans as the “New York Sessions,” and sold it as a simple, digestible lost classic. But that is not how Dylan’s Bootleg Series, now in its 14th volume, operates: Instead, we’ve got the charmingly titled More Blood, More Tracks which, across six discs and 87 recordings, documents every note of those New York sessions and the complete full-band renditions from Minnesota. For more casual fans, there’s a one-CD or double-LP set that features the best alternate take of each song, stripped of overdubs or production effects. And so, a third version of Blood on the Tracks emerges—one that illustrates the vulnerability of the scrapped release, the one-take intimacy of Dylan’s earliest work, and the grandness of the album proper.\nDespite its nearly instant reception as a classic, Blood on the Tracks is not a world that Dylan inhabited for long. By the end of 1975, he was already a different person (in full costume) leading the crowd-pleasing Rolling Thunder Revue and working up the epic gypsy-folk ballads of 1976’s Desire. We can now wallow in the moment a little longer. This is not the first time the Dylan camp has offered a box set as an audio documentary. In 2015, The Cutting Edge covered every studio take from 14 months of sessions in the mid-1960s that led to three consecutive breakthroughs: Bringing It All Back Home, Highway 61 Revisited, and Blonde on Blonde. Put on any disc from that set, and you’ll hear Dylan at a moment of inspiration, fueled by relentless creativity (and endless amphetamines) as he searched for his—and, by extension, rock music’s—future.",
      "author": "Sam Sodomsky",
      "published_date": "2018-11-07",
      "word_count": 455,
      "fetch_timestamp": "2025-08-19T19:17:11.664046",
      "metadata": {
        "char_count": 2844,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:17:11.664040"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/bob-dylan-time-out-of-mind/",
      "source": "pitchfork",
      "artist_name": "Bob Dylan",
      "title": "Bob Dylan: Time Out of Mind",
      "content": "---\ntitle: Bob Dylan: Time Out of Mind\nauthor: Grayson Haver Currin\nurl: https://pitchfork.com/reviews/albums/bob-dylan-time-out-of-mind/\nhostname: pitchfork.com\ndescription: Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today we explore Bob Dylan’s masterful comeback, 1997’s Time Out of Mind.\nsitename: Pitchfork\ndate: 2018-05-13\ntags: ['sunday review']\n---\nNot long after attending the California funeral of his friend Jerry Garcia, Bob Dylan found himself snowbound at his Minnesota farm. He would listen to the storms and write after the sun sank from the winter sky. Those songs turned the cold environment into a crystalline lens on the tiring world—a place that was “not dark yet, but getting there,” where “the blues [were] wrapped around my head.”\nWhat Dylan had left to say or whether he had any enthusiasm left for saying it had, for a while, been unclear. Seven years had passed since he had released an original new tune, and that album, Under the Red Sky, was a near-catastrophe, scuttling what had seemed a comeback after Dylan crept through his polarizing ’80s evangelism. He had grown disillusioned with the cycle of writing and recording, he later said, and simply wanted to play.\nDuring the ’90s, he issued two solo acoustic albums of earnest, sometimes poignant renditions of American standards, delighting those who had pined for the lost days of the folk kid from Greenwich Village. But coffeehouse covers hadn’t made Dylan a spark of resistance in the ’60s or a source of bittersweet reckonings with reality in the ’70s. He had become a legacy act, accruing lifetime achievement laurels and touring his hits for Boomers in khakis. Possibly for the first time in his career, Dylan was beginning to blend into the scenery.\nBut months after Garcia’s funeral, Dylan approached the audacious producer Daniel Lanois. Since helming the contentious sessions for what many had prematurely considered Dylan’s actual comeback, 1989’s half-stepping Oh Mercy, Lanois had cut U2’s Achtung Baby and Emmylou Harris’ Wrecking Ball, a wondrously atmospheric abstraction of the singer’s gorgeous and aging country vision. In a New York hotel room, Dylan read Lanois the lyrics and asked him if he had a record. “I said, ‘Yes, Bob, I think we’ve got a record,’” Lanois remembered with a sly laugh during a recent phone call.\nDylan sent Lanois home with a list of reference records to study—Charley Patton, Little Walter, Little Willie John, a mix of ragged blues and primordial rock. “I listened to these records, and I understood,” Lanois wrote in his memoir, Soul Mining. “A new birth with the old dogs under your arm, like a stack of classic books.” In the end, that rebirth was Time Out of Mind, Dylan’s 30th album and one that doesn’t sound much like the basic blues at all. Instead, it is an essential post-modern reappraisal of them, an experimental consideration of what could become of the blues’ sound and spirit and a mutual communion of articulate, exquisite despair. At the last minute, Lanois took Dylan’s blurry snapshot for the cover of Time Out of Mind; on tape, that’s exactly how he had captured him.",
      "author": "Grayson Haver Currin",
      "published_date": "2018-05-13",
      "word_count": 527,
      "fetch_timestamp": "2025-08-19T19:17:11.713810",
      "metadata": {
        "char_count": 3209,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:17:11.713801"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/23041-triplicate/",
      "source": "pitchfork",
      "artist_name": "Bob Dylan",
      "title": "Bob Dylan: Triplicate",
      "content": "---\ntitle: Bob Dylan: Triplicate\nauthor: Mike Powell\nurl: https://pitchfork.com/reviews/albums/23041-triplicate/\nhostname: pitchfork.com\ndescription: *Triplicate, *again, features Dylan singing tunes from the Great American Songbook. His voice is filled with character, though the cumulative impact of the 30-song set is somewhat dimmed.\nsitename: Pitchfork\ndate: 2017-04-06\n---\nBob Dylan’s Triplicate is the third album of American standards that Bob Dylan has released in the past two years. It is also three albums long, with 10 songs on each album, for a total runtime of 95 minutes. Dylan, a songwriter whose most enigmatic refrain is that he is less complicated than everyone makes him out to be, has explained that 10 is the number of completion, a lucky number, “symbolic of light.”\nIn any case, the project brings the total number of hours of Bob Dylan singing American standards to just under three. Like Fallen Angels and Shadows in the Night, Triplicate leans most heavily on material associated with Frank Sinatra, a singer with whom Dylan has nothing obvious in common other than that fame turned both men into myths. Some of the songs here—“Stormy Weather,” “As Time Goes By,” “Stardust”—are well known, at least to the vanishing population of those who care. Most were written in the misty and unremembered days when the singer still went by Robert Zimmerman, a period on which Dylan has staked his entire career.\nThe arrangements are polished and controlled: guitar, bass, brushed snare drum, the occasional weep of steel guitar. Dylan’s voice is not, and has not been for nearly 50 years, but coming to a Bob Dylan album for vocals is like going to the state fair for the food: Let’s hope you like it fried. In the absence of a crooner’s virtuosity and polish, there’s character, that great unteachable quality that makes even the marginal doodles of a genius flicker with life. Dylan’s voice—gutted but charming, a ghost banging around in the closet looking for a lightswitch—sounds best on the album’s mid- and uptempo songs, where it carries wisdom and resilience and light, imbuing received wisdom with the bittersweetness of lived experience.\nThe ballads, beautiful as they are, sometimes feel static, bereft of that innerverse opened by singers like Johnny Hartman or, say, Willie Nelson, whose own standards album Stardust remains a high point for projects like this. There seems to be a tempo threshold below which the songs on *Triplicate *become quicksand for Dylan, turning him from an old scamp into a confused puddle of remorse. Call it the difference between just enough and one too many. (At least he’s not maudlin, the cliff over which all ballads peer.) The exceptions—“There’s a Flaw in My Flue,” “But Beautiful”—tend to be songs whose lyrics offer their singers an opportunity to be funny, a quality Dylan continues to not get enough credit for.",
      "author": "Mike Powell",
      "published_date": "2017-04-06",
      "word_count": 469,
      "fetch_timestamp": "2025-08-19T19:17:11.752101",
      "metadata": {
        "char_count": 2882,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:17:11.752094"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/ada-lea-when-i-paint-my-masterpiece/",
      "source": "pitchfork",
      "artist_name": "Bob Dylan",
      "title": "Ada Lea: when i paint my masterpiece",
      "content": "---\ntitle: Ada Lea: when i paint my masterpiece\nauthor: Marissa Lorusso\nurl: https://pitchfork.com/reviews/albums/ada-lea-when-i-paint-my-masterpiece/\nhostname: pitchfork.com\ndescription: Read Marissa Lorusso’s review of the album.\nsitename: Pitchfork\ndate: 2025-08-08\n---\nSongwriting, painting, poetry—while pursuing so many creative endeavors at once, Alexandra Levy has come to value the act of artmaking above all. “I think failure comes from being too fixated on the finished product,” the Montreal-based artist once said in an interview, “and so creative success must be [in] the focus on the process.” This attitude glows warmly at the heart of when i paint my masterpiece, her third album as Ada Lea: a collection of breezy, folk-indebted songs that marvel at everyday realities and find joy in humility.\nLevy made when i paint my masterpiece in a period of respite after writing, recording, and touring her records left her exhausted. She took a break from music and went back to school to study painting and poetry, and started teaching, too. The new album feels lighter on its feet; many songs seem to float by, light sketches undergirded by minimal instrumentation. On “midnight magic,” Levy sings in close-tracked harmonies as plodding piano chords amble beneath her; at just under two minutes, “it isn’t enough” forgoes a formal verse-chorus structure, instead offering a slow-burning melody over a simple brush of guitar and percussion.\nThe mood is altogether more even-keeled than the dazed, jittery energy of her previous full-lengths. Where 2021’s one hand on the steering wheel the other sewing a garden traded in stories about the uncertainty of young love and the disorientation of heartbreak, when i paint my masterpiece ponders existential questions of community, observation, and purpose. “You give and you take/You try and you fail/You live and you love,” she sings on “it isn’t enough.” “It is what it is,” she acknowledges on “just like in the museum,” before declaring, “We laugh when it’s good/And cry when it’s not.” But when backed by such light-touch production, these mantras can feel like a first draft whose final hues haven’t been colored in.\nAt its best, though, this unforced approach manifests in Levy’s gift for stream-of-consciousness narratives that spin out as if propelled by their own internal velocity. “baby blue frigidaire mini fridge” begins by naming the title object and cataloging a few other curiosities before zooming ever-outwards—the cold air, a window, a mountain view, a lost love—its perspective eventually becoming as wide and ancient as “our old time souls/This old-time moon.” “snowglobe” paints a convivial party scene, describing what everyone’s wearing, bringing, hearing before Levy yelps, “Look at us/Sitting ’round the kitchen table/Thinking that/We are made of something special,” her tone both wry and loving.",
      "author": "Marissa Lorusso",
      "published_date": "2025-08-08",
      "word_count": 444,
      "fetch_timestamp": "2025-08-19T19:17:11.786848",
      "metadata": {
        "char_count": 2879,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:17:11.786844"
      }
    }
  ],
  "total_articles": 10,
  "total_words": 5204,
  "extracted_at": "2025-08-19T19:17:11.787221",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/bob-dylan-desire/",
    "https://pitchfork.com/features/podcast/bob-dylans-new-album-is-his-latest-of-many-comebacks/",
    "https://pitchfork.com/reviews/albums/bob-dylan-rough-and-rowdy-ways/",
    "https://pitchfork.com/reviews/tracks/bob-dylan-murder-most-foul/",
    "https://pitchfork.com/reviews/albums/bob-dylan-travelin-thru-featuring-johnny-cash-the-bootleg-series-vol-15/",
    "https://pitchfork.com/reviews/albums/bob-dylan-bob-dylan-rolling-thunder-revue-the-1975-live-recordings/",
    "https://pitchfork.com/reviews/albums/bob-dylan-more-blood-more-tracks-the-bootleg-series-vol-14/",
    "https://pitchfork.com/reviews/albums/bob-dylan-time-out-of-mind/",
    "https://pitchfork.com/reviews/albums/23041-triplicate/",
    "https://pitchfork.com/reviews/albums/ada-lea-when-i-paint-my-masterpiece/"
  ]
}