{
  "artist_name": "Paul McCartney",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/features/interview/8854-paul-mccartney/",
      "source": "pitchfork",
      "artist_name": "Paul McCartney",
      "title": "Paul McCartney",
      "content": "---\ntitle: Paul McCartney\nauthor: Ryan Dombal\nurl: https://pitchfork.com/features/interview/8854-paul-mccartney/\nhostname: pitchfork.com\ndescription: With 1971's Ram, Paul and Linda McCartney made an LP inspired by family, freedom, and country living. Four decades on, its unguarded simplicity still resonates. Here, the rock icon talks about the recently-reissued record with Ryan Dombal.\nsitename: Pitchfork\ndate: 2012-06-07\ncategories: ['features']\ntags: ['paul mccartney']\n---\nIn a press release for his 1970 solo debut, Paul McCartney, then 27, outlined his future thusly: \"My only plan is to grow up!\" By year's end, he had filed a lawsuit against the other three Beatles to dissolve their business partnership, a particularly striking blow in that band's infamously messy divorce. But as his old life as one fourth of the biggest rock band on earth was crumbling, his new one as a husband and father was taking root. Paul McCartney was growing up.\nPart of that process involved a retreat to his farm in Scotland's Mull of Kintyre along with his wife Linda and their two children. Released in May 1971, his homey, off-the-cuff second post-Beatles album Ram-- credited to Paul and Linda McCartney-- marked the family's time in the countryside. \"Ram is a domestic-bliss album, one of the weirdest, earthiest, and most honest ever made,\" wrote Jayson Greene in his review of the album's recent deluxe reissue. \"What 2012's ears can find on Ram is a rock icon inventing an approach to pop music that would eventually become someone else's indie pop.\"\nHeading home last Friday afternoon following rehearsal for this week's Diamond Jubilee Concert, Sir Paul rang us up to talk about Ram, shearing sheep, and growing a beard.\nPhoto by Linda McCartney\nPitchfork: You weren't yet 30 when you wrote and recorded Ram, did you still feel like a young man at that point?\nPaul McCartney: Yeah. I felt like a young man starting a new life. The Beatles had just broken up with some acrimony, and the meetings that were happening in London at the time were really heavy. It was doing my head in. So I was newly married to this lovely girl who had a great free spirit, and there I was having to go to these dreadful meetings with quite a lot of business pressure. I couldn't figure what to do.\nOne day, we said, \"Let's just not go. That'll solve it.\" So we boycotted the meetings and went to Scotland, where I had a farm, and hung out there; rather than sitting around in ugliness, we split and let them try to find us. We thought, \"Great, at least we don't have to be proactive.\" It felt like a hippie gap-year. It gave us an opportunity to hang with our young family that we were bringing up at the time.\nPitchfork: Why did you particularly find country life attractive at that point?\nPM: It was an escape route. We went up there and did the things that neither of us had the chance to do before. Linda had been brought up by a wealthy New York family, but she was interested in nature and animals, so a free life appealed to her. I had been a Beatle for years and years-- it was the type of thing where the office would buy you your Christmas tree. So the simple pleasures of getting your own Christmas tree and bringing it back home were things we never really had a chance to do. This was our chance, and we found it very joyful. I would create handmade bits of furniture because we didn't have a bed for Mary, our new baby. They weren't great pieces of furniture, in fact, but I liked having to be a little bit resourceful, and Linda was a great help. It was very liberating because neither of us had an opportunity to live completely freely and do exactly what we wanted. It was time for us to cut loose.\nAs our kids grew up, some of their friends would hear stories from this time and say, \"Geez, you're like peace convoy children.\" It was a bit about this idea of a commune, which was a little in vogue at the time, and we finally got around to doing our own version of it.\nPhoto by Linda McCartney\nPitchfork: As far as the farm tasks that you were doing-- like shearing sheep-- did you have someone teaching you how to do those things, or did you just learn them on your own?\nPM: There was a guy. Don't get the wrong idea: When we were shearing sheep, he did 100 a day, and I would do, like, five. I was definitely the apprentice. But it was great learning things like that. I had always been a nature lover as a kid, but I'd never really had any time to return to that because I had gone off into the Beatles at age 17 or so, and then into the chaos, the phenomenon, the pandemonium, the whole thing. Finally, it was time to have a little rest and go back to some of the things I had enjoyed while also learning some new skills; I wasn't trying to become a shepherd, but it was interesting.\nPitchfork: What are some of your early memories of loving nature?\nPM: I lived on the edge of Liverpool in a new housing estate, 'cause my mother was a midwife. I could walk for about half an hour and suddenly I would be in deep countryside. I used to take a lot of walks on my own and I had a little pocket book called The Observer's Book of Birds. I still have a copy, actually. I would walk around and, if I saw a bird, I'd look it up: \"Oh wow, it's a skylark!\" I loved that. I realized marvelling at nature was a deep pleasure of mine.\nThe funny thing is, when I first bought the house in Scotland, that pleasure didn't occur to me. But when I met Linda, she said, \"I heard you got a place in Scotland, can we go there?\" And I said, \"Yeah, sure.\" So we just went up and she said, \"Ah, I love it.\" That's when I reconnected with it.\nPitchfork: When you went to the nearby town in Scotland, were people unfazed by the fact that Paul McCartney was in their grocery store?\nPM: Yeah, a little bit. People get used to it when you live locally, because you go to into the pub with them, or you go to dinner with your local solicitor, or you hang with a couple of guys working on the farm. You gradually get to know other people, and they become very protective of you. The only people who would bother us would be the tourists, but it was never a real problem.\nAlso, you gotta remember, I had a big black beard, and not everyone recognized me as a Beatle. When we went to New York, I'd go to Harlem or wherever and I had this beard and an old thrift-shop jacket on, like a Vietnam vet-- I used to joke with people, like, \"I look the guy who might mug you.\" People didn't want to look me in the eye. It was quite a good cover at the time.\nOne of the things about beards is that, when men reach a certain age, they'd like to see if they can grow one. It's a phenomenon I understand very well. So I thought, \"I'm gonna be in Scotland, there's nobody to see me if I fail.\" After you get over the itchy face, you go, \"Oh, I don't have to shave, that's cool.\" And then you move into the philosophical thing-- people say, \"Oh, you look weird, you have a beard.\" And you say, \"No, actually, it's weird to shave.\" Having a beard is natural. When you think about it, shaving it off is quite weird. [laughs]\nPitchfork: You're most famous for making elaborately produced records, though Ram has a real homespun feel to it. Was that part of the retreat for you?\nPM: Yeah. I'd been serious long enough with the Beatles, and I wanted to see if I could do something that played more into my love of the surreal. As far as art's concerned, I probably like modern art more than traditional art. We would read things like Lewis Carroll's Alice's Adventures in Wonderland or Through the Looking-Glass, and you'd get things like \"The Walrus and the Carpenter\" or \"Jabberwocky\", and they're pretty far-out. Carroll was by no means a modern writer, so there was this precedent for all this funky stuff, and I finally felt like I had a chance to do something like that. I think John [Lennon] felt a similar thing. We could break out of the mold and try something else. For me, it manifested itself in things like \"Monkberry Moon Delight\" or \"3 Legs\". They were slightly wacky; it was nice having an opportunity to do that rather than having to write for someone else's preconceived notion.\nPitchfork: You grew up with 50s rock, which seems to be more in line with the songs on Ram than a lot of the more revered Beatles material.\nPM: You know, you're right. Our roots are in rock'n'roll, which is all about the spirit of the music and the whole simplicity and feel. All of us had that as our basic love, but we couldn't just do that because it had been done, so we had to develop it and meld it with some other influences, which developed into the Beatles stuff we're known for.\nBut when we got the chance to put our feet up and relax, we defaulted back to some of our early stuff. But this time around, instead of doing cover versions, we wrote new versions that had that off-the-cuff feel which you get in today's indie music. It had a new slant; you wouldn't have found early rock'n'roll ever really being surreal-- \"Monster Mash\" or Screamin' Jay Hawkins' \"I Put a Spell on You\" might be as crazy as it would get. But a lyric like \"a piano up my nose\" [from Ram's \"Monkberry Moon Delight\"] is completely surreal; it might've been of a Magritte painting or something. So we were going back to the roots, but with a spin on it, which involved our love of things that were completely out of left field. It was a nice time to experiment.\nPitchfork: There is a free-spirited vibe to the record, but there are also what sound like more pent-up feelings. A song like \"Smile Away\" sounds like something that could be on \"Sesame Street\", but the lyrics actually seem to have more of a \"grin and bear it\" message.\nPM: That's probably a good take on it. In that post-Beatles breakup, it got heavy-- the word \"heavy\" emerged into the vocabulary of the time, like, \"It's really heavy, man.\" You never heard people say that before. In fact, it's funny, Linda had some note paper made up for herself, just for a laugh, which read: \"Grin, Grin, and Bear It Solicitors,\" like it was an official thing. She'd write to friends on it. It was one of our little indulgences, we would get note paper made up with wacky titles on it.\nPitchfork: Are you at all surprised that this album in particular still resonates?\nPM: Well, years after I made it, one of my New York nephews, who was in his early 20s, said, \"Ram's my favorite album. I just love it, man. We play it in college and all that.\" It totally took me by surprise. And that awoke my interest in the album. Then I started to hear the same thing from a number of people through the years. I think it's because they connect with the liberty to engage, that early-20s kind of thing. It feels like you suddenly have a little bit of chance; you're out of school, not yet in the big serious job. It's a good period to cast around. Some people take a trip to India, Tibet, hitchhike through Europe. This was my trip to Tibet, only it was Scotland. The album is certainly in tune with the freedom that a lot of people want these days in our strange world where bankers can rip the economy apart. It's nice to have a little bit of art to fall back on.",
      "author": "Ryan Dombal",
      "published_date": "2012-06-07",
      "word_count": 2072,
      "fetch_timestamp": "2025-08-19T19:21:11.378875",
      "metadata": {
        "char_count": 11144,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-19T19:21:11.378867"
      }
    },
    {
      "url": "https://pitchfork.com/features/interview/7555-sir-paul-mccartney-and-youth-aka-the-fireman/",
      "source": "pitchfork",
      "artist_name": "Paul McCartney",
      "title": "Sir Paul McCartney and Youth (aka The Fireman)",
      "content": "---\ntitle: Sir Paul McCartney and Youth (aka The Fireman)\nauthor: Mark Richardson\nurl: https://pitchfork.com/features/interview/7555-sir-paul-mccartney-and-youth-aka-the-fireman/\nhostname: pitchfork.com\ndescription: Several weeks ago, Pitchfork relayed questions to London to be posed to McCartney and Youth in a video interview. They talked about the new album, why they're promoting the Fireman now, and what it's like to release music in the current music marketplace.\nsitename: Pitchfork\ndate: 2008-11-17\ncategories: ['features']\n---\nIn 1993, an album called Strawberries Oceans Ships Forest appeared, credited to something or someone known as the Fireman. People eventually figured out that it was the work of Paul McCartney in collaboration with Youth, the busy producer known for his membership in Killing Joke and collaborations with the Orb. Even so, the Fireman still remained something of a mystery, as neither McCartney nor Youth talked about it or even publicly acknowledged their involvement. Instrumental and electronically focused, Strawberries Oceans Ships Forest served as further evidence of McCartney's eclectic interests, as did the next album by the Fireman, 1998's Rushes. Earlier this year, a very different sort of track from the Fireman popped up, the snarling guitar-driven rocker \"Nothing Too Much, Just Out of Sight\". With its prominent vocals and clear song structure, it suggested that McCartney and Youth were headed in a new direction. In keeping with this fresh approach, the duo also decided that it was time to step out from behind the curtain and begin talking about the Fireman and their new record, Electric Arguments.\nSeveral weeks ago, Pitchfork relayed questions to London to be posed to McCartney and Youth in a video interview. They talked about the new album, why they're promoting the Fireman now, and what it's like to release music in the current music marketplace.\nEmbed not available\nPitchfork.tv page with embed code is here.",
      "author": "Mark Richardson",
      "published_date": "2008-11-17",
      "word_count": 299,
      "fetch_timestamp": "2025-08-19T19:21:11.398941",
      "metadata": {
        "char_count": 1976,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-19T19:21:11.398935"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/paul-mccartney-wings-one-hand-clapping/",
      "source": "pitchfork",
      "artist_name": "Paul McCartney",
      "title": "Paul McCartney / Wings: One Hand Clapping",
      "content": "---\ntitle: Paul McCartney / Wings: One Hand Clapping\nauthor: Stuart Berman\nurl: https://pitchfork.com/reviews/albums/paul-mccartney-wings-one-hand-clapping/\nhostname: pitchfork.com\ndescription: Read Stuart Berman’s review of the album.\nsitename: Pitchfork\ndate: 2024-06-15\n---\nIt took 52 years and an eight-hour docuseries to confirm that the recording sessions for the Beatles’ Let It Be weren’t exactly the miserable, band-killing ordeals that the namesake 1970 documentary had made them out to be. But long before Peter Jackson put a feel-good spin on the Beatles’ dying days in Get Back, Paul McCartney had already made it clear he was totally cool with having a documentary crew hovering over his shoulder during his most vulnerable moments of creation—because a mere five years after the Let It Be experience, he eagerly subjected his post-Beatles band Wings to the same cinematic scrutiny.\nRiding high on the runaway success of 1973’s Band on the Run, McCartney and Wings set up shop in Abbey Road Studios for four days in August 1974 and let filmmaker David Litchfield document their every move as they whipped through a sprawling setlist of recent hits, upcoming singles, B-sides, neglected album cuts, off-the-cuff medleys, instrumental jams, songs that wouldn’t be officially released until the following decade, ’50s rockabilly covers, and even a few Fab Four favorites. The result was a documentary called One Hand Clapping, whose overriding concept wasn’t so much “get back” as “get born”—an opportunity to show skeptics that Wings weren’t merely McCartney’s appendages, but a blossoming group fueled by the same sort of collaborative camaraderie and derring-do that his previous band possessed a decade prior. Alas, like the 1969 project, things didn’t go exactly as planned, and it’s taken five decades for a definitive document of the moment to see the light.\nFrom day one, Wings were burdened by a seemingly insurmountable contradiction. “For me, I like working with a gang of people, I like a little team,” McCartney told Litchfield. “I’ve never been a solo performer, so it’s natural for me to find myself a group.” Despite his stated desire to be part of a community, the fact is, no one but John Lennon could hope to be on equal creative footing with Paul McCartney in a band. In former Moody Blues member Denny Laine, McCartney found not so much a new partner as a trusted accomplice who could both fill the harmonic holes left by Lennon’s absence and flex the extra guitar muscle required in the hard-rockin’ ’70s. But even with the core of McCartney, keyboardist wife Linda, and Laine in place, Wings were always a band in flux, with different personnel appearing on each record; the triumphs of Band on the Run ultimately owed more to the trio’s crafty approach to their low-tech setup in EMI’s Lagos studio than to a proper band coming into its own.",
      "author": "Stuart Berman",
      "published_date": "2024-06-15",
      "word_count": 466,
      "fetch_timestamp": "2025-08-19T19:21:11.443729",
      "metadata": {
        "char_count": 2876,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:21:11.443718"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/paul-mccartney-mccartney-iii-imagined/",
      "source": "pitchfork",
      "artist_name": "Paul McCartney",
      "title": "Paul McCartney: McCartney III Imagined",
      "content": "---\ntitle: Paul McCartney: McCartney III Imagined\nauthor: Stuart Berman\nurl: https://pitchfork.com/reviews/albums/paul-mccartney-mccartney-iii-imagined/\nhostname: pitchfork.com\ndescription: Read Stuart Berman’s review of the album.\nsitename: Pitchfork\ndate: 2021-04-17\n---\nLast December, Paul McCartney gave fans an early Christmas present in the form of McCartney III, an event that—short of a holographic Beatles reunion tour or an official release of Carnival of Light—fulfilled the ultimate fantasy of many long-time Maccaphiles. But the excitement was as much about him embracing old ways as making new music: The album revisited the mad-scientist methodology of die-hard fan favorites McCartney (1970) and McCartney II (1980), DIY efforts that deconstructed his perfectionist streak through off-kilter folk-funk and bizarro synth-pop. The enduring cult appeal of the latter record, in particular, has done much to transform McCartney’s image from a sentimental, set-in-his-ways rock dinosaur into an eccentric godfather figure for a new generation of home-recording misfits and pop omnivores.\nBut while McCartney III featured no lack of inspired, off-the-cuff moments, unlike its predecessors, it didn’t really showcase any new musical obsessions or curiosities that allowed us to see its creator in a new light. So in this case, a remix album isn’t simply a matter of extending the record’s shelf life—it’s more about tending to unfinished business. On McCartney III Imagined, Sir Paul presents a resequenced, alternate-universe version of the record as overseen by an eclectic cast of alt-rock icons, current indie darlings, and modern pop phenoms that would make for a pretty solid Coachella bill. This isn’t random stunt casting for clout—with few exceptions, the artists entrusted with remixing or covering these tracks are noted auteurs themselves, turning McCartney III Imagined into a talent summit.\nIn other words, even if you don’t look at the album credits, you’ll probably know exactly who’s behind the boards. Beck turns “Find My Way” into a song that originally sounded like a Mellow Gold demo into a bongo-slapping Midnite Vultures workout; St. Vincent amps up the film-noir melodrama of “Women and Wives” by multi-tracking herself into a girl-group chorus line; and Khruangbin’s “Pretty Boys” pulverizes its dainty source material into dubby vapor trails. The most successful remixers here work in service to the song rather than themselves. Blood Orange’s Dev Hynes rehabilitates the once-tedious synth-soul strut of “Deep Down” with his own velvety harmonies and an urgent piano arrangement recalling the Wings classic “Nineteen Hundred and Eighty Five.” Best of all is Anderson .Paak, who elevates “When Winter Comes” from a farmhouse ditty into a breezy, space-age bachelor-pad reverie that would fit comfortably into his new Silk Sonic project.",
      "author": "Stuart Berman",
      "published_date": "2021-04-17",
      "word_count": 426,
      "fetch_timestamp": "2025-08-19T19:21:11.482743",
      "metadata": {
        "char_count": 2871,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:21:11.482737"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/paul-mccartney-mccartney-iii/",
      "source": "pitchfork",
      "artist_name": "Paul McCartney",
      "title": "Paul McCartney: McCartney III",
      "content": "---\ntitle: Paul McCartney: McCartney III\nauthor: Stuart Berman\nurl: https://pitchfork.com/reviews/albums/paul-mccartney-mccartney-iii/\nhostname: pitchfork.com\ndescription: Read Stuart Berman’s review of the album.\nsitename: Pitchfork\ndate: 2020-12-23\n---\nThere are many Paul McCartney albums, but only a precious few get to call themselves McCartney albums. McCartney III is the surprise third entry in a series that began with his 1970 solo debut McCartney and seemed to end with 1980’s McCartney II, two dramatically different records born of dramatically different circumstances that were nonetheless united by a DIY methodology. Unlike the other records in Macca’s solo discography, these were true one-man-band efforts, clearinghouses for the rough song sketches and home-recording experiments he’d never bring to his proper releases. And both were flawed-yet-fascinating portraits of a perfectionist embracing the purity of imperfection. So the appearance of that roman numeral in the title of McCartney III is loaded with significance, a promising indication that what we’re getting here is the man, not the myth. This is especially exciting news for that generation of fans who hold “Temporary Secretary” in a greater esteem than Sgt. Pepper’s.\nThe novelty of McCartney and McCartney II had a lot to do with the context in which they appeared: the former was a purposefully ramshackle response to the studio-sculpted grandeur of the Beatles, the latter a synth-shocked antidote to the arena-rock bombast of Wings. But while they were solitary efforts, those records were still plugged into the sounds and conversations of their times. McCartney was rooted in the agrarian, anti-psych aesthetic of contemporary groups like the Band, while McCartney II showed Macca having a go at the new wave and early electronic music seeping into the mainstream. On these albums, McCartney wasn’t so much the all-knowing auteur as a sponge soaking up the prevailing styles of the day and squeezing them out, without a care if he made a mess.\nMcCartney III, however, has no such guiding principle—other than the fact it arrives in a year when McCartney, like many of us, was stuck at home with a whole lot of extra time on his overly sanitized hands. Following a decade where he actively pursued modern-pop relevance through collaborations with Mark Ronson, Ryan Tedder, and Kanye West and Rihanna, McCartney III finds its maker shacked up at his Sussex farmhouse, tuning out the radio to indulge his every scatterbrained whim. With no desire to engage with the contemporary musical landscape or absorb new influences, McCartney III is less adventurous and revelatory than its eponymous predecessors. Mostly, it reiterates his well-established fondness for acoustic ditties, ruminative piano ballads, and hot-rod rockers. And yet it still offers intriguing evidence that, even when sticking to his usual lane, a septuagenarian multi-millionaire pop star comfortably ensconced in his rural estate can still get up to some pretty weird shit when no one’s looking.",
      "author": "Stuart Berman",
      "published_date": "2020-12-23",
      "word_count": 469,
      "fetch_timestamp": "2025-08-19T19:21:11.522336",
      "metadata": {
        "char_count": 3053,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:21:11.522330"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/paul-mccartney-flaming-pie/",
      "source": "pitchfork",
      "artist_name": "Paul McCartney",
      "title": "Paul McCartney: Flaming Pie",
      "content": "---\ntitle: Paul McCartney: Flaming Pie\nauthor: Stephen Thomas Erlewine\nurl: https://pitchfork.com/reviews/albums/paul-mccartney-flaming-pie/\nhostname: pitchfork.com\ndescription: On his tenth studio album, now reissued with rarities and B-sides, McCartney grappled with emotions too big to neatly fit inside a pop record.\nsitename: Pitchfork\ndate: 2020-08-01\n---\nFlaming Pie, Paul McCartney’s 10th solo album, arrived at the tail end of the Beatles’ mid-’90s renaissance. The remaining Fab Four members instigated this revival with the release of their long-gestating documentary The Long And Winding Road, which was given the generic title Anthology by the time it ballooned into a multi-media retrospective in 1995. Due to a stroke of luck, the release of the documentary and its accompanying rarities compilations coincided with the rise of Britpop. The time was ripe for McCartney to deliver an album steeped in Beatles lore, and that’s exactly what he claimed Flaming Pie was.\nUpon its release in May 1997, McCartney maintained that his immersion in the Beatles’ past inspired him to up his game, to make an album in the vein of his old band. Even its title was a nod to an arcane bit of Fab Four lore, derived from Lennon’s claim that he had a vision of a man on a flaming pie declaring that his band would henceforth be known as ”Beatles with an ’a’.” It was a canny marketing method, a tacit acknowledgment that perhaps his recent albums weren’t quite up to snuff while also snagging listeners whose interest in the Beatles may have been rejuvenated thanks to Anthology and the new breed of Britpoppers. It also was a bit deceptive. Flaming Pie sounds as similar to the Beatles as Oasis, which is to say not much at all; it’s recognizably in the same melodic vein, but all the production frills don’t recall Sgt. Pepper’s and the tone of the album is decidedly reflective, suiting a man taking stock of his life upon the cusp of his 55th birthday.\nBack in 1997, this wistful undercurrent was criticized as solipsistic—in the original review for Rolling Stone, Anthony DeCurtis dismissed the album opener “The Song We Were Singing” as a self-congratulatory “boomer reminiscence”—but a dive into the rarities-laden Archive Edition of Flaming Pie reveals that the album represented the end of an era as well as a creative rebirth. According to McCartney, he was told he could not release his solo album while the Anthology rollout was underway, so he kept tinkering with the songs that would comprise Flaming Pie while working on other projects—Standing Stone, his second long-form classical piece, for example, and a fairly tedious 1996 single called “The Ballad of the Skeletons” in which he jammed with avant-garde icons Lenny Kaye, Philip Glass, and Marc Ribot.",
      "author": "Stephen Thomas Erlewine",
      "published_date": "2020-08-01",
      "word_count": 452,
      "fetch_timestamp": "2025-08-19T19:21:11.564180",
      "metadata": {
        "char_count": 2769,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:21:11.564173"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/22999-flowers-in-the-dirt/",
      "source": "pitchfork",
      "artist_name": "Paul McCartney",
      "title": "Paul McCartney: Flowers in the Dirt [Deluxe Edition]",
      "content": "---\ntitle: Paul McCartney: Flowers in the Dirt [Deluxe Edition]\nauthor: Stephen Thomas Erlewine\nurl: https://pitchfork.com/reviews/albums/22999-flowers-in-the-dirt/\nhostname: pitchfork.com\ndescription: The reissue of his 1989 collaboration with Elvis Costello reveals the art underneath its schlocky gloss. It is also the rarest of things: a McCartney record where you can sense his need to be loved.\nsitename: Pitchfork\ndate: 2017-03-28\n---\nPaul McCartney wasn’t exactly in the commercial doldrums in 1989, but he certainly understood ignominy was within his grasp. Press to Play, his 1986 album, generated no real hits to speak of. George Harrison—the young kid he brought into the Beatles back in 1958—bested Paul in 1987 with Cloud Nine, an album that contained the number one smash “Got My Mind Set on You” and a lesser hit called “When We Was Fab,” an affectionate nod to his time as a Moptop that played right into the lingering nostalgia from the 20th anniversary of Sgt. Pepper’s Lonely Hearts Club Band* *in ’87.\nSavvy as ever, McCartney decided it was time to strengthen his ties to his Beatles past on Flowers in the Dirt, the 1989 record that effectively opens the third act in his monumental career. McCartney designed Flowers in the Dirt to be taken out on the road in his first international tour in over a decade and while that in itself would’ve been a noteworthy event, he realized he should have a record to peddle as well. He’d been working on new songs but the project came into focus when his management suggested it might be a good idea to team with Elvis Costello, the former punk who had been a card-carrying member of the Beatles fan club since he was a kid.\nMost of the contemporary press regarding Flowers in the Dirt highlighted the collaboration between Paul McCartney and Elvis Costello, positioning Costello as the salt to McCartney’s sugar. Comparisons to John Lennon were encouraged, as the publicity team pushed the idea that the songwriters composed “eyeball to eyeball,” just like the two Beatles did at the start of their career. Costello encouraged McCartney to dig out his iconic Höfner bass—he hadn’t used it since the Beatles—and the two wrote enough material to constitute a full record. But after initial sessions with Costello as a producer didn’t go as expected, Paul sought out other options, bringing in a bevy of producers (Micthell Froom, David Foster, Steve Lipson, and Trevor Horn) to help cast as wide of a net as possible with these songs. With McCartney also behind the boards, there was no shortage of cooks in the kitchen.\nSo it’s no wonder that things rarely cohere. “My Brave Face,” one of the four McCartney/Costello compositions (“Où Est le Soleil?,” originally a bonus track on the cassette and CD versions, is now officially canon), opens the album with a melodic punch. Any momentum it provides is crushed by the stiff synth-funk of “Rough Ride,” a Lipson/Horn production that should’ve been relegated to a B-side but instead exists as the worst second track ever released on an album. From there, Flowers in the Dirt proceeds in fits and starts, sometimes achieving a small measure of grace. McCartney always excelled in familial love, so “We Got Married” and the valentine to his son “Put It There” pull on the heartstrings. But the deliberate proto-digital gloss flattens the album, softening the edges of the Costello collaborations and disguising the loveliness of such sweet miniatures as “Distractions.”",
      "author": "Stephen Thomas Erlewine",
      "published_date": "2017-03-28",
      "word_count": 574,
      "fetch_timestamp": "2025-08-19T19:21:11.602320",
      "metadata": {
        "char_count": 3475,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:21:11.602311"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/21028-tug-of-war-pipes-of-peace/",
      "source": "pitchfork",
      "artist_name": "Paul McCartney",
      "title": "Paul McCartney: Tug of War / Pipes of Peace",
      "content": "---\ntitle: Paul McCartney: Tug of War / Pipes of Peace\nauthor: Ron Hart\nurl: https://pitchfork.com/reviews/albums/21028-tug-of-war-pipes-of-peace/\nhostname: pitchfork.com\ndescription: These two albums from the 1980s, now reissued with bonus tracks, aren't anywhere near Paul McCartney's best, but both have their moments and they shed light on his long-time love of R&B.\nsitename: Pitchfork\ndate: 2015-10-06\n---\nPaul McCartney's team-up with Rihanna and Kanye West on \"FourFiveSeconds\" earlier this year was met with surprise and bewilderment by some, but if you go back far enough you'd see it's just par for the course in the mind of Macca. Ever since the Beatles covered the Cookies back in '63, McCartney has been testifying to his love of R&B. \"Smokey Robinson was like God in our eyes,\" he once said. There was a reason Billy Preston's Rhodes solo fit so perfectly in \"Get Back\", after all. Paul McCartney was an R&B lover before he was ever a Beatle.\nIn McCartney's solo material, however, you have to fast forward to 1982's Tug of War and 1983's Pipes of Peace to hear how that R&B influence evolved in his distinctive sound. It is within these two misunderstood albums in the Macca canon that the square root of \"FourFiveSeconds\" can be discovered, particularly upon the release of this latest pair of deluxe editions as part of the ongoing Paul McCartney Archive Collection series.\nIn one sense, Tug of War plays out like the album we might've gotten had Lennon and McCartney taken up Lorne Michaels' famous $3,000 offer to reunite on \"Saturday Night\" in 1976. George Martin sits at the controls on a Fab Four-related project for the first time since Wings' \"Live and Let Die\" (unless you count the 1978 soundtrack to the unmentionably awful \"jukebox musical\" Sgt. Pepper's Lonely Hearts Club Band). The specter of Lennon's tragic death and the unresolved differences between the two lifelong friends loom large across much of this material, especially the jubilant \"Ballroom Dancing\", the symphonic title track and \"Here Today\". The latter is the album's most direct reflection on Lennon's death, and it's a song McCartney has been regularly incorporating in his concerts the last couple of tours. Whatever Paul might not have said in the press at the time of Lennon's assassination, he certainly said here.\nThe nucleus of Tug, however, is McCartney's yin-yang pair of collaborations with Stevie Wonder. Of course we all know \"Ebony and Ivory\", pure ground-zero Macca schmaltz tethered by a goofy yet endearing analogy to the synchronicity between the piano's keys. Strangely enough, the song's message has grown more urgent over the years, while the utterly Triple A orchestrations of the music itself grows as dated as that Joe Piscopo/Eddie Murphy send-up on \"Saturday Night Live\". The key moment comes earlier on the album with \"What's That You're Doing?\", a tour de force of Hotter Than July-era Wonder funk that can be seen as the ColecoVision to the PS4 of \"FourFiveSeconds\".",
      "author": "Ron Hart",
      "published_date": "2015-10-06",
      "word_count": 489,
      "fetch_timestamp": "2025-08-19T19:21:11.642412",
      "metadata": {
        "char_count": 2993,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:21:11.642406"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/17354-kanye-west-all-day-ft-allan-kingdom-theophilus-london-and-paul-mccartney/",
      "source": "pitchfork",
      "artist_name": "Paul McCartney",
      "title": "Kanye West: \"All Day\" [ft. Allan Kingdom, Theophilus London, and Paul McCartney]",
      "content": "---\ntitle: Kanye West: \"All Day\" [ft. Allan Kingdom, Theophilus London, and Paul McCartney]\nauthor: Jayson Greene\nurl: https://pitchfork.com/reviews/tracks/17354-kanye-west-all-day-ft-allan-kingdom-theophilus-london-and-paul-mccartney/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2015-03-03\n---\nPhoto by Erez Avissar\nEven minus flamethrowers, even with the vocal take riddled with gaps: \"All Day\" is still the first sign that Kanye has something formidable to unleash with So Help Me God. \"Only One\" and \"FourFive Seconds\", both ingratiating, felt timid, smoothed-out—polite in a way that doesn't suite Kanye's combustible energy and will to dominate. The studio version of \"All Day\" is an odd hybrid: The beat is a clanking grandfather clock of old, septic parts, some borrowed from Kanye's brief drill fascination and some sourced from the poisoned well of Yeezus.-=-=-=-\nKanye's rapping harder, faster, sharper than ever: Years and years into his evolving style, he’s fashioned his voice into something dull and jagged at once, a hacked-off piece of jetliner assaulting the beat. Here, he seethes, collapsing all the spaces in between the words until he sounds like James Brown imitating a tommy gun. He fires off insults like sparks from sputtering livewires, and his verses breeze past, blessedly free of \"O-bamination\" clunkers, showing him at his finest and most vivid: When he’s convulsing.\nBut the oddest part, by far, is the outro, when he falls mostly silent, allowing the roaring machine of the beat to take over. Things go completely sideways as a barbed chain of a synth sound swallows the surroundings: a voice hollers \"GET LOW\" like a rebel ducking to avoid searchlights. And then, Sir Paul, amiable uncle figure from \"FourFiveSeconds\", wanders back in, strumming and whistling carefree. The Smoke Monster synth, uncaring, devours him too, and everything pitches into the black. How this schizophrenic monster fits into So Help Me God is anyone's guess.",
      "author": "Jayson Greene",
      "published_date": "2015-03-03",
      "word_count": 298,
      "fetch_timestamp": "2025-08-19T19:21:11.677654",
      "metadata": {
        "char_count": 1975,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:21:11.677647"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/18634-paul-mccartney-new/",
      "source": "pitchfork",
      "artist_name": "Paul McCartney",
      "title": "Paul McCartney: New",
      "content": "---\ntitle: Paul McCartney: New\nauthor: Miles Raymer\nurl: https://pitchfork.com/reviews/albums/18634-paul-mccartney-new/\nhostname: pitchfork.com\ndescription: There isn’t a cut on Paul McCartney's 24th studio album*—*featuring production work from Mark Ronson and Paul Epworth—that doesn’t make a compelling argument for him continuing to produce music. New is an LP that pushes hard against the popular conception of what a Paul McCartney record is supposed to sound like.\nsitename: Pitchfork\ndate: 2013-10-16\n---\nIf there’s one single song that can justify the existence of Paul McCartney’s 24th studio album since leaving the Beatles, it’s track number five, “Early Days\". At first blush it seems to be that most heinous of Boomer cliches, the acoustic Those Were the Days ballad where youth-culture narcissism collides with old-people shmaltz, but fairly quickly the song resolves into something much more interesting. While the verses are a rose-tinted reminiscence of McCartney and John Lennon’s brief period of pre-fame friendship in Liverpool, the choruses project something altogether different: “They can’t take it from me/ if they try/ I lived through those early days.” Whereas most of his hippie-era pop contemporaries enthusiastically embraced self-hagiography decades ago, McCartney’s relationship with nostalgia is complicated, and fraught with skepticism, and by embracing these complications he offers an understandably human portrait of a position few of us will ever find ourselves in: watching your life story being converted into mythology by forces outside of your control.\nBut really, there isn’t a cut out of the thirteen on New that doesn’t make a compelling argument for McCartney continuing to produce music. As his evolving relationship with shmaltz goes to show, he’s continued to stretch out as an artist long after most artists from his generation slipped into a comfortable rut. While it’s not as radical an aesthetic statement his searingly noisy 2008 Electric Arguments, his appearance on a recent EDM banger by Bloody Beetroots, or his stint as frontman for Nirvana, it still pushes hard against the popular conception of what a Paul McCartney record’s supposed to sound like, which is a wonderful thing.\nHe’s found some enthusiastic partners in this in the album’s four producers, each of whom approaches the collaborative challenge from a different angle. Adele and Florence and the Machine producer Paul Epworth revives the taut, nervy postpunk sound of his early work with Bloc Party for the album-opening “Save Us\", and injects the single “Queenie Eye” with aggressively punchy compression and generous splashes of noise. Trad-rock specialist Ethan Johns gives two of the album’s acoustic moments, “Early Days” and Hosanna\" an intimacy that’s almost painfully raw. “Alligator” and “New\", the two tracks produced by Mark Ronson, are the ones that most closely resemble McCartney’s classic work (late-era Beatles and early Wings, respectively) but he’s given them a modern-sounding density. (He also proves his reputation as an expert vocal producer by stacking McCartney’s voice into a multitracked nod to Pet Sounds at the end of “New.”)",
      "author": "Miles Raymer",
      "published_date": "2013-10-16",
      "word_count": 483,
      "fetch_timestamp": "2025-08-19T19:21:11.715061",
      "metadata": {
        "char_count": 3176,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:21:11.715054"
      }
    }
  ],
  "total_articles": 10,
  "total_words": 6028,
  "extracted_at": "2025-08-19T19:21:11.715466",
  "urls_processed": [
    "https://pitchfork.com/features/interview/8854-paul-mccartney/",
    "https://pitchfork.com/features/interview/7555-sir-paul-mccartney-and-youth-aka-the-fireman/",
    "https://pitchfork.com/reviews/albums/paul-mccartney-wings-one-hand-clapping/",
    "https://pitchfork.com/reviews/albums/paul-mccartney-mccartney-iii-imagined/",
    "https://pitchfork.com/reviews/albums/paul-mccartney-mccartney-iii/",
    "https://pitchfork.com/reviews/albums/paul-mccartney-flaming-pie/",
    "https://pitchfork.com/reviews/albums/22999-flowers-in-the-dirt/",
    "https://pitchfork.com/reviews/albums/21028-tug-of-war-pipes-of-peace/",
    "https://pitchfork.com/reviews/tracks/17354-kanye-west-all-day-ft-allan-kingdom-theophilus-london-and-paul-mccartney/",
    "https://pitchfork.com/reviews/albums/18634-paul-mccartney-new/"
  ]
}