{
  "artist_name": "Slash",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/19200-avey-tares-slasher-flicks-enter-the-slasher-house/",
      "source": "pitchfork",
      "artist_name": "Slash",
      "title": "Avey Tare’s Slasher Flicks: Enter the Slasher House",
      "content": "---\ntitle: Avey Tare’s Slasher Flicks: Enter the Slasher House\nauthor: Stuart Berman\nurl: https://pitchfork.com/reviews/albums/19200-avey-tares-slasher-flicks-enter-the-slasher-house/\nhostname: pitchfork.com\ndescription: To date, Dave \"Avey Tare\" Portner’s projects outside of Animal Collective have leaned toward the intensely introspective. His new band, Avey Tare's Slasher Flicks, resemble Animal Collective in stripped-down, garage-band, power-trio formation: not quite as densely textured and sonically adventurous, but more than capable of generating the same sense of euphoric abandon.\nsitename: Pitchfork\ndate: 2014-04-08\n---\nCentipede Hz may have been Animal Collective’s response to unwittingly becoming a Top 20*-*charting act, but the subsequent tours behind the record revealed there was, in fact, a limit to their perpetual game of playing hard-to-get. Where the quartet has traditionally treated concerts as public practice sessions to air out works-in-progress, their 2012-13 setlists charitably balanced out the Hz with the hits (meaning that the band’s newer fans no longer had to dial up YouTube clips from 2007 to experience “My Girls” in a live setting). This generous spirit seems to have carried over to primary vocalist Dave “Avey Tare” Portner’s current interim pursuit, which offers a glimpse of the kind of band Animal Collective could be if they gave into populist demand more often.\nTo date, Portner’s projects outside of Animal Collective have leaned toward the intensely introspective, whether he was making blissed-out, backward-looped soundscapes with then-wife Kría Brekkan (2007’s Pullhair Rubeye) or fractious, click ‘n’ cut digi-dirges to address their subsequent separation, the death of his grandmother, and his sister’s struggles with cancer (2010’s Down There). His new band, Avey Tare’s Slasher Flicks, was born of a similarly stressful circumstance—Portner was sidelined by strep throat for a long stretch last year—but it also serves as a therapeutic, adrenalized antidote.\nSupported by ex-Dirty Projector Angel Deradoorian and former Ponytail drummer Jeremy Hyman, Avey Tare’s Slasher Flicks effectively resemble Animal Collective in stripped-down, garage-band, power-trio formation. They're not quite as densely textured and sonically adventurous, but more than capable of generating the same sense of euphoric abandon: the bouncing-ball momentum of opening track “A Sender” follows in the foot-stomps of two totemic AC openers—Feels’ “Did You See the Words” and Strawberry Jam’s “Peacebone”—while “Duplex Trip” packs the woozy tropical punch of Centipede Hz's more mango-flavored material. (The sporadic flashes of high-beam harmonies from Deradoorian likewise yield a potent I-can’t-believe-it’s-not-Panda Bear effect.) But Slasher Flicks gradually develop their own peculiar personality, most notably on “Little Fang”, the album’s lead single and the most atypical track here.\nIn contrast to the rhythmic clatter and electro squiggles that usually accompany Portner’s voice, the Slasher Flicks position \"Little Fang\"’s engaging call-and-response hook atop a silken 70s soft-rock groove that resembles a bygone ELO hit refracted through a funhouse mirror (while also betraying Portner’s debt to the phantasmagoric pop of Pure Guava-era Ween). And in their most concise, frenetically funky moments— “Blind Babe”, “Modern Days E”, “Strange Colores”—Slasher Flicks pump out better Jane’s Addiction songs than anything that band has come up since reuniting (an outcome that doesn’t seem so ridiculous when you consider Portner and Perry Farrell’s mutual appreciation of tribal-percussion, rapid-fire wordplay, and the Grateful Dead—heck, the Jane’s cover of “Ripple” could practically pass for a dry run for \"Fireworks\").",
      "author": "Stuart Berman",
      "published_date": "2014-04-08",
      "word_count": 532,
      "fetch_timestamp": "2025-08-20T08:25:30.723364",
      "metadata": {
        "char_count": 3766,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:25:30.723346"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/15055-rustie-slasherr/",
      "source": "pitchfork",
      "artist_name": "Slash",
      "title": "Rustie: \"Slasherr\"",
      "content": "---\ntitle: Rustie: \"Slasherr\"\nauthor: Larry Fitzmaurice\nurl: https://pitchfork.com/reviews/tracks/15055-rustie-slasherr/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2013-03-04\n---\nWhen Rustie spoke with us last year around the time he unleashed his astounding BBC Essential Mix, the Glaswegian producer claimed the music he'd been making since 2011's Glass Swords, was \"sort of classical,\" while offering the caveat that most of it would get chopped up for \"club tracks\" in the end. So it only takes one listen to \"Slasherr\", the B-side to Rustie's forthcoming single for Numbers, to confirm that, despite his occasional prediliction towards string-drenched orchestration (see: the gorgeous VIP edit of Glass Swords' \"City Star\"), he's not leaving the dancefloor behind any time soon.\nBuoyed by up-with-people handclaps and daggered synth stabs, \"Slasherr\" would fit in perfectly alongside Glass Swords' high-contrast soundscapes-- but true to its title, the tune possesses the ability to brutalize, as a tidal wave of compressed melody storms into the foreground, obliterating everything in sight. Sharp, translucent crystals have frequently appeared on Rustie's cover art-- the triangulated art of Glass Swords, the refracted shards that adorned the AlunaGeorge collaboration \"After Light\", and now the crimson-splattered lotus on the jacket of \"Triadzz\" b/w \"Slasherr\". With \"Slasherr\", Rustie is out for blood, and the results are awesomely gory.\n[from \"Triadzz\" b/w \"Slasherr\"; out 03/18/13 via Numbers]",
      "author": "Larry Fitzmaurice",
      "published_date": "2013-03-04",
      "word_count": 217,
      "fetch_timestamp": "2025-08-20T08:25:30.787039",
      "metadata": {
        "char_count": 1514,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:25:30.787033"
      }
    },
    {
      "url": "https://pitchfork.com/features/interview/7800-the-hold-steady/",
      "source": "pitchfork",
      "artist_name": "Slash",
      "title": "The Hold Steady",
      "content": "---\ntitle: The Hold Steady\nauthor: Tom Breihan\nurl: https://pitchfork.com/features/interview/7800-the-hold-steady/\nhostname: pitchfork.com\ndescription: Craig Finn and Tad Kubler on Slash, Titus Andronicus, hardcore, and the departure of keyboardist Franz Nicolay.\nsitename: Pitchfork\ndate: 2010-05-16\ncategories: ['features']\n---\nPhoto by Mark Seliger\nHeaven Is Whenever, the new Hold Steady album, sounds very much like a Hold Steady album; nothing about it will shock you if you've been paying attention to the band's past four records and to the arc that they form. It has more big riffs, more bigger choruses, more dizzily worded images of youthful debauchery. But slowly, the band has incorporated new melodic ideas: slide guitars, jaunty Memphis horns, a clarinet solo. Frontman Craig Finn is actually singing sometimes these days, rather than splenetically ranting into the wind. And the band has moved from the outsider's in-quotes take on alcohol-fueled arena-rock to actual straight-up arena-rock, no quotes necessary. That's a big move.\nPitchfork spoke with Finn and lead guitarist Tad Kubler about Slash, Titus Andronicus, violent hardcore shows, and the recent departure of mustachioed keyboardist Franz Nicolay. Our interview is below.\nPitchfork: How are thing going with the new touring lineup?\nCraig Finn: It's good! We had two weeks or so on the road with this new lineup, which was exciting and fun and different. We're all psyched. It's interjected new life into the thing.\nPitchfork: On this new album, you're really singing more than ever.\nCF: We have been blessed in order to play music for a living for a long time, and through that we've played tons of shows. Being on a microphone nightly has made me better at what I do, made me better able to sing a little bit, but also more confident at trying it. So I think that that's part of where it comes from.\nPitchfork: You've also got these bigger choruses. I talked to you when Boys and Girls in America came out, and you said that you knew \"Party Pit\" would be a big live singalong song. Do you think about that with any of these ones? Or do you think about that while you're writing them?\nCF: You can sort of tell. The second song's \"Soft in the Center\": \"You can't get every girl; you get the ones you love the best.\" Those couplets-- you can kind of tell that there's a certain type of dude who's in our audience that you see his fist raised. It's not what I'd say I'm trying to do, or what I'm trying to say, but you can kind of think like, \"Oh yeah, people are going to do a certain thing in that one.\"\nGoing back to \"Party Pit\", you can tell-- because that one's about drinking-- that people will have a certain reaction to it. But yeah, I think with the choruses, we did something we wanted to do. We wanted to create something that was memorable. It's our fifth record. It's really easy, in a band, to overstate-- you feel like everything you do is different than the past. I think this is just another Hold Steady record, but at the same time, there is some evolution. Like, \"How can we make this chorus bigger?\" \"What do we want this to sound like?\"\nPitchfork: There could be this one interesting contrast on the album. It's the most melodic and polished you've ever sounded, but you're also making more references to old hardcore bands.\nCF: Some people I've talked to have had really an interpretation of this record as being nostalgic. But in some ways, when we were writing Stay Positive, I was really obsessed with age. I kept saying it was a record about trying to age gracefully. This record, I think actually was us aging gracefully. Some of the lyrics come from maybe a place of a little more wisdom, being 38 and at this point having a lifetime in rock'n'roll.\nThere's this old joke about a young bull looking down at these cows and saying, \"Hey dad, look at all those cows! Let's run down and fuck one of them.\" And dad says, \"No, let's walk down and fuck them all\"-- which is a crass way of explaining what I'm trying to say. But there's this contentment. I don't feel like there's a chip on this shoulder anymore. I feel pretty content. I mean, things have been going pretty well for us for a while. So maybe the lyrics come from a slightly different place.\nPitchfork: So if the last one was a record about aging gracefully, what's this one about?\nCF: I think this record's really about struggle and reward. You know, the point of being in a band, for instance, isn't to get big; it's about enjoying playing shows. It's like when you go to the gym. You can either go to the gym because you want to lose weight, or you can go to the gym because you like how it makes you feel when you're running. So I think this one's about reexamining your relationship. Heaven Is Whenever-- the Christian version of reward, the ultimate reward of heaven. I guess what I'm trying to say is this is happening every day. We're blessed always. There is struggle and there is suffering in our lives, but understanding that is part of our lives-- a part that just is. Suffering is a part of the joy of life.\nPitchfork: If it's about struggle and reward, then where does something like the Youth of Today story on \"Barely Breathing\" fit into that?\nCF: I did see those shows. Ray Cappo never tried to convert me into a Krishna, although one of his cohorts probably did. I think it was just about being wrapped up in this thing. Hardcore, at one point, meant everything to me. Now you look back, and I still think it's cool, but to some extent I grew out of it. Other things became a bigger priority for me. That chorus ends up with, \"Nobody wins at violent shows.\" That's coming from the same thing. It's hard for me to imagine a show that you need to have a fight at, or anyone in the mindset of, \"Wow, I'm fighting at a show.\" Or a show that you'd go to, a hardcore show, where there's six different fights. Things are out of perspective at that point.\nPitchfork: You worked with Dean Baltulonis on this one. He produced the first couple of records, which don't really sound anything like this one. Do you see any commonality between this one and the first two albums?\nCF: Yeah, although I don't know that it's on a studio level. The first two records were really written as a four-piece, and then Franz [Nicolay] joined in right before Separation Sunday. He played piano, but he was kind of playing over the songs we already wrote. And this one was really written for a four-piece. There's space, and the songs breathe. We resisted the urge to fill every nook and cranny, which makes the songs less frantic and-- I think-- better. It doesn't really sound like Separation Sunday, but that's more of a statement of how many hundreds of shows we've played between Sep Sunday and today, how that's changed us as people and as musicians and as a band.\nPitchfork: It's the longest time you've taken between albums. Even though it's only a couple of years, it seems like it's been a while since Stay Positive came out.\nCF: It's getting toward two years, and generally we've done one about every 15 months. But we did a longer promo push for Stay Positive-- especially in the UK. We spent a lot of time touring and capitalizing on a growing audience over there.\nWe took a long time making this record. John Agnello produced the last two, Boys and Girls and Stay Positive, and we were really happy with it. But at the same time, it was like, \"Well, do we just go and do that again? No, let's go back to Dean and do it a little different. Let's just start recording.\" And at some point, we were like, \"Wow, we have a lot of good songs. Let's make a record. Let's wrap this up and deliver it.\"\nWhen we started the band, I was really like, \"We just want to make a lot of records\"-- not quite unlike Guided By Voices' schedule. I've always thought that our live thing is what we do best, and having a really robust, big catalog makes for the most interesting live band-- especially with people, at this point, traveling to see us night after night. For us to have almost 100 songs to pull from is a really cool thing. The sets can be different. They can be invigorating on an intellectual level. I definitely hope to continue to release records at an accelerated pace.\nPitchfork: It's always been pretty amazing that you've been able to just crank out albums while maintaining this intense touring schedule.\nCF: It's like what I was saying about the record. If we enjoy what we're doing, we shouldn't really need a break. It's fun for us to play music. It's our livelihood, but I don't look at it as a job. It doesn't seem to me to be a problem to constantly be doing this. And also, the more you release records, in some ways it takes pressure off you. If you wait four or five years between records, it better be a masterpiece, you know? And if you keep putting them out, you're saying, \"Hey, here's 10 more songs we wrote. Wanna hear 'em?\"\nPitchfork: You mentioned the UK. Are you bigger over there than you are here?\nCF: I think proportionally, yeah. That the biggest headlining club show we've ever done was in London. That was like 3,000 people at the Roundhouse. I mean, it's comparable. We never went there before Boys and Girls in America, and it just seems like it's caught up really quickly. Proportionally, if you look at the numbers, we're selling maybe a third of the total record sales in England. Maybe a quarter. So, that's pretty big.\nPitchfork: But you're such an American band.\nCF: Well, I think so too. There's somewhat of a real fascination with American bands and American mythology in London, so I think we've tapped into some of that. Maybe because of the way the press works or whatever, they have extremely knowledgeable music fans over there. People who will sit there and talk to you about some record that came out in 1967 out of Memphis that you've never heard before.\nPitchfork: You're on the Titus Andronicus album, The Monitor. There's an eMusic interview with Titus frontman Patrick Stickles where he basically says that that album is his band's attempt to make Separation Sunday, or something comparable. What do you think of that?\nCF: They're my favorite young band, and I think that Patrick himself is an incredibly intelligent and energetic person. I was proud to be asked to do it. I think that's maybe how he experienced it. If that is, it's mainly just because it's a cohesive narrative throughout an album. When you think about what an album means to a 24-year-old like him, you also have to contextualize it with that. An album doesn't mean as much to a lot of people now, compared to just songs. So I'm flattered in that way, and I really love that band. I think they're really exciting, and I think they do all the right things. They have the exact right amount of punk rock and fist-pumping along with a lot of intelligence and emotion. So it's an exciting time to be around them. A lot of things are happening for them.\nPitchfork: It's also it's cool to me that you have been around as the Hold Steady long enough that you can be an influence.\nCF: Yeah, well that's the thing. When I was down at SXSW, I saw Patterson Hood of the Drive-By Truckers. And I was talking with him: \"Man, we're putting out our fifth record. It's weird to think you're pretty established a little bit.\" You know? Even at 35, I felt like the Hold Steady were up-and-comers. Now I feel like, \"Wow, people are naming us as an influence. That's very cool.\" But it's a little different mindset.\nPitchfork: With the album done, how are you feeling about it?\nTad Kubler: I don't want to say that this is our best record or anything like that because I don't want to diminish any of the albums we've done before. But I feel like we made a good album. There's a lot of music that's about to come out. I was talking to Carl [Newman] from New Pornographers, and Broken Social Scene's got a new record coming out. There's so much music that's coming out in the next few weeks, and I'm just really proud that we're in that collective of people making music. So I feel like we've made a good record. I hope people enjoy it.\nPitchfork: It's definitely a really big-sounding record, and it's kind of funny. Every album, you guys have made something sonically bigger in scope than what came before. You did it again this time.\nTK: The two records we made with John [Agnello], we made some deliberate decisions. One thing I wanted to do was keep it very traditional in terms of production-- everything from the tape we used to the studio we recorded in, keeping everything analog. The mic placement and all these things that we did. But I really wanted this record to sound a little more contemporary. I think that's what people are hearing when they think this album is a little more produced or a little more slick.\nPitchfork: How do you mean \"contemporary\"?\nTK: I didn't get caught up in being concerned about keeping clear of anything but analog gear. We recorded in Pro Tools, and we used the studio more as a tool than simply a conduit to record music. I guess I wanted it to sound less traditional or vintage. I didn't get hung up about the warmth of the tape or the tube mics or anything. In fact, a lot of times, I was like, \"Fuck it, man, let's just throw a mic up in the room and record something.\" I concentrated more on what we were trying to capture as opposed to how we were capturing it.\nPitchfork: It seems like you've scaled back the guitar heroics on this one. There are fewer solos and fewer big moments for you on this album.\nTK: Actually, there was a big guitar solo in \"We Can Get Together\", and we still do it live, but I ended up taking it out of that song. I felt like the recorded version, there was this really beautiful texturing with the guitar tracks and the piano and the vocals at the end, and I thought the solo seemed a little gratuitous. I've heard people say it's a bigger guitar record, which is funny because I ended up playing a lot of piano on this record, and I ended up writing a lot on piano. How it became a bigger guitar record I'm not really sure. Essentially, we're a guitar band. I think our previous two records the piano is mixed a little loudly, so maybe that's why people got a little confused about that.\nPitchfork: When you say you played a lot of piano and wrote on piano, did you write without Franz?\nTK: Franz? Yeah, Franz isn't on the record. He wasn't involved with the record. He generally isn't. I've been the main songwriter for a while.\nPitchfork: Would you say, then, that Franz not being involved didn't make that big of an impact on the recording of the album?\nTK: Yeah, that's probably correct.\nPitchfork: You've got Dean Baltulonis producing this, and he did the first two albums, but the sound of this one seems miles removed from the first two. Listening back, those are so much more kind of jagged than this one. How did you decide to go with him again?\nTK: I was working on scoring stuff in January 2009, and he and I own a studio together. That was when I [decided] how I wanted to approach this songwriting. We started to do demos. I recorded \"A Slight Discomfort\" and \"A Sweet Part of the City\" in January 2009 and then showed those to the guys. Those songs ended up bookending the record. They're a little bit different from what we've done before, dynamically. And that was the impetus for this record-- trying new things.__\n__\nPitchfork: Is that a clarinet solo on \"Barely Breathing\"?\nTK: It is. I really wanted a clarinet solo on \"Cattle and the Creeping Things\" on our second record, and it never happened for various reasons. So when I called Peter Hess to come in and do horns on a couple of songs, \"Barely Breathing\" being one of them, I said, \"Do you have a clarinet?\" And he said, \"I do.\" And I said, \"Bring it, because I have an idea.\" I think the feel and the tempo of the song lends itself to that Dixieland-style solo. It makes it exciting and interesting for us to try new things. It's always going to be a Hold Steady album, but if we go in with the intention of trying to do things differently, and to grow as a band, it's going to keep us happy and interested.\nPitchfork: It's interesting to me when the first records came out, it was like, \"Oh, it's the Lifter Puller guys doing their take on classic arena rock,\" and now you're actually playing much bigger venues, sometimes festivals or opening for the Dave Matthews Band or whatever. When you do these newer songs, do you think about how they're going to sound in these bigger spaces?\nTK: First of all, we're essentially playing rock music. I've always said we're a rock band. We're playing the music, essentially, that I grew up with. It's how I learned to play guitar-- sitting with Led Zeppelin and Cheap Trick records, backing the needle up and learning how to play along. When the band started, by doing something that was very obvious to us and sort of traditional, it set us apart at the time from what was happening musically.\nI still find that funny and interesting. We don't think about how the songs are going to translate so much during the writing process. Once the song is recorded, and once we're mixing, that's when it occurs to me. Then you start rehearsing to play shows. I never concern myself about how we're going to pull it off live, because I know we'll figure out a way to do it. As long as the six of us get up onstage and have at it, that's what a rock concert is. The rest will work itself out.\nI remember soundchecking at the Manchester Evening News Arena-- that's like a 20,000 capacity arena. I thought, \"Man, this sounds right. This is how this should sound all the time.\" And that was a really awesome experience, growing up and going to rock concerts that were in arenas. So that was fun. That's what's nice about playing festivals, too. You're on this huge, enormous stage and you've got 200,000 watts of power blowing your guitars all over the place. It sounds good.\nPitchfork: Over the years, it's been a lot of fun watching you add little tricks and ideas and stuff to your stage show. You started out doing the thing where you throw your guitar over your shoulder and then it comes back again, or you started bringing out the doubleneck guitar. Where do you go from there? Do you have any more new things that you're pulling out?\nTK: You know, the next step is probably fire, isn't it?\nPitchfork: I think it has to be.\nTK: That may be a little bit harder to run by the guys. The doubleneck was already a problem.\nPitchfork: How was it a problem?\nTK: As a guitar player, I've got a shit ton of stuff I take out on tour, from my guitar collections to amps. So it's always like, \"Do you really need all this shit, man?\" And it's like, \"I'm a guitar player in a rock band. What does 'need' have to do with it?\" But to be honest, the next thing was the addition of Steve to the band. I've really thought we needed a second guitarist for a long time, and Steve was somebody we met on one of our first tours. He's from Memphis, and he was playing in the Bloodthirsty Lovers. We were up late bonding over Led Zeppelin records. We kept in touch, and when I finally convinced everybody that we needed to get a new guitar player, Steve was the first person I called.\nPitchfork: Does that free you up to do more on stage?\nTK: Yeah, definitely. Also, Steve is such a phenomenal guitar player that it's nice to get up onstage with somebody of that caliber. It forces me to play my ass off every night; otherwise he's going to wipe the floor with my ass.\nPitchfork: When you grew up going to arena rock shows, who were some of the guitarists who had an impact on you?\nTK: Rick Nielsen, Angus Young. Huge Eddie Van Halen fan when I was younger. Jimmy Page is an enormous one. When you grow up with classic rock like that and then you get into punk rock, you defy your roots and where you came from. I never really went through that. Even when I started listening to the Clash or the Sex Pistols, I still always listened to Led Zeppelin or Kiss. I guess my guitar heroes shifted from people like Jimmy Page and Jimi Hendrix to people like Johnny Marr or John Squire.\nPitchfork: The solo on \"Lord, I'm Discouraged\" seems very, very Slash.\nTK: That's absolutely it. Yes. That solo-- in terms of notes it isn't anything like it, but in terms of aesthetic, it's direct rip-off from the \"November Rain\" solo. In fact, when I did it, I imagined myself walking out of a church, walking out onto a cliff and doing a guitar solo. Slash has always been one of my favorites because the guy uses a lot of melody in his solos. It's not just a quick run of notes with technical prowess. He can take three notes and make a beautiful solo. And that's one thing I've always really admired about his guitar playing. I'm a huge Slash fan all around.\nPitchfork: This might be a sore subject, but when Franz left the band, he gave an interview where he said that you guys have your one big idea that you do well. Speaking just as a fan of the band, it seemed like a major dick move. Did that also sit badly with you guys?\nTK: The only thing I can say-- knowing Franz, I don't think that he meant it to be like that. I don't know. I mean, I'm incredibly pleased with our new record, and I think it definitely illustrates how we've grown as songwriters and how we've grown as a band. That sort of speaks to what Franz was saying. So, you know, whatever, man.\nHow do I say this without sounding like a real dick? With the way media works now and the outlets people have with websites and blogs and message boards and Twitter and all this crazy shit, everybody has a voice. We probably agree particularly that that's not always the best thing. Being able to differentiate from a legitimate source and an objective opinion, as opposed to somebody shooting their mouth off under a pseudonym somewhere... if you start to look for stuff like that, you're going to drive yourself totally fuckin' nuts.\nI'm kind of going off on a tangent here a little bit. But if I start to go around and look for stuff that's being written about me or about the band, chances are I'm not going to find what I'm looking for or what I'd want to be hearing. If I go out and look for it and it's out there, I'm really going to notice when it's not. And I'd hate to think that that would impact any decisions I'm making. One thing I've always been really proud of about our band is that we've done what we wanted to do, what we enjoy doing, and we've been really lucky that people have responded to it the way that they have. As long as we continue to really enjoy what we do and make decisions with integrity, I'm hoping people continue to respond to that.",
      "author": "Tom Breihan",
      "published_date": "2010-05-16",
      "word_count": 4161,
      "fetch_timestamp": "2025-08-20T08:25:30.927204",
      "metadata": {
        "char_count": 22644,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:25:30.927198"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "Slash",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-20\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nRap\nStar Line\nChance the Rapper\nBy\nAlphonse Pierre\nAugust 20, 2025\nRock\nLove Is Like\nMaroon 5\nBy\nLinnie Greene\nAugust 20, 2025\nExperimental\nKhadim\nMark Ernestus’ Ndagga Rhythm Force\nBy\nRae-Aila Crumble\nAugust 20, 2025\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-20",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-20T08:25:31.412008",
      "metadata": {
        "char_count": 7698,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:25:31.411997"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/demiyaa-lil-rae-my-world/",
      "source": "pitchfork",
      "artist_name": "Slash",
      "title": "DEMIYAA / Lil Rae: My World",
      "content": "---\ntitle: DEMIYAA / Lil Rae: My World\nauthor: Alphonse Pierre\nurl: https://pitchfork.com/reviews/albums/demiyaa-lil-rae-my-world/\nhostname: pitchfork.com\ndescription: Read Alphonse Pierre’s review of the album.\nsitename: Pitchfork\ndate: 2025-07-17\n---\nThere are the couples who travel the world together; the couples who double as workout partners (living like the 1-on-1 scene in Love & Basketball, I imagine). When I was in high school, there used to be couples who dry humped at lunch. There are the couples who spend their time dressing each other in matching outfits and snapping pics—I’m reminded of them whenever I listen to a Ken Carson song. A lot of couples have their thing. DEMIYAA and Lil Rae’s thing is that they rap together. Technically, My World is the solo mixtape of DEMIYAA: a sometime rapper with a day job that seems to be selling cosmetics and bundles on Instagram, who appears on all 12 of the tape’s tracks. But it functions more like a two-hander with Rae—her man and a diss-happy rapper in the full-throated Atlanta drill scene that popped up a few years ago—who is on seven of the songs (eight if you count his ad-libs on “Ik I Look Good”). Together, DEMIYAA and Rae carve out an unusually romantic slice of drill.\nThe general vibe of My World is DEMIYAA sitting in the passenger seat doing her makeup, while Rae cruises around Atlanta buying her stuff and getting into bullshit. Basically, it’s a new generation “’03 Bonnie & Clyde,” in which Jay and Beyoncé were so joined at the hip that Hov said, “How hard she rides with me, the new Bobby and Whitney/Only time we don’t speak is durin’ Sex and the City.” OK, sure, that’s a little blasphemous; Miyaa and Rae aren’t storytellers anywhere close to that level, but they’re good at making it seem like they care deeply for each other in their own ways. On “One Call Away,” DEMIYAA holds Rae down by sneaking a weapon into the club for him. On “With the Gang,” over a sweet beat that sounds like it should be in Animal Crossing, Rae returns the favor by threatening to beat the ass of a guy that was bothering her. He spends the rest of his verse alternating between fighting inner demons and hyping Miyaa up: “Can’t lie you thick as fuck, yeah, I know you eat your cornbread.”\nWithout each other, DEMIYAA and Rae are less interesting—the tape rides on their flirtatious push and pull. On DEMIYAA’s solo tracks, her casual delivery sounds too much like she’d rather be doing anything else other than rapping. She can’t make up for her lack of energy with stylish flows like the laid back Detroit guys, or jokes and charisma like the chill Atlanta girls. But together with Rae, her carefree demeanor and his jacked-up chaos complement each other, as they pull off set ups and scams with the regularity of other couples going on walks in the park. The tape is at its most loving when they’re just sending each other twisted words of affirmations. DEMIYAA lets him know she will roll his blunts for him on “Cyber Truck”; Rae promises that if DEMIYAA wrecks her whip he’ll buy her a new one on “Back of the Bank.” It’s not exactly In The Mood For Love, but they sound like they really mean it.\nToo bad the beats aren’t better. They’re a bunch of cheap-sounding drum-heavy flips of pop songs and rap hits that have been flipped a million times before. They’re boring and unconsidered, like they rapped over whatever “type beats” their YouTube algorithm recommended that day. It’s not the biggest deal—the point of the tape is the chemistry and feeling between them. There’s a moment on “Ik I Look Good” that captures it, where over a decent enough rework of a soul classic, DEMIYAA softly mentions what it’s like to hang around Rae. “Rae hop out the backseat and act a fool,” she says, almost like she’s shaking her head at him. And then, for a half-second Rae appears just to say, “I be trippin’,” his equivalent of a guy apologizing with puppy dog eyes. It’s the sweetest moment on My World, one of the only drill mixtapes I can think of that could be reasonably described as pretty cute.",
      "author": "Alphonse Pierre",
      "published_date": "2025-07-17",
      "word_count": 715,
      "fetch_timestamp": "2025-08-20T08:25:31.444218",
      "metadata": {
        "char_count": 4064,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:25:31.444212"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/",
      "source": "pitchfork",
      "artist_name": "Slash",
      "title": "The Pitchfork Review: All of the Latest Episodes",
      "content": "---\ntitle: The Pitchfork Review: All of the Latest Episodes\nauthor: Condé Nast\nurl: https://pitchfork.com/podcast/the-pitchfork-review/\nhostname: pitchfork.com\ndescription: Listen to every episode of Pitchfork’s podcast for music fans and obsessives.\nsitename: Pitchfork\ndate: 2024-01-11\ntags: ['web']\n---\nBrought to you by the music critics at Pitchfork, The Pitchfork Review is a show for music fans and obsessives who can’t wait to talk about the latest releases. Co-hosted by Pitchfork editor-in-chief Puja Patel and Reviews Editor Jeremy D. Larson, this podcast pulls back the curtain on our reviews and scores, dives deep into new music, and gives an expert guide to what’s exciting, what’s great, and what’s just plain terrible.\nListen to every episode of Pitchfork’s podcast for music fans and obsessives.\nRelated Articles\nThe Origins and Influence of Brian Eno’s Pioneering Album Ambient 1: Music for Airports\nIn the latest episode of Pitchfork’s podcast, our critics revisit the legendary producer’s classic 1978 LP, which was recently featured in our Sunday Review series.\nBy Pitchfork\nJeff Tweedy on Rock Criticism, the Pitfalls of Music Snobbery, and His New Book\nThe musician and author discusses World Within a Song, in which he writes about 50 songs that rearranged his brain, Wilco’s new album, and more.\nBy Pitchfork\nThe 2023 Music Grab Bag: Trends, Scandals, and Theories\nIn this episode of the Pitchfork Review podcast, our critics talk about the rise of the musical theater girlie, the fall of the 1975’s Matty Healy, and more. Plus: Alvvays’ Molly Rankin reveals the song she wishes she wrote.\nBy Pitchfork\nThe Best, Worst, and Most Surprising Albums of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about some of their faves from our 50 Best Albums of 2023 list and lament a few of the year’s biggest disappointments.\nBy Pitchfork\nWhy the Replacements’ Tim Is the Best Reissue of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about the revelatory new version of the beloved rock band’s 1985 LP. Plus, Replacements bassist Tommy Stinson reveals his perfect-10 album.\nBy Pitchfork\nBreaking Down Bad Bunny’s New Album and the Future of Puerto Rican Rap and Reggaeton\nIn this episode of The Pitchfork Review podcast, our critics dissect Bad Bunny’s latest and highlight a few new queer artists from Puerto Rico who are taking the island’s music to exciting new places.\nBy Pitchfork\nDebating the Best Songs of 2023, Part Two\nIn this episode of the Pitchfork Review podcast, our critics battle it out over some of their favorite songs of the year, by artists including Troye Sivan, Kendrick Lamar, Big Thief and more. Plus: Devendra Banhart tells us all about his dream collaboration.\nBy Pitchfork\nDebating the Best Songs of 2023, Part One\nIn this episode of the Pitchfork Review podcast, our critics take sides and discuss which tracks by some of 2023’s most exciting artists deserve a spot on our upcoming year-end lists.\nBy Pitchfork\nThe Good, the Bad, and the Swiftie of Taylor’s Eras Tour Concert Film\nIn this episode of The Pitchfork Review podcast, our critics wade through the ups and downs of the pop superstar’s new record-breaking live movie.\nBy Pitchfork\nWhat Drake Is Doing Wrong—and How He Can Fix It\nIn this episode of the Pitchfork Review podcast, our critics talk about what made them care about Drake in the first place, why his new album For All the Dogs is so frustratingly mid, and what he should do next.\nBy Pitchfork",
      "author": "Condé Nast",
      "published_date": "2024-01-11",
      "word_count": 579,
      "fetch_timestamp": "2025-08-20T08:25:31.496762",
      "metadata": {
        "char_count": 3506,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:25:31.496757"
      }
    },
    {
      "url": "https://pitchfork.com/features/update/9328-avey-tares-slasher-flicks/",
      "source": "pitchfork",
      "artist_name": "Slash",
      "title": "Avey Tare's Slasher Flicks",
      "content": "---\ntitle: Avey Tare's Slasher Flicks\nauthor: Larry Fitzmaurice\nurl: https://pitchfork.com/features/update/9328-avey-tares-slasher-flicks/\nhostname: pitchfork.com\ndescription: Animal Collective's Avey Tare talks to Larry Fitzmaurice about his new horror-movie-themed project featuring former members of Dirty Projectors and Ponytail: \"Music feels so serious these days—we're trying to put a little more fun into things.\"\nsitename: Pitchfork\ndate: 2014-02-11\ncategories: ['features']\n---\nPhotos by Atiba Jefferson\nWhen I last spoke with Dave Portner, aka Avey Tare, he had just relocated from his longtime New York City home to live in Los Angeles before the release of Animal Collective's 2012 album Centipede Hz. \"I'll see how this goes,\" Portner told me then regarding the move; two years later, he's settled in nicely. He now speaks excitedly about having time to garden and cook at his Echo Park home, enthusiastically rattling off a list of his favorite hiking spots. When it comes to L.A.'s taxi cab infrastructure, though, he's not as chuffed. \"The taxi situation here is very scary and dangerous,\" he says with a nervous laugh. \"I never feel safe.\" (And no, he doesn't use Uber.)\nSince Animal Collective's extensive touring schedule in support of Centipede Hz came to a close, Portner's been up to more than just hiking and perilous cab rides: He's formed a new band, Avey Tare's Slasher Flicks, with ex-Dirty Projectors member Angel Deradoorian and former Ponytail drummer Jeremy Hyman. The group went on a brief tour last year, and now they're ready with their debut LP, Enter the Slasher House, out in April via Domino. The self-produced album was recorded by the band last year, fashioned out of guitar-based demos Portner had previously laid down to tape; although Deradoorian and Hyman's own musical signatures pop up here and there, the winding, squishy song structures and melodic phrasing are unmistakably Portner's.\n\"Any time you put too many restrictions on what you're doing, you stop experimenting,\" Portner says about his artistic aims with the new group. \"It's easier to make abstract stuff with Animal Collective because there's so many different minds working on one thing. With Slasher Flicks, I wanted to delve more into the idea of one mic in a room capturing this live energy. We tried to do that with the last Animal Collective record, but it didn't turn out that way.\" Portner's recent love for 1960s garage rock shines through in Enter the Slasher House's first single, \"Little Fang\", a swaggering gem that's one of the most straightforward songs Portner's put to tape outside of his work with Animal Collective.\nElsewhere, the record is more complex and strident—although Portner doesn't necessarily see it that way. \"Animal Collective's sound guy works with Slasher Flicks too, and on the last tour he said, 'It'll take me a couple shows to figure out what's happening here.' I was like, 'Really? It sounds so simple and minimal to me.' He was like, 'You guys always think everything is so simple and minimal, but it just sounds crazy.'\"\nEmotionally, Enter the Slasher House is a sharp left turn from his last solo effort, 2010's murky Down There, which was written while Portner was dealing with weighty personal issues, including a divorce from former múm member Kría Brekkan and his sister surviving cancer of the tear ducts. \"I was sick a lot last year, so writing these songs had a lot to do with me trying to have some positive vibrations and getting away from feeling dark,\" he says. \"I didn't want to dwell on that anymore. I wanted to find the medicine through music.\"\nAlong with a Slasher Flicks tour this spring, Portner is aiming to rejoin with Animal Collective and put out a new record \"some time next year,\" and is thinking about a proper solo follow-up to Down There consisting of unreleased material that he tested out on the road while touring behind that album. But, true to his new project's name, he's still making time for his beloved horror movies, including recent highlights Insidious and The Conjuring. \"I've always liked the campier, more fun side of horror, like those cheesy haunted house rides at fairs where there's sloppy effects and rubber figures jumping out at you. It's clearly meant for kids, but there's something endearing and cool about it.\"\nPitchfork: Apart from 1960s garage rock, are there any other types of music you had in mind when writing this Slasher Flicks album?\nDave Portner: The idea of the novelty pop song—like \"Monster Mash\" or \"They're Coming to Take Me Away, Ha-Haaa!\"—doesn't really pop up a lot anymore in music, but those songs have a fun, weird, pop-horror element to them. I wanted to make modern takes on that type of song.\nPitchfork: What's the difference between working with Animal Collective and working as a part of this new band?\nDP: Animal Collective have a communal way of working together that we've all grown to understand. It's a comfort zone, so playing music with other musicians is immediately stepping out of that comfort zone. You have to be open. Animal Collective put a lot of time into recording—we spend very long days in the studio, which has to do with the fact that we're not really around each other a lot, so when are we really work. I don't think Angel and Jeremy come from that side of things.\nI love it in the studio—I could spend ten hours mixing, easy. Other people are always like, \"Man, we have to take a break.\" I'm always like, \"Really?\" Jeremy, Angel, and I found a meeting ground in between those two mindsets, which feels really good. It's been good for me to have some time off lately, too, because it's hard to keep sinking yourself into one record after another. That's not really what I want to be doing with my life right now.\nEnter the Slasher House cover:\nPitchfork: Animal Collective's early performances were more impressionistic, but on the Centipede Hz tour, the approach felt more professional.\nDP: Right before Centipede Hz came out, we made a conscious decision to put more old songs into our set. We have such a wide catalog that we can play around with at this point, and it's music that people like to hear. That decision has to do with how many people come to see us now, and what they are coming to see. In the past, I didn't think about being an entertainer so much. It was maybe a little bit more selfish of an approach, but I don't feel bad about it.\nIn the beginning, it was about what we could do to catch people's attention and draw them in. We wanted to cause a reaction and make people feel like they were seeing something new. We built up a community of people that understand Animal Collective. We're these close friends getting up on stage performing this really private ritual that people either can or cannot relate to, but it was our thing and it truly felt like it was coming from us. Now, we play for almost two hours every night, so playing the way we used to is just not possible. But it's still fun for us. Some of the shows we've played over the past year are our all-time favorites. We record all of them, so to listen back be like, \"Man, we really nailed that,\" is nice. Before, it was more about the energy that went into the songs, but now it's more about how we wrote \"My Girls\", and that's a great song, and now we can home in on it and make it awesome live.",
      "author": "Larry Fitzmaurice",
      "published_date": "2014-02-11",
      "word_count": 1266,
      "fetch_timestamp": "2025-08-20T08:25:31.521291",
      "metadata": {
        "char_count": 7338,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:25:31.521286"
      }
    },
    {
      "url": "https://pitchfork.com/features/",
      "source": "pitchfork",
      "artist_name": "Slash",
      "title": "Music Articles & Features",
      "content": "---\ntitle: Music Articles & Features\nauthor: Condé Nast\nurl: https://pitchfork.com/features/\nhostname: pitchfork.com\ndescription: Longform and in-depth analysis about the most exciting and important music being released today\nsitename: Pitchfork\ndate: 2025-08-14\ntags: ['web']\n---\nDekmantel Is a Dance Festival Shedding Light on the Underground\nWe touched down in Amsterdam for the 2025 edition of the left-of-center electronic festival and came back with some thoughts about live sets, drum heads, speaker cabinets, bass fiends, techno lords, and the simple power of naming some club-ready bangers.\nBy Jeremy D. Larson\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nNight Out 2025: Pitchfork and Them’s Showcase for the Future of Queer Music\nBy Olivier LafontantPhotography by Dillon Edlin\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nWhat Happened at Pitchfork’s Bladee Zine Launch\nBy PitchforkPhotography by Caroline Friedman\nA Rare Interview With Bladee, the Mystic Oracle of Internet Rap\nBy Meaghan GarveyPhotography by Jason Nocito\nHighlights From Pitchfork’s 2024 Year in Music Club Night\nBy PitchforkPhotography by Sam Wachs\nHighlights From Pitchfork and Thought Enthusiast’s Year in Music Panel\nBy PitchforkPhotography by Sam Wachs\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 18 Best Moments From Pitchfork Music Festival 2024\nBy Boutayna Chokrane, Nina Corcoran, and Heven Haile\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nHow Waxahatchee Made the Album of Her (Second) Life\nBy Andy CushPhotography by Bobby Doherty\nChasing the Goblin With Mabe Fratti, the Guatemalan Cellist at the Heart of Mexico City’s Avant-Rock Scene\nBy Philip SherburnePhotography by Filip Preis",
      "author": "Condé Nast",
      "published_date": "2025-08-14",
      "word_count": 347,
      "fetch_timestamp": "2025-08-20T08:25:31.804524",
      "metadata": {
        "char_count": 2280,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:25:31.804518"
      }
    }
  ],
  "total_articles": 8,
  "total_words": 9136,
  "extracted_at": "2025-08-20T08:25:31.804944",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/19200-avey-tares-slasher-flicks-enter-the-slasher-house/",
    "https://pitchfork.com/reviews/tracks/15055-rustie-slasherr/",
    "https://pitchfork.com/features/interview/7800-the-hold-steady/",
    "https://pitchfork.com/reviews/albums/",
    "https://pitchfork.com/reviews/albums/demiyaa-lil-rae-my-world/",
    "https://pitchfork.com/features/podcast/",
    "https://pitchfork.com/features/update/9328-avey-tares-slasher-flicks/",
    "https://pitchfork.com/features/"
  ]
}