{
  "artist_name": "The Beatles",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/18752-the-beatles-on-air-live-at-the-bbc-vol-2/",
      "source": "pitchfork",
      "artist_name": "The Beatles",
      "title": "The Beatles: On Air - Live at the BBC Vol. 2",
      "content": "---\ntitle: The Beatles: On Air - Live at the BBC Vol. 2\nauthor: Stuart Berman\nurl: https://pitchfork.com/reviews/albums/18752-the-beatles-on-air-live-at-the-bbc-vol-2/\nhostname: pitchfork.com\ndescription: The BBC was where the Beatles could perform for an audience of millions without struggling to hear themselves sing over primitive concert-hall P.A.s, and where—via mailed-in requests—they could interact with their many admirers without worrying about being trampled by the mob. Like the preceding Live at the BBC, On Air - Live at the BBC Vol. 2 is a pleasure to behold.\nsitename: Pitchfork\ndate: 2013-11-14\n---\nThe Beatles mythos is a sum of historic locations: the Cavern Club, the Ed Sullivan soundstage, Shea Stadium, the Maharishi’s Indian retreat, the Apple Records rooftop. And yet there’s a place crucial to the band’s history that’s often left out of the narrative, probably because it doesn’t make for the most exciting Rock Band backdrop: BBC Radio studios. The lasting images of Beatlemania are ones of constant motion: of airplanes and tarmacs, of screaming teens chasing the band down the high street, of limousines that act as decoys for other limousines. But in the midst of all that hysteria, the Beatles managed to record 52 BBC radio programs over the course of 1962 to 1965, and though they were mostly born out of promotional obligations, the frequent shows allowed the band to engage with their fanatical fans from a safe distance. The BBC was where The Beatles could perform for an audience of millions without struggling to hear themselves sing over primitive concert-hall P.A.s, and where—via mailed-in requests—they could interact with their many admirers without worrying about being trampled by the mob.\nThis much was evident on 1994’s Live at the BBC compilation, which functioned as a hermetically sealed time capsule of the Fab Four at their most innocent and fun-loving. The only evidence of the intense pressure the band were under at the time could be gleaned from the tracklist—with demand for new Beatles recordings far outstripping supply, the band’s BBC playlists were stacked with as many Reeperbahn-tested covers as Lennon-McCartney originals. Vol. 2 offers a similarly proportioned mix, with the now-familiar variations in fidelity that go with it. And it actually works within an even tighter timeframe than its predecessor, which reached far enough into ’65 to feature the proto-psychedelic jangle of “Ticket to Ride.” Vol. 2, by contrast, sticks to 1963-64; the tracklist reaches as far as Beatles for Sale cuts “I’ll Follow the Sun” and “Kansas City/Hey-Hey-Hey!” but stops short of showcasing the more reflective, emotionally invested songcraft that would define that album, and the Beatles catalogue from that point forward.\nLike most sequels, the new compilation presents a case of diminishing returns: where the first BBC collection yielded 30 songs that never surfaced on any of the Beatles’ proper albums, the new set features but two (in the form of Chuck Berry and Tony Orlando covers) and about one third of the tracklist overlaps with the first set (albeit with the recurring tracks pulled from different sessions). But, approached on its own terms, Vol. 2 is still a pleasure to behold. While it’s designed to evoke a bygone era when congregating around the living-room radio was British-household ritual, the grab-bag sequencing and strategically stitched between-song banter lend the collection a frenetic, cut-and-paste momentum that’s remarkably attuned to modern listening habits.",
      "author": "Stuart Berman",
      "published_date": "2013-11-14",
      "word_count": 553,
      "fetch_timestamp": "2025-08-20T07:39:49.532991",
      "metadata": {
        "char_count": 3546,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:39:49.532963"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/13432-the-beatles/",
      "source": "pitchfork",
      "artist_name": "The Beatles",
      "title": "The Beatles: The Beatles",
      "content": "---\ntitle: The Beatles: The Beatles\nauthor: Mark Richardson\nurl: https://pitchfork.com/reviews/albums/13432-the-beatles/\nhostname: pitchfork.com\ndescription: Indulgent, sprawling, overflowing with ideas and excess, the White Album became not only a monument to unbridled creativity but a rock archetype.\nsitename: Pitchfork\ndate: 2009-09-10\n---\nIn his review of the Beatles' 1963 LP debut, Please Please Me, Tom Ewing pointed out that whether or not you consider them to be the best band of the rock'n'roll era, they certainly have the quintessential pop band story. Everything they did is deeply embedded in rock's DNA, and the band's offhand and ad-hoc gestures have long been established parts of pop music mythology. And of the Beatles' albums, none-- not even Sgt. Pepper's Lonely Hearts Club Band-- rivals The Beatles as a rock archetype. The phrase, \"It's like their White Album\"-- applied to records like Prince's Sign o' the Times, Hüsker Dü's Zen Arcade, the Clash's Sandinista!, and Pavement's Wowee Zowee, among many others-- has long been accepted critical shorthand. To use the expression is to conjure a familiar cluster of associations: The work in question is large and sprawling, overflowing with ideas but also with indulgences, and filled with a hugely variable array of material, some of which might sound great one day and silly the next. A band's White Album is also most likely assembled under a time of great stress, often resulting in an artistic peak but one that nonetheless scatters clues to its creator's eventual demise.\nThe Beatles, the band's complex and wide-ranging double album from 1968, is all of these things. It's a glorious and flawed mess, and its failings are as essential to its character as its triumphs. People love this album not because every song is a masterpiece, but because even the throwaways have their place. Even so, for the Beatles, being all over the place was a sign of trouble. The disintegration of the group as one \"thing\" is reflected in every aspect of the record, from its recording history (John Lennon, Paul McCartney, and George Harrison sometimes worked in separate studios on their own songs) to its production (generally spare and tending to shapeshift from one song to the next) to the arrangements of the songs (which tend to emphasize the solo voice above all). Visual changes were also apparent. Until The Beatles, the group's album artwork tended to depict the band as a unit: same haircuts, same jackets, same costumes, same artist's rendering. But The Beatles was packaged with separate individual color photos of John, Paul, George and Ringo, and they now appear almost forebodingly distinct. All of a sudden, the Beatles neither looked nor sounded like a monolith. So soon after Pepper and the death of manager Brian Epstein in 1967, the writing was on the wall.",
      "author": "Mark Richardson",
      "published_date": "2009-09-10",
      "word_count": 461,
      "fetch_timestamp": "2025-08-20T07:39:49.571511",
      "metadata": {
        "char_count": 2842,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:39:49.571506"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/13429-yellow-submarine/",
      "source": "pitchfork",
      "artist_name": "The Beatles",
      "title": "The Beatles: Yellow Submarine",
      "content": "---\ntitle: The Beatles: Yellow Submarine\nauthor: Mark Richardson\nurl: https://pitchfork.com/reviews/albums/13429-yellow-submarine/\nhostname: pitchfork.com\ndescription: The only minor album in the Beatles' catalogue is this soundtrack to a feature-length cartoon, a project with which the Beatles had little involvement.\nsitename: Pitchfork\ndate: 2009-09-10\n---\nHey, nobody's perfect. The only truly minor album in the Beatles' catalogue isn't really an album at all. Yellow Submarine, released in January 1969, is the soundtrack to the feature-length cartoon of the same name, a project with which the Beatles had little involvement. The idea of an animated film stretched back to 1965, but these were busy years for the band, and the project was pushed to the backburner. Once the movie finally got underway in 1967, the Beatles had no real interest in the details.\nIn one sense, the Yellow Submarine project is the opposite of Magical Mystery Tour. While the latter film was derided as pretentious and incoherent, the Yellow Submarine feature was well-received. And while the record releases associated with Magical Mystery Tour are of staggeringly high quality, the Yellow Submarine soundtrack is like the work of a supremely talented band that couldn't really be bothered. Brian Epstein had died in August, and with him gone, there was little motivation for the Beatles to participate in any meaningful way. So actors mimicked their voices, their input into the story consisted of a meeting or two with the filmmakers, and when it came time to assemble the soundtrack, they combed through the vault to see what was left over.\nOf the six tracks by the Beatles on the album's first side, two, \"Yellow Submarine\" and \"All You Need Is Love\", are already familiar from their original contexts (as part of Revolver and as a single, respectively). The other four were holdovers from sessions in 1967 (Paul McCartney's \"All Together Now\", George Harrison's \"It's All Too Much\" and \"It's Only a Northern Song\") and 1968 (John Lennon's \"Hey Bulldog\"). They never found release during the time they were recorded because, well, they weren't good enough. Granted, we're talking about a time when the Beatles were making some of the finest pop albums of all time, so the question of what constitutes \"good enough\" is relative. But even setting aside their exceedingly high standards, this lot is pretty middling, if certainly still enjoyable.\nNeither of Harrison's songs ranks with his best. \"Only a Northern Song\" and \"It's All Too Much\" are filled with swirling psychedelic production-- tooting horns, backward instruments, shimmering percussion-- but beneath the din there's not much else interesting going on. \"Only a Northern Song\" at least has a good joke going for it, simultaneously alluding to the North of England and the Beatles' Lennon-McCartney-dominated publishing company (i.e., no matter what Harrison wrote for this particular number, it belonged to Northern Songs, Ltd.). But \"It's All Too Much\" stretches on for an endless six and a half minutes, the constipated production in fruitless search of a tune. For McCartney's part, \"All Together Now\" is a cheery and pleasant sing-along befitting an animated soundtrack, and Lennon's \"Hey Bulldog\" is a tough and funky piano-driven rocker, by a good margin the best song here. They might be second-rate Beatles songs, but still.",
      "author": "Mark Richardson",
      "published_date": "2009-09-10",
      "word_count": 536,
      "fetch_timestamp": "2025-08-20T07:39:49.609186",
      "metadata": {
        "char_count": 3383,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:39:49.609180"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/13425-stereo-box-in-mono/",
      "source": "pitchfork",
      "artist_name": "The Beatles",
      "title": "The Beatles: Stereo Box / In Mono",
      "content": "---\ntitle: The Beatles: Stereo Box / In Mono\nauthor: Mark Richardson\nurl: https://pitchfork.com/reviews/albums/13425-stereo-box-in-mono/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2009-09-07\n---\nIn 1987, the Beatles' albums appeared on compact disc for the first time. Considering how much music had already found its way to CD, the Beatles were very late, so the digital rollout was a big deal. The new issues came out in batches and the excitement steadily built, peaking when Sgt. Pepper's Lonely Hearts Club Band came out on June 1, 1987, the 20th anniversary of its original release (\"It was 20 years ago today...\" was perhaps the greatest record marketing hook of all time.) In the 22 years since, plenty of bands have had their catalogues reissued a few times over (some with ridiculous frequency-- looking at you, Bowie and Costello), either to take advantage of improvements in technology or to repackage the records to sell them again to existing fans. But those 1987 CD versions have been it as far as the original Beatles albums. They've done some special projects-- Let It Be...Naked, two volumes of The Capitol Albums, collecting American versions of their records, the remix album Love-- but if, two months ago, you wanted to buy a copy of A Hard Day's Night, you'd be getting the 1987 remaster, done with 1987 technology, complete with a flimsy, bare-bones CD insert in a jewel case.\nThis week, Capitol/EMI rectifies the situation. The entire Beatles catalogue has been remastered and the CDs are coming out in new editions. It is perhaps ironic that this is happening as interest in the compact disc format is on the wane, but once again Beatles fans are excited. Are they worth buying again? Over the next three days, we're going to be reviewing all of the Beatles reissues, including the Beatles Rock Band game also coming out this week. But in addition to discussing the music and the records, we wanted to take a moment here to lay out some general thoughts on the sets, with further details relegated to the proper reviews.\nFirst, the configurations. All 12 original albums, from Please Please Me to Let It Be, have been remastered and are being issued in stereo (these are the same tracklistings as have been on CD since the 80s, including the American version of Magical Mystery Tour). In addition, the two Past Masters CDs, which collect singles and tracks that didn't appear on the original albums, have been combined into one 2xCD set. The first four albums are appearing in stereo on CD for the first time. The packaging for all stereo CDs includes the original artwork and liner notes, along with new recording notes and a historical essay. Rather than jewel boxes, the stereo CDs are packaged in sharp-looking and durable foldout cardboard packaging. Each CD contains a short documentary in QuickTime format on the making of the album (these are said to be limited to this initial reissue).",
      "author": "Mark Richardson",
      "published_date": "2009-09-07",
      "word_count": 491,
      "fetch_timestamp": "2025-08-20T07:39:49.664700",
      "metadata": {
        "char_count": 2927,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:39:49.664693"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/paul-mccartney-wings-band-on-the-run/",
      "source": "pitchfork",
      "artist_name": "The Beatles",
      "title": "Paul McCartney / Wings: Band on the Run (50th Anniversary Edition)",
      "content": "---\ntitle: Paul McCartney / Wings: Band on the Run (50th Anniversary Edition)\nauthor: Stephen Thomas Erlewine\nurl: https://pitchfork.com/reviews/albums/paul-mccartney-wings-band-on-the-run/\nhostname: pitchfork.com\ndescription: Read Stephen Thomas Erlewine’s review of the album.\nsitename: Pitchfork\ndate: 2024-02-08\n---\nBand on the Run turned 50 at the end of last year, and a new expanded edition—its fourth—celebrates the anniversary. As the proliferation of reissues over the years suggests, it’s Paul McCartney’s most consequential post-Beatles record, if not necessarily his best: the album that revived his critical fortunes and established him as a powerhouse outside his former band.\nMcCartney’s career was hardly languishing when Band on the Run appeared at the end of 1973. Earlier that year, Red Rose Speedway became his second album to reach No. 1 in the U.S., with the dreamy ballad “My Love” topping the Billboard charts and his James Bond theme “Live and Let Die” coming close. Yet his critical reputation was at a nadir, lacking the countercultural cachet of either John Lennon or George Harrison, ex-bandmates whose early-’70s successes hit the sweet spot where the underground and mainstream met. Cast as the primary culprit in the Beatles’ demise, McCartney was portrayed as a careerist control freak who specialized in featherweight pop.\nBut following the Fab Four’s breakup, McCartney hardly had a master plan. Newly married to the former Linda Eastman, he moved to a farm in Scotland and then revived an idea he had for the Beatles in their waning days: to get back out and play rock’n’roll as part of a group. As he recently told Mojo, he realized his path forward was “to get a band that isn’t massively famous, to not worry if we don’t know what we’re doing because we would form our character by learning along the way.”\nAn essential part of that fledgling band was Linda McCartney, who previously hadn’t played music. Paul recalled, “I wasn’t motivated by having a fabulous group. I was motivated by not wanting to leave my wife behind. We had only just married. What was I going to do, run off on the road? The Beatles weren’t very good when they started out either.” He had the pick of prime studio players, recruiting New York drummer Denny Seiwell after he played on Ram, the 1971 album credited to Paul and Linda McCartney, but he found his true lieutenant in Denny Laine, a guitarist who sang lead on the Moody Blues’ breakthrough hit, “Go Now,” in 1964 but spent the subsequent decade struggling to maintain a living as a working musician.\nLaine shared a history with McCartney and also recognized his subordinate role. He later said, “Let’s be honest—[McCartney] wanted to be in a band in a sense, but he would still have the final call.” McCartney overshadowed the rest of Wings to the extent that their records were essentially treated as Paul’s creation: Jon Landau’s Rolling Stone rave of Band on the Run didn’t mention Denny Laine’s name once.",
      "author": "Stephen Thomas Erlewine",
      "published_date": "2024-02-08",
      "word_count": 491,
      "fetch_timestamp": "2025-08-20T07:39:49.707330",
      "metadata": {
        "char_count": 2983,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:39:49.707325"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/",
      "source": "pitchfork",
      "artist_name": "The Beatles",
      "title": "The Pitchfork Review: All of the Latest Episodes",
      "content": "---\ntitle: The Pitchfork Review: All of the Latest Episodes\nauthor: Condé Nast\nurl: https://pitchfork.com/podcast/the-pitchfork-review/\nhostname: pitchfork.com\ndescription: Listen to every episode of Pitchfork’s podcast for music fans and obsessives.\nsitename: Pitchfork\ndate: 2024-01-11\ntags: ['web']\n---\nBrought to you by the music critics at Pitchfork, The Pitchfork Review is a show for music fans and obsessives who can’t wait to talk about the latest releases. Co-hosted by Pitchfork editor-in-chief Puja Patel and Reviews Editor Jeremy D. Larson, this podcast pulls back the curtain on our reviews and scores, dives deep into new music, and gives an expert guide to what’s exciting, what’s great, and what’s just plain terrible.\nListen to every episode of Pitchfork’s podcast for music fans and obsessives.\nRelated Articles\nThe Origins and Influence of Brian Eno’s Pioneering Album Ambient 1: Music for Airports\nIn the latest episode of Pitchfork’s podcast, our critics revisit the legendary producer’s classic 1978 LP, which was recently featured in our Sunday Review series.\nBy Pitchfork\nJeff Tweedy on Rock Criticism, the Pitfalls of Music Snobbery, and His New Book\nThe musician and author discusses World Within a Song, in which he writes about 50 songs that rearranged his brain, Wilco’s new album, and more.\nBy Pitchfork\nThe 2023 Music Grab Bag: Trends, Scandals, and Theories\nIn this episode of the Pitchfork Review podcast, our critics talk about the rise of the musical theater girlie, the fall of the 1975’s Matty Healy, and more. Plus: Alvvays’ Molly Rankin reveals the song she wishes she wrote.\nBy Pitchfork\nThe Best, Worst, and Most Surprising Albums of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about some of their faves from our 50 Best Albums of 2023 list and lament a few of the year’s biggest disappointments.\nBy Pitchfork\nWhy the Replacements’ Tim Is the Best Reissue of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about the revelatory new version of the beloved rock band’s 1985 LP. Plus, Replacements bassist Tommy Stinson reveals his perfect-10 album.\nBy Pitchfork\nBreaking Down Bad Bunny’s New Album and the Future of Puerto Rican Rap and Reggaeton\nIn this episode of The Pitchfork Review podcast, our critics dissect Bad Bunny’s latest and highlight a few new queer artists from Puerto Rico who are taking the island’s music to exciting new places.\nBy Pitchfork\nDebating the Best Songs of 2023, Part Two\nIn this episode of the Pitchfork Review podcast, our critics battle it out over some of their favorite songs of the year, by artists including Troye Sivan, Kendrick Lamar, Big Thief and more. Plus: Devendra Banhart tells us all about his dream collaboration.\nBy Pitchfork\nDebating the Best Songs of 2023, Part One\nIn this episode of the Pitchfork Review podcast, our critics take sides and discuss which tracks by some of 2023’s most exciting artists deserve a spot on our upcoming year-end lists.\nBy Pitchfork\nThe Good, the Bad, and the Swiftie of Taylor’s Eras Tour Concert Film\nIn this episode of The Pitchfork Review podcast, our critics wade through the ups and downs of the pop superstar’s new record-breaking live movie.\nBy Pitchfork\nWhat Drake Is Doing Wrong—and How He Can Fix It\nIn this episode of the Pitchfork Review podcast, our critics talk about what made them care about Drake in the first place, why his new album For All the Dogs is so frustratingly mid, and what he should do next.\nBy Pitchfork",
      "author": "Condé Nast",
      "published_date": "2024-01-11",
      "word_count": 579,
      "fetch_timestamp": "2025-08-20T07:39:49.759905",
      "metadata": {
        "char_count": 3506,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:39:49.759900"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/the-peacers-blexxed-rec/",
      "source": "pitchfork",
      "artist_name": "The Beatles",
      "title": "The Peacers: Blexxed Rec",
      "content": "---\ntitle: The Peacers: Blexxed Rec\nauthor: Brian Coney\nurl: https://pitchfork.com/reviews/albums/the-peacers-blexxed-rec/\nhostname: pitchfork.com\ndescription: Read Brian Coney's review of the album.\nsitename: Pitchfork\ndate: 2021-03-30\n---\nHyde Street Studios has been canceling out the din of its eponymous San Francisco block for six decades now. As Wally Heider Studios in the late 1960s and early 1970s, it freeze-framed the boundless spirit of the Bay Area—and the counterculture more broadly—in records by Jefferson Airplane and the Grateful Dead. A half-century on, in a dank, unassuming space next door, Mike Donovan’s lo-fi marauders the Peacers help to carry the mantle for savvy psychedelia.\nRecorded between 2017 and 2020 at Hyde Street, another space across the way, and in Hudson, New York, their third album, Blexxed Rec, mines scrappy pop majesty from a relatively modest setup. Reuniting Donovan with Bo Moore, Shayde Sartin, and Mike Shoun—returning from 2017’s Introducing the Crimsmen—joint action proves key here. Splitting songwriting duties so that each member reveals a hue of their full-spectrum sound, the band earns its loose supergroup stripes. In sound and synergy, the example of the Beatles circa Revolver looms large. It’s a big shadow to fill out, but they wear it well.\nLike many of their peers, including Donovan’s previous outfit, Sic Alps, the Peacers have generally sat in the overlap of two compatible worlds: folksy garage and fantastical psych. Here these often thread as one. A shifting, glam-tinged gem, “Dickdog in Paris” is an exercise in changing gears. Flipping full-blown swagger to skeletal Mellotron and tape echo, it neatly captures the band’s wily curveballs. Elsewhere, the acoustic-driven “Stinson Teep” is a peak. “All the living, faceless actors/You can have your Grammy now,” Donovan drawls. It’s languid, kind of out of it—a dosed tale that equally conjures White Fence and G N’ R Lies, if the latter had a Drag City catalog number.\nIn a recent video, a masked-up Bo Moore and Mike Shoun gave a guided tour of their space on Hyde Street. They geek out over mics, snare drums, and other equipment. But it’s their trusty ¼\" 8-track recorder, the Tascam 388, that commands the most reverence. The versatile, affordable machine has gained a cult-like following among artists in the Bay Area and beyond (John Dwyer’s Castle Face have regularly used it to capture shows in the garage and psych community). It isn’t the vintage desk next door, and it’s far from Studio Two at Abbey Road, but with it, the Peacers get dynamic range while retaining that all-important analog touch. This Goldilocks ideal has a point: The band are, in their own thrifty way, gearheads but not precious. Blexxed Rec captures that important distinction. Crowning it all is the way each instrument is fixed in space, neither lost nor squashed in the mix. Dozy to the point of almost veering off the road, the Syd Barrett-like slouch of “Irish Suit” exhausts the full range of their beloved recording console.",
      "author": "Brian Coney",
      "published_date": "2021-03-30",
      "word_count": 488,
      "fetch_timestamp": "2025-08-20T07:39:49.792064",
      "metadata": {
        "char_count": 3037,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:39:49.792059"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/the-flaming-lips-american-head/",
      "source": "pitchfork",
      "artist_name": "The Beatles",
      "title": "The Flaming Lips: American Head",
      "content": "---\ntitle: The Flaming Lips: American Head\nauthor: Stuart Berman\nurl: https://pitchfork.com/reviews/albums/the-flaming-lips-american-head/\nhostname: pitchfork.com\ndescription: At the top of their fifth decade, the Lips rekindle their past romance with Neil Young’s piano ballads, the Beatles’ psychedelic guitar tones, and Bowie’s stargazing anthems on a deeply personal album.\nsitename: Pitchfork\ndate: 2020-09-11\n---\nThirty years ago this month, the Flaming Lips released their first game-changing album: 1990’s In a Priest Driven Ambulance. After spending the ‘80s trying to figure out if they wanted to be a prog Replacements or a punk Floyd, the Lips outfitted Priest with an interstellar noise-pop sound that nonetheless retained a distinctly Oklahoman flavor, complete with fairground noises, field recordings of crickets, and strange songs about Jesus. In a Priest Driven Ambulance was also the first installment in what would become a Lips tradition: releasing pace-setting albums at each turn of the decade. Nine years later, their orchestral opus The Soft Bulletin ushered in the band’s imperial phase, while 2009’s Embryonic portended an extended period of wild, anti-pop experimentation. The band’s first album of the 2020s likewise marks another significant change in course; in this case, however, it feels less like the start of a new journey than a homecoming.\nIn sharp contrast to the Lips’ recent adventures in fairytale fantasias, American Head finds its inspiration in an arcane piece of Oklahoma musical lore. After revisiting the Tom Petty documentary Runnin’ Down A Dream following the rock legend’s 2017 death, Lips ringleader Wayne Coyne became fixated with the story of Petty’s pre-Heartbreakers band, Mudcrutch, with whom Petty spent time in Tulsa in the early-’70s en route to L.A. From that anecdote, Coyne and multi-instrumentalist Steven Drozd envisioned American Head as a work of speculative fiction, reimagining the Lips as the sort of drugged-out local Oklahoman rock band that might’ve hung out and jammed with a pre-fame Petty while he was passing through town.\nAs it turns out, that mythical ‘70s scenario is really just a roundabout way of getting the Lips back to where they were in the ‘90s. American Head retains some of the symphonic sweep of the Soft Bulletin era and the freaky futurism of their post-Embryonic state, but, at its core, we find the band rekindling their past romance with Neil Young’s piano ballads, the Beatles’ psychedelic guitar tones, and Bowie’s stargazing anthems. Likewise, Coyne approaches his favorite topics—love, drugs, and death—from a less existential, more personal vantage, grounding his narratives in more naturalistic settings. Instead of tunes about killer robots and unicorns with purple eyes, we get songs about people working in slaughterhouses and slinging coke on the side to get by, fond teenage memories of taking quaaludes and frightening recollections of trying LSD, and dramatizations of actual traumatic incidents from Coyne’s early years.",
      "author": "Stuart Berman",
      "published_date": "2020-09-11",
      "word_count": 461,
      "fetch_timestamp": "2025-08-20T07:39:49.833897",
      "metadata": {
        "char_count": 3030,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:39:49.833891"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/declan-mckenna-zeros/",
      "source": "pitchfork",
      "artist_name": "The Beatles",
      "title": "Declan McKenna: Zeros",
      "content": "---\ntitle: Declan McKenna: Zeros\nauthor: Peyton Thomas\nurl: https://pitchfork.com/reviews/albums/declan-mckenna-zeros/\nhostname: pitchfork.com\ndescription: Nodding to Bowie and the Beatles on songs about climate change and capitalism, the 21-year-old songwriter roots his political critique in the rich tradition of British protest rock.\nsitename: Pitchfork\ndate: 2020-09-09\n---\n“What do you think about the rocket I built?” howls Declan McKenna on the first track of Zeros. It’s a cheeky nod at the gap between his uneven 2017 debut album, What Do You Think About the Car?, and this one: not a natural progression, but a staggering improvement. McKenna, a 21-year-old British singer-songwriter once hailed as a teen prodigy, has shed his boy-wonder baby fat. Zeros is an ambitious attempt at his own Tommy, a sprawling concept album about scrappy survivors spiraling through space and searching for meaning at the end of the world. Its characters war with one another across a musical palette that spans Sgt. Pepper to “Space Oddity.”\nThe record’s standout track, “Daniel, You’re Still a Child,” is its Rosetta Stone—not to mention the best U2 song in about 15 years. The character of Daniel recurs throughout the album, but McKenna leaves his role ambiguous, a narrative Rorschach test. He seems to me a boozing absentee father, but he could also be a lousy boyfriend or a troublemaking prodigal son. The video for “The Key to Life on Earth” suggests a spookier storyline: Daniel as sinister doppelganger, played by actor Alex Lawther, invading McKenna’s home and eating his food before bludgeoning him to death.\nThe video could easily double as an episode of Black Mirror; fans will recognize Lawther as the blackmailed sex criminal of Season 3’s “Shut Up and Dance.” But McKenna relegates science fiction to the album’s opening tracks. The elaborate musical nods to Bowie and the Beatles on “You Better Believe!!!” and “Be an Astronaut” place space exploration squarely in the 1960s, when it was still a democratic pursuit, not a hobby for union-busting billionaires. “You were born to be an astronaut,” McKenna sings of Daniel, “and you’ll do it or die trying.” Daniel settles, sadly, for the latter. The Space Age comes to an end. A chilly Bono-in-Berlin vibe sweeps through the album as Daniel degenerates, giving way to Blurry Britrock as modern forms of villainy—online radicalization (“Twice Your Size”), climate change (“Sagittarius A*”), surveillance capitalism (“Beautiful Faces”)—rear their ugly heads.\nThis approach occasionally makes the album feel like a collage of 40 years’ worth of MOJO covers. But McKenna isn’t in the business of imitation or idolatry. He deploys these references carefully, in chronological order, drawing a clean arc through history to root his own political critique in the rich tradition of British protest rock. Take “Rapture,” where, with absolute confidence, he mispronounces “the laws of nature” to force a rhyme with “Mrs. Thatcher.” At first, it may seem a bit retrograde—a Margaret Thatcher takedown in 2020? But the song makes an elegant argument: The witch isn’t dead at all, but risen again; the stench of her corpse lingers in modern Britain. There is a straight line from the Sex Pistols’ grievances to McKenna’s own.",
      "author": "Peyton Thomas",
      "published_date": "2020-09-09",
      "word_count": 520,
      "fetch_timestamp": "2025-08-20T07:39:49.867227",
      "metadata": {
        "char_count": 3272,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:39:49.867221"
      }
    },
    {
      "url": "https://pitchfork.com/features/",
      "source": "pitchfork",
      "artist_name": "The Beatles",
      "title": "Music Articles & Features",
      "content": "---\ntitle: Music Articles & Features\nauthor: Condé Nast\nurl: https://pitchfork.com/features/\nhostname: pitchfork.com\ndescription: Longform and in-depth analysis about the most exciting and important music being released today\nsitename: Pitchfork\ndate: 2025-08-14\ntags: ['web']\n---\nDekmantel Is a Dance Festival Shedding Light on the Underground\nWe touched down in Amsterdam for the 2025 edition of the left-of-center electronic festival and came back with some thoughts about live sets, drum heads, speaker cabinets, bass fiends, techno lords, and the simple power of naming some club-ready bangers.\nBy Jeremy D. Larson\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nNight Out 2025: Pitchfork and Them’s Showcase for the Future of Queer Music\nBy Olivier LafontantPhotography by Dillon Edlin\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nWhat Happened at Pitchfork’s Bladee Zine Launch\nBy PitchforkPhotography by Caroline Friedman\nA Rare Interview With Bladee, the Mystic Oracle of Internet Rap\nBy Meaghan GarveyPhotography by Jason Nocito\nHighlights From Pitchfork’s 2024 Year in Music Club Night\nBy PitchforkPhotography by Sam Wachs\nHighlights From Pitchfork and Thought Enthusiast’s Year in Music Panel\nBy PitchforkPhotography by Sam Wachs\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 18 Best Moments From Pitchfork Music Festival 2024\nBy Boutayna Chokrane, Nina Corcoran, and Heven Haile\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nHow Waxahatchee Made the Album of Her (Second) Life\nBy Andy CushPhotography by Bobby Doherty\nChasing the Goblin With Mabe Fratti, the Guatemalan Cellist at the Heart of Mexico City’s Avant-Rock Scene\nBy Philip SherburnePhotography by Filip Preis",
      "author": "Condé Nast",
      "published_date": "2025-08-14",
      "word_count": 347,
      "fetch_timestamp": "2025-08-20T07:39:50.148342",
      "metadata": {
        "char_count": 2280,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:39:50.148333"
      }
    }
  ],
  "total_articles": 10,
  "total_words": 4927,
  "extracted_at": "2025-08-20T07:39:50.148749",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/18752-the-beatles-on-air-live-at-the-bbc-vol-2/",
    "https://pitchfork.com/reviews/albums/13432-the-beatles/",
    "https://pitchfork.com/reviews/albums/13429-yellow-submarine/",
    "https://pitchfork.com/reviews/albums/13425-stereo-box-in-mono/",
    "https://pitchfork.com/reviews/albums/paul-mccartney-wings-band-on-the-run/",
    "https://pitchfork.com/features/podcast/",
    "https://pitchfork.com/reviews/albums/the-peacers-blexxed-rec/",
    "https://pitchfork.com/reviews/albums/the-flaming-lips-american-head/",
    "https://pitchfork.com/reviews/albums/declan-mckenna-zeros/",
    "https://pitchfork.com/features/"
  ]
}