{
  "artist_name": "Tina Turner",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/music/rock/bryan-adams-tina-turner-lesson-tour-interview-1235953231/",
      "source": "billboard",
      "artist_name": "Tina Turner",
      "title": "Bryan Adams Reveals The Best Lesson He Learned from Tina Turner",
      "content": "---\ntitle: Bryan Adams Reveals The Best Lesson He Learned from Tina Turner\nauthor: Melinda Newman\nurl: https://www.billboard.com/music/rock/bryan-adams-tina-turner-lesson-tour-interview-1235953231/\nhostname: billboard.com\ndescription: Bryan Adams shares the best lesson he learned from Tina Turner ahead of his upcoming North American tour.\nsitename: Billboard\ndate: 2025-04-23\ncategories: ['Rock']\ntags: ['genre rock']\n---\nTo this day, Bryan Adams takes a lesson he learned from Tina Turner more than 40 years ago with him whenever the iconic Canadian rocker goes on tour. A few years before the two recorded their sexy, gritty Grammy-nominated duet “It’s Only Love” in 1984, he went to see the legend in Vancouver at a club as she was mounting her comeback.\nA 21-year-old Adams and songwriting partner Jim Vallance had written a song for Turner called “Lock Up Your Sons Because Tina’s in Town.” “Terrible,” he says, with a laugh. He convinced the bouncer to let him go backstage after the show and he saw a visibly ill, bundled up Turner. “I realized at that point she had the flu, and she had just put on this incredible show. I thought, ‘Wow! Nobody knew she was sick. She just went out there and gave everything she got.’ From that moment on, I never complained, ever, about being a little under the weather if I had to go on because I’ll just go out and do it. She’s at the forefront of my mind whenever that happens.”\nTrending on Billboard\nAdam will kick off an eight-week North American tour Sept. 11 in Kamloops, British Columbia at Sandman Centre. The ticket presale starts April 29 and general onsale begins May 2 at BryanAdams.com.\nThe outing, named the Roll with the Punches tour, has already kicked off internationally and Adams is calling as he’s headed to Reykjavik for a concert.\nThe So Happy It Hurts tour, named after his 2022 album, ended in Australia and New Zealand in February.\n“I don’t actually have a beginning or and end” to touring, Adams says. “It all sort of melds into one.”\nThe Roll with the Punches Tour takes its name from the forthcoming album Adams will release on his own label, Bad Records, later this year.\n“I’ve got my own sort of schedule and how we roll things out,” Adams says. The title track and another song are already available, and he expects to put out a few more songs before the album is released in August and pepper them into his shows.\nAdams started Bad Records a number of years ago as a home for his catalog, much of which has reverted back to him from Universal (which bought PolyGram, which had purchased his original label home, A&M).\nAll the mergers made Adams feel like “a chair in the lobby,” he says. “I could have probably rolled [my contract] over and kept it there. But there was something about being independent that I liked and, after much back and forth, finally I was free,” Adams says. “I’ve been signed to a label pretty much on and off since I was 16 years old, so the feeling of and the understanding of being able to be an independent artist is actually quite liberating.”\nAmong the projects he has released on his own label are two box sets from his 2022 and 2024 Royal Albert Hall residencies, as well as re-records of past albums. For Record Store Day earlier this month, his label put out a previously unreleased version of “It’s Only Love” featuring just his and Turner’s vocals and a keyboard. “It shows you the power of her voice like never before,” he says.\nAdams has found the hands-on aspect of running a label inspiring. “I even went to the record manufacturing company in Poland where we were putting things together,” he says. “It was a Sunday, and I just expected one person to be there to say hello and shake my hand. The entire company showed up because they don’t get artists saying hello, and it was just fascinating.”\nThe Royal Albert albums and videos show the superstar’s command over his audience, especially when he plays the opening chords of one of his many hits like “Summer of ’69,” and the crowd instantly goes wild. “You just hope the microphone’s working,” he jokes when a song gets such a rabid response. “That’s one of the great things about having so many songs. I look down my set list and I’m always pleased to know what the next song is. I know it’s gonna be fun to play,” he says. “It wasn’t like there was any plan. It was just every couple of years I would put out the best songs I’d written and occasionally, some of them stuck.”\nThe North American tour encompasses 39 dates, averaging around five shows a week. The longtime vegan jokes his stamina is “powered by lentils.” He adds: “I do the best I can. There’s nothing you can do if you get a cold or a flu. You just have got to soldier on,” as Turner taught him. (Adams speaks lovingly of the late Turner, for whom he produced her 1986 album, Break Every Rule and even sang at her wedding, saying his greatest memory of Turner is when he introduced her to his daughters. “It makes me a bit weepy thinking about it, to be honest, because she was just super, super kind to me. She loved the fact that I was having children.”)\nPlaying his native Canada is always special for Adams, “especially now that we’ve been sort of, I don’t know, skewered by your president,” he says of Donald Trump. “It’s really unified the country in a way. And so, it’s exciting.” Popular Canadian rock band The Sheepdogs will open the Canadian dates.\nPat Benatar and Neil Geraldo will open the U.S. leg. Surprisingly, Adams has never met the husband-and-wife duo but does have a connection that goes back more than 40 years when in 1981 he wrote a song called “Lonely Nights” for Benatar. “She didn’t do it, but it ended up being the first song off my second album that really opened the door for me in America,” the rocker says. “I may have to add that during the set because it’s kind of a good story to tell. I just really love her voice so it’s great that she’s gonna be out with us.”\nFrom the start of his career, Adams has focused on spanning the globe and in the ‘80s and ‘90s was one of the first Western artists to play in India, Pakistan, Vietnam and many of the former Eastern Bloc countries. After Reykjavik he will continue through Europe, ending in Helsinki, Finland in mid-August.\n“For me, it was just a wanderlust to be able to see the world,” he says of touring so widely in the early days. “You know, ‘Here’s an opportunity. I wonder if we can do a gig there.’ And when you start to investigate these places, you find out that, yes, there is a chance you could do it,” he says. “I recently inquired whether I could get to do a show in Iran, and, unfortunately, it’s still not the time to do that. I would love to be one of the people that could break down that sort of cultural boycott that’s happening. There are also parts of North Africa that I’d like to go to.”\nAdams, a well-regarded professional photographer who has released retrospectives of his photography and autographed notable figures including the late Queen Elizabeth, does not spend days off between gigs exploring with his camera. Instead, he is understandably “probably resting” or working,” he says. His days on the road “are really organized. There’s no randomness about it. I enjoy finding things and exploring, but usually if you’re in the middle of a tour, that’s the last thing you want to do. You want to rest because you’ve got work to do.”\nAdams, who has also written songs Kiss, Roger Daltrey, Motley Crue and Loverboy, in addition to his multiple hits, still owns his estimable publishing catalog even though his writing partner Vallance sold his to Round Hill in 2021. “I’ve been asked by loads of people [to sell]. I’m not interested,” he says. “Maybe somewhere in the future. It’s definitely not on my radar now.”\n‘ROLL WITH THE PUNCHES’ NORTH AMERICA TOUR DATES:\nThu Sep 11 – Kamloops, BC – Sandman Centre\nFri Sep 12 – Vancouver, BC – Rogers Arena\nSat Sep 13 – Victoria, BC – Save On Foods Memorial Centre\nTue Sep 23 – Prince George, BC – CN Centre\nWed Sep 24 – Kelowna, BC – Prospera Place\nFri Sep 26 – Calgary, AB – Scotiabank Saddledome\nSat Sep 27 – Edmonton, AB – Rogers Place\nSun Sep 28 – Regina, SK – Brandt Centre\nMon Sep 29 – Winnipeg, MB – Canada Life Centre\nThu Oct 2 – St. Catharines, ON – Meridian Centre\nFri Oct 3 – Toronto, ON – Scotiabank Arena\nSat Oct 4 – Ottawa, ON – Canadian Tire Centre\nTue Oct 7 – Peterborough, ON – Peterborough Memorial Centre\nWed Oct 8 – Montreal, QC – Bell Centre\nThu Oct 9 – Quebec City, QC – Videotron Centre\nSat Oct 11 – Moncton, NB – Avenir Centre\nSun Oct 12 – Halifax, NS – Scotiabank Centre\nWed Oct 15 – St. John’s, NL – Mary Brown’s Centre\nSat Oct 25 – Uncasville, CT – Mohegan Sun Arena^\nSun Oct 26 – Boston, MA – TD Garden^\nWed Oct 29 – Philadelphia, PA – Wells Fargo Center^\nThu Oct 30 – New York, NY – Madison Square Garden^\nSat Nov 1 – Cleveland, OH – Rocket Arena^\nSun Nov 2 – Pittsburgh, PA – PPG Paints Arena^\nMon Nov 3 – Rosemont, IL – Allstate Arena^\nWed Nov 5 – Raleigh, NC – Lenovo Center^\nThu Nov 6 – Duluth, GA – Gas South Arena^\nFri Nov 7 – Nashville, TN – Bridgestone Arena^\nSun Nov 9 – Hollywood, FL – Hard Rock Live^\nMon Nov 10 – Tampa, FL – Amalie Arena^\nThu Nov 13 – Dallas, TX – American Airlines Center^\nSat Nov 15 – Phoenix, AZ – PHX Arena^\nSun Nov 16 – San Diego, CA – Viejas Arena^\nTue Nov 18 – Los Angeles, CA – The Kia Forum^\nWed Nov 19 – San Jose, CA – SAP Center^\nFri Nov 21 – Seattle, WA – Climate Pledge Arena^\nSat Nov 22 – Portland, OR – Moda Center^\nMon Nov 24 – Denver, CO – Ball Arena^\nWed Nov 26 – Minneapolis, MN – Target Center^\n*With The Sheepdogs\n^With Pat Benatar & Neil Giraldo\n+With Amanda Marshall",
      "author": "Melinda Newman",
      "published_date": "2025-04-23",
      "word_count": 1779,
      "fetch_timestamp": "2025-08-20T16:29:09.779394",
      "metadata": {
        "char_count": 9635,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:29:09.779386"
      }
    },
    {
      "url": "https://www.billboard.com/music/rock/tina-turner-previously-unreleased-song-hot-for-you-baby-listen-1235881534/",
      "source": "billboard",
      "artist_name": "Tina Turner",
      "title": "Tina Turner Rocks Back on Previously Unreleased Song ‘Hot For You Baby’",
      "content": "---\ntitle: Tina Turner Rocks Back on Previously Unreleased Song ‘Hot For You Baby’\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/rock/tina-turner-previously-unreleased-song-hot-for-you-baby-listen-1235881534/\nhostname: billboard.com\ndescription: Tina Turner rocks out on previously unreleased song 'Hot For You Baby,' which will be featured on the 40th anniversary edition of 'Private Dancer.'\nsitename: Billboard\ndate: 2025-01-23\ncategories: ['Rock']\ntags: ['Music News, rock']\n---\nTina Turner famously left it all on the stage when she performed. The late rock icon also left behind some unheard songs from her career-defining 1984 Private Dancer album and now we can hear one of those tracks thanks to the release on Thursday (Jan. 23) of the previously unheard album outtake “Hot For You Baby.”\nThe uptempo rocker featuring Turner’s signature gritty, urgent vocals over a galloping beat and a chorus of male backing vocalists repeating the title phrase back to her will be included on the upcoming 40th anniversary edition of Turner’s fifth solo album, which was originally released in May 1984.\nThe collection helped push Turner back into the public consciousness thanks to a handful of now-iconic hit singles, including “Stay Together,” “What’ Love Got to Do With It,” “Better Be Good to Me” and the title track.\nTrending on Billboard\nSinging in her husky, growly voice, Turner belts, “The way that you’ve been moving to the music as you’re dancing/ Sweet sight to see/ But I can’t take it anymore, that’s why I’m out here on the floor/ So, won’t you dance with me?,” before the track rolls into the burning chorus: “I’m hot for you, baby/ I wanna love you/ I’m hot for you baby/ How hot can you get?”\nThe barreling chronicle of all the ways a lover’s dancing is getting her hot and bothered has a brief, classically early 1980s wailing guitar solo and plenty of cowbell. But despite fitting into the rock/soul groove Turner explored on the album, it was left off the final version. Australian singer John Paul Young (“Standing in the Rain”) originally released the song in 1979 to little notice. It was written by fellow Australian musicians George Young and Harry Vanda and produced by John Carter, who also produced the album’s title song.\nPrivate Dancer ran up to No. 3 on the Billboard 200 album chart and included the Hot 100 No. 1 smash “What’s Love Got to Do With It.” The previously unreleased song will be featured on the anniversary release due out on March 21, which will also come in a 5CD/Blu-Ray version that will rope in more never-before-released songs, live performances and music videos. Among the special extras is an upgraded 55-minute Private Dancer Tour show filmed in 1985 that featured guest spots from David Bowie and Bryan Adams.\nPrivate Dancer marked an only-in-Hollywood-style revival for Turner, who had set the world on fire in the 1960s and early 70s when she and then-husband Ike Turner released a series of career-defining hits including “River Deep, Mountain High,” their signature cover of CCR’s “Proud Mary” and “Nutbush City Limits,” among others.\nThe couple split in 1976, after what Tina Turner later said were years of physical abuse from Ike, leading to nearly a decade in the pop wilderness for Turner, who struggled to gain attention with her solo career as she played Las Vegas showrooms and released a series of solo albums to little notice.\nHer fortunes were turned around by Private Dancer, which leaned into Turner’s many strengths — vulnerability, power vocals, sensuality, grit — and earned her three Grammy Awards, including record of the year for the slow-burn ballad “What’s Love Got to Do With It”; the latter also served as the title of a lauded 1993 semi-autobiographical biopic that earned stars Angela Bassett and Laurence Fishburne Oscar nominations.\nAfter her tumultuous years with Ike, Turner found love again with German music exec Erwin Bach, who she married in 2013 after nearly 30 years together. After years out of the public eye, Turner died in her home in Switzerland at age 83 in May 2023.\nListen to “Hot For You Baby” below.",
      "author": "Gil Kaufman",
      "published_date": "2025-01-23",
      "word_count": 675,
      "fetch_timestamp": "2025-08-20T16:29:09.829693",
      "metadata": {
        "char_count": 4112,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:29:09.829687"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/americas-got-talent-pranysqa-mishra-tina-turner-1235724122/",
      "source": "billboard",
      "artist_name": "Tina Turner",
      "title": "Watch 9-Year-Old Belt Out a Tina Turner Classic on ‘America’s Got Talent’",
      "content": "---\ntitle: Watch 9-Year-Old Belt Out a Tina Turner Classic on ‘America’s Got Talent’\nauthor: Jessica Lynch\nurl: https://www.billboard.com/music/music-news/americas-got-talent-pranysqa-mishra-tina-turner-1235724122/\nhostname: billboard.com\ndescription: Pranysqa's powerful rendition of Tina Turner's \"River Deep, Mountain High\" left the judges and audience stunned.\nsitename: Billboard\ndate: 2024-07-03\ncategories: ['Music News']\ntags: ['AGT, America’s Got Talent, bbnews, Music News, News, tina turner']\n---\nTuesday’s episode (July 2) of America’s Got Talent introduced viewers to an incredible young talent — 9-year-old Pranysqa Mishra from Tampa, Fla.\nPranysqa’s powerful rendition of Tina Turner’s “River Deep, Mountain High” left the judges and audience wildly impressed, ultimately earning her the coveted Golden Buzzer from judge Heidi Klum.\nBefore her Season 19 audition, Pranysqa shared her lifelong passion for singing.\n“I always just love singing. It makes me feel happy. Even when I was four years old, I would pretend that I have a microphone, and I would sing like I’m singing to the whole world,” she enthused.\nTrending on Billboard\nPranysqa credited her grandmother as her main inspiration and the driving force behind her burgeoning career, along with her musical idols Tina Turner, Aretha Franklin, and Whitney Houston.\nDespite admitting to some nerves, particularly about performing in front of the notoriously tough Simon Cowell, Pranysqa’s confidence shone through the moment she began singing with a commanding voice that belied her youth.\nThe judges were visibly stunned, exchanging looks of disbelief as her powerful vocals filled the auditorium.\n“Oh my gosh, I did not expect that. We expect a lot of things, but I did not expect that,” Heidi Klum exclaimed.\nWithout hesitation, Klum hit the Golden Buzzer, sending Pranysqa straight to the live shows. “I want you to call your grandmother and say that Heidi Klum pushed the Golden Buzzer for you,” she told the young singer.\nWhen the golden confetti rained down on Pranysqa, she began crying tears of happiness, clearly in shock that she had earned the golden honor. “My dream is coming true. I can’t believe it,” she said, reflecting on her grandmother’s prediction that she would one day perform on a big stage.\nPranysqa’s family joined her on stage for an emotional celebration, with tears of joy and hugs all around. Klum then helped Pranysqa call her grandmother to share the incredible news.\n“You are absolutely incredible,” Heidi Klum told the pint-sized powerhouse after her performance.\nWatch Pranysqa Mishra perform the Tina Turner classic “River Deep, Mountain High,” first recorded by Ike & Tina Turner in 1966, on America’s Got Talent below.",
      "author": "Jessica Lynch",
      "published_date": "2024-07-03",
      "word_count": 416,
      "fetch_timestamp": "2025-08-20T16:29:09.879160",
      "metadata": {
        "char_count": 2728,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:29:09.879155"
      }
    },
    {
      "url": "https://www.billboard.com/video/influence-of-tina-turner-little-richard-rock-n-roll-billboard-news/",
      "source": "billboard",
      "artist_name": "Tina Turner",
      "title": "The Influence of Tina Turner, Little Richard & More on Rock n’ Roll | Billboard News",
      "content": "---\ntitle: The Influence of Tina Turner, Little Richard & More on Rock n’ Roll | Billboard News\nauthor: Katie Cao\nurl: https://www.billboard.com/video/influence-of-tina-turner-little-richard-rock-n-roll-billboard-news/\nhostname: billboard.com\ndescription: Tina Turner, Sister Rosetta Tharpe, Little Richard and more paved the way in rock n' roll before turning into a predominantly white genre in the '80s.\nsitename: Billboard\ndate: 2024-06-24\ncategories: ['Videos']\ntags: ['bbnews, Billboard, billboard news']\n---\nTina Turner, Sister Rosetta Tharpe, Little Richard and various other Black artists paved the way in rock n’ roll before turning into a predominantly white genre in the ’80s. Keep watching to see how these artists influenced the art of rock n’ roll!\nTetris Kelly:\nMost of the rock music you listen to today would not exist if not for Black innovators paving the way. During this Black Music Month, we’re taking a look back at some of the trailblazing artists that made rock n’ roll what it is.\nRock was born in the 1950s at a time when the United States was just as segregated as music genres. People look back to Elvis, whose sound was not a white sound, he was compared to African American R&B singers and covered countless African American musicians.\nLittle Richard has been described as the architect of rock n’ roll for his dynamic music and electrifying stage presence in the mid ’50s music scene. Ike and Tina Turner opened for The Rolling Stones in the late 1960s, which introduced their bold style of soul-infused rock.\nAnd Sister Rosetta Tharpe has been credited as the godmother of rock n’ roll. A Black, queer woman in the ’40s, she forged her sound in an industry dominated by men, and she wielded a guitar on a level that rivaled them. But by the ’80s, rock n’ roll had now become white music, with most general knowledge of rock history not going back further than the ’70s.\nRumors are that it may be the third act and a genre Beyonce is looking to reclaim.",
      "author": "Katie Cao",
      "published_date": "2024-06-24",
      "word_count": 331,
      "fetch_timestamp": "2025-08-20T16:29:09.921253",
      "metadata": {
        "char_count": 1986,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:29:09.921249"
      }
    },
    {
      "url": "https://www.billboard.com/video/pop-culture-rewind-tina-turner-career-achievements/",
      "source": "billboard",
      "artist_name": "Tina Turner",
      "title": "Pop Culture Rewind: Tina Turner’s Hits, Career & Chart Achievements | Billboard News",
      "content": "---\ntitle: Pop Culture Rewind: Tina Turner’s Hits, Career & Chart Achievements | Billboard News\nauthor: Valentina Padilla\nurl: https://www.billboard.com/video/pop-culture-rewind-tina-turner-career-achievements/\nhostname: billboard.com\ndescription: Billboard looks back at Tina Tuner’s hits, career and chart achievements.\nsitename: Billboard\ndate: 2023-11-21\ncategories: ['Videos']\ntags: ['bbnews, billboard news, PepsiBBNews2023']\n---\nBillboard looks back on Tina Tuner’s hits, career and chart achievements.\nEvan Burke:\nShe’s “Simply the Best.” Today we celebrate the birthday of Tina Turner, one of music history’s most electrifying performers. From her charting hits to her amazing accolades, we run through it all in today’s Pop Culture Rewind.\nTina Turner was born on November 26, 1939. Ms. Turner kicked off her half-century career in the late 1950s, but it wasn’t until 1971 that she gained her first top 10 with Ike Turner and their version of the Creedence Clearwater Revival song “Proud Mary.”\nOver the course of her career, she landed 18 songs on the Hot 100 with 1984’s “What’s Love Got To Do With It” becoming one of her most iconic hits. The song also won record of the year and best female pop vocal performance at the Grammys in 1985. She has a career total of eight Grammys. Tina has been inducted into the Rock and Roll Hall of Fame twice, once as a part of Ike & Tina Turner in 1991, and again in 2021, as a solo artist.\nThe prolific artist passed away on May 24, 2023. There is currently a Broadway show Tina that celebrates her life touring the United States.\nWe will have another huge moment for you next week in our Pop Culture Rewind.",
      "author": "Valentina Padilla",
      "published_date": "2023-11-21",
      "word_count": 269,
      "fetch_timestamp": "2025-08-20T16:29:10.131125",
      "metadata": {
        "char_count": 1659,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:29:10.131119"
      }
    }
  ],
  "total_articles": 5,
  "total_words": 3470,
  "extracted_at": "2025-08-20T16:29:10.503781",
  "urls_processed": [
    "https://www.billboard.com/music/rock/bryan-adams-tina-turner-lesson-tour-interview-1235953231/",
    "https://www.billboard.com/music/rock/tina-turner-previously-unreleased-song-hot-for-you-baby-listen-1235881534/",
    "https://www.billboard.com/music/music-news/americas-got-talent-pranysqa-mishra-tina-turner-1235724122/",
    "https://www.billboard.com/video/influence-of-tina-turner-little-richard-rock-n-roll-billboard-news/",
    "https://www.billboard.com/video/pop-culture-rewind-tina-turner-career-achievements/"
  ]
}