{
  "artist_name": "U2",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/music/rock/u2-statements-gaza-israel-hamas-war-starvation-palestinians-1236040325/",
      "source": "billboard",
      "artist_name": "U2",
      "title": "U2 Members Issue Statements on Gaza and Israel’s War on Hamas: ‘We Want Our Audience to Know Where We Each Stand’",
      "content": "---\ntitle: U2 Members Issue Statements on Gaza and Israel’s War on Hamas: ‘We Want Our Audience to Know Where We Each Stand’\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/rock/u2-statements-gaza-israel-hamas-war-starvation-palestinians-1236040325/\nhostname: billboard.com\ndescription: U2 issued group and individual statements about the Israel/Hamas war, calling for aid to the starving and an end to the two-year conflict.\nsitename: Billboard\ndate: 2025-08-11\ncategories: ['Rock']\ntags: ['genre rock, Music News, nsfs']\n---\nAll four members of U2 issued statements on Sunday (Aug. 10) expressing their fears that the nearly two-year war between Israel and Hamas has sent the region into “uncharted territory.” In a joint statement from Bono, The Edge, Larry Mullen Jr. and Adam Clayton, the group wrote, “Everyone has long been horrified by what is unfolding in Gaza – but the blocking of humanitarian aid and now plans for a military takeover of Gaza City has taken the conflict into uncharted territory. We are not experts in the politics of the region, but we want our audience to know where we each stand.”\nThe statements from the band came as experts are warning that Israeli Prime Minister Benjamin Netanyahu’s plan for a renewed offensive in the Gaza Strip in which forces would take over Gaza City could further exacerbate a malnutrition and starvation crisis that has taken center stage on the eve of the two-year mark of the war.\nIn his letter, singer and career-long activist Bono said that he has generally tried to avoid speaking on the politics of the Middle East — with the exception of marking the Oct. 7, 2023 attack on the Nova music festival on the day when Hamas killed more than 1,200 and took more than 250 hostages from Israel — not out of humility, but “more uncertainty in the face of obvious complexity.”\nBut as co-founder of the Arfrica-centered global anti-poverty, HIV/AIDS charity ONE, he felt his focus should be on the lives lost in the war in Sudan and Ethiopia, not to mention the Trump administration’s dismantling of USAID and the U.S.’s life-saving PEPFAR initiative focusing on fighting HIV/AIDS.\nBut, he wrote, “The images of starving children on the Gaza Strip brought me back to a working trip to a food station in Ethiopia my wife Ali and I made 40 years ago next month following U2’s participation in Live Aid 1985. Another man-made famine. To witness chronic malnutrition up close would make it personal for any family, especially as it affects children. Because when the loss of non-combatant life en masse appears so calculated… especially the deaths of children, then ‘evil’ is not a hyperbolic adjective… in the sacred text of Jew, Christian, and Muslim it is an evil that must be resisted.”\nBono acknowledged that the rape, murder and abduction of Israelis at the Nova Festival was “evil” and that when he heard about the Oct. 7 assault by Hamas militants on Israel he didn’t think of politics. Reacting in real time to the news from the stage of the Sphere where the band were in the midst of their venue-opening residency, he said he couldn’t help but “express the pain everyone in the room was feeling and is still feeling for other music lovers and fans like us — hiding under a stage in Kibbutz Re’im then butchered to set a diabolical trap for Israel and to get a war going that might just redraw the map from ‘The river to the sea’… a gamble Hamas’ leadership were willing to play with the lives of two million Palestinians… to sow the seeds for a global intifada that U2 had glimpsed at work in Paris during the Bataclan attack in 2015… but only if Israel’s leaders fell for this trap that Hamas set for them.”\nThe singer had pointed words for Israeli PM Netanyahu, as well as late Hamas leader Yahya Sinwar, lashing the latter for what he said was Hamas’ deliberate positioning of soldiers amid civilian targets, while also asking when a “just war to defend the country turn[ed] into an unjust land grab? I hoped Israel would return to reason. I was making excuses for a people seared and shaped by the experience of Holocaust… who understood the threat of extermination is not simply a fear but a fact… I re-read Hamas’ charter of 1988[3]… it’s an evil read (Article Seven!)”\nTo date, Gaza’s Health Ministry has said that more than 61,000 Palestinians have been killed in the conflict, with experts warning that the Palestinian territories under attack could tip into widespread famine soon if food aid is not dramatically increased.\nBono said he understands that Hamas doesn’t speak for the Palestinian people as a whole, acknowledging their decades of “marginalization, oppression, occupation, and the systematic stealing of the land that is rightfully theirs. Given our own historic experience of oppression and occupation, it’s little wonder so many here in Ireland have campaigned for decades for justice for the Palestinian people”; Irish hip-hop trio Kneecap has spoken out loudly and frequently in support of the Palestinian people, drawing a series of festival bans and police investigations over the past six months for statements they’ve made on stage.\n“We know Hamas are using starvation as a weapon in the war, but now so too is Israel and I feel revulsion for the moral failure,” Bono continued. “The Government of Israel is not the nation of Israel, but the Government of Israel led by Benjamin Netanyahu today deserves our categorical and unequivocal condemnation. There is no justification for the brutality he and his far right government have inflicted on the Palestinian people… in Gaza… in the West Bank. And not just since October 7, well before it too… though the level of depravity and lawlessness we are seeing now feels like uncharted territory.”\nCiting a number of instances in which he said the Israeli government has reportedly acknowledged using starvation as a tactic and made their desire to take over the territory plain, the singer wondered how the world had gotten to this point, again. “Is the world not done with this far, far right thinking? We know where it ends… world war… millenarianism,” Bono asked. “Might the world deserve to know where this once promising bright-minded democratic nation is headed unless there is a dramatic change of course? Is what was once an oasis of innovation and free-thinking now in hock to a fundamentalism as blunt as a machete? Are Israelis really ready to let Benjamin Netanyahu do to Israel what its enemies failed to achieve over the last 77 years? And disappear it from membership in a community of nations built around even a flawed decency?”\nA longtime believer in Israel’s right to exist, and supporter of a long-sought two-state solution, Bono made clear the band’s condemnation of Netanyahu’s “immoral actions” and their call for an immediate cease fire. “Our band stands in solidarity with the people of Palestine who truly seek a path to peace and coexistence with Israel and with their rightful and legitimate demand for statehood,” said Bono, who provided a list of article citations in the notes of his message. “We stand in solidarity with the remaining hostages and plead that someone rational negotiate their release.”\nHe said the band urges Israelis to demand unfettered access for professionals to help those in need in Gaza and let the correct amount of aid trucks through while pledging to support and donate to the group Medical Aid For Palestinians.\nGuitarist the Edge also expressed their shock and profound grief at watching the destruction and starvation in Gaza. He posited three questions to Netanyahu: 1) Does he believe that such devastation can happen without “heaping generational shame upon those responsible?” 2) If the end goal is to remove Palestinians from Gaza and the West Bank to make way for a “Greater Israel” is that not “ethnic cleansing” or “colonial genocide?” 3) And, if Netanyahu’s government rejects a two-state solution, what is their vision for ending the conflict?\n“Simply perpetual conflict? A future of walls, blockades, military occupation?” Edge asked. “A state of permanent inequality? And if this apartheid state transpires don’t you destroy the very argument for Israel’s existence as a moral response to the horrors of the Holocaust? For if Israel comes to be seen as a state that systematically denies another people their rights, then the world will inevitably ask whether the only just and sustainable future, the only tolerable future, is a shared state — one where Jews and Palestinians live together as equals under the law.”\nTaking the long-running, bloody Troubles in Ireland from the 1960s through the late 1990s as an example of what happens when one side tries to force peace through dominance, Edge said history has taught that “peace is made when people sit down with their opponents — when they recognize the equal dignity of all, even those they once feared or despised. There can be no peace without justice. No reconciliation without recognition.”\nThe message from Clayton echoed the collective feeling that the current humanitarian crisis in Gaza “looks like revenge on a civilian population who are not responsible for Hamas’ murderous attack,” warning that if Israel moves forward with colonizing Gaza it will, “permanently undo any possibility of lasting peace or solution for hostilities.”\nMullen Jr. wondered what Hamas was thinking when they undertook their bloody incursion, noting that a ground war and aerial bombardment from the militarily superior Israeli forces was a given, though what he described as the “indiscriminate decimation of most homes and hospitals in Gaza, with a majority of those killed being women and children” was not expected. Nor, he writes, was “imposing famine.”\nThe Netanyahu government has repeatedly denied that a famine is taking place or that Israel is attempting to starve Palestinians by choking off food aid into the territories — often claiming that, despite scant evidence, Hamas is looting the supplies. Mullen said that it was difficult to comprehend how “any civilized society can think starving children is going to further any cause and be justified as an acceptable response to another horror. To state the obvious, starving innocent civilians as a weapon of war is inhumane and criminal.”\nHe wondered where the outrage was from within, and without, Israel about the reported famine, noting that “the power to change this obscenity is in the hands of Israel.”",
      "author": "Gil Kaufman",
      "published_date": "2025-08-11",
      "word_count": 1725,
      "fetch_timestamp": "2025-08-20T17:03:36.034435",
      "metadata": {
        "char_count": 10433,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T17:03:36.034427"
      }
    },
    {
      "url": "https://www.billboard.com/music/rb-hip-hop/lil-wayne-tha-carter-vi-song-bono-nba-finals-promo-1235990139/",
      "source": "billboard",
      "artist_name": "U2",
      "title": "Lil Wayne’s Unreleased ‘Tha Carter VI’ Song With U2’s Bono Soundtracks NBA Finals Promo",
      "content": "---\ntitle: Lil Wayne’s Unreleased ‘Tha Carter VI’ Song With U2’s Bono Soundtracks NBA Finals Promo\nauthor: Michael Saponara\nurl: https://www.billboard.com/music/rb-hip-hop/lil-wayne-tha-carter-vi-song-bono-nba-finals-promo-1235990139/\nhostname: billboard.com\ndescription: Lil Wayne's 'Tha Carter VI' song \"The Days\" featuring Bono plays in an NBA Finals promo spot ahead of game one.\nsitename: Billboard\ndate: 2025-06-05\ncategories: ['R&B/Hip-Hop']\ntags: ['genre hiphop, genre rock, Music News, nba, sports']\n---\nESPN is giving Lil Wayne fans a sneak peek at his The Carter VI album mere hours before it arrives.\nUnreleased track “The Days” featuring Bono has been used in a promo ad for game one of the NBA Finals between the Indiana Pacers and Oklahoma City Thunder on Thursday (June 5).\n“I pledge allegiance to what I believe in/ Live to fight another day,” he raps. “I ain’t getting younger, but I’m getting better/ No time to waste that’s another man’s treasure/ They say every dog has hit day.” The U2 frontman then takes the baton to handle chorus duties. “These are the days,” Bono sings.\nWithout a single ahead of the album, “The Days” snippet is the first taste fans got of C6, and the partnership makes sense with Lil Wayne being an avid hoops fan.\nTrending on Billboard\n“Basketball’s been in my blood since day one, so to team up with ESPN less than 24 hours before the drop of Tha Carter VI for the NBA Finals is an incredible honor,” Wayne said in a statement. “My music and the NBA are vibin’ on the same frequency because it’s perfect timing for fans to hear Tha Carter VI on the game’s grandest stage.”\nESPN has been using numerous Wayne tracks to soundtrack NBA Playoffs ads this season, including “I Am Not a Human Being,” “Uproar” and the “Glory (Remix).”\n“Lil Wayne brings the energy, edge and emotion that define the NBA Finals,” Curtis Friends, vice president of sports marketing at ESPN, said in a statement. “Integrating his music into our NBA Playoffs coverage has been a strategic brand flex — amplifying our storytelling and connecting with fans as we showcase today’s rising stars on the league’s biggest stage.”\nGame one of the NBA Finals tips off at 8:30 p.m. ET on ABC inside OKC’s Paycom Center as the Pacers and Thunder gear up for a hard-fought series. After the contest, look for Weezy’s Tha Carter VI to hit streaming services at midnight ET on Friday (June 6).\nGet a taste of “The Days” with the NBA Finals teaser below.",
      "author": "Michael Saponara",
      "published_date": "2025-06-05",
      "word_count": 413,
      "fetch_timestamp": "2025-08-20T17:03:36.085456",
      "metadata": {
        "char_count": 2458,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T17:03:36.085451"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/u2-bono-hamas-release-hostages-stop-war-ivor-novello-awards-1235979690/",
      "source": "billboard",
      "artist_name": "U2",
      "title": "U2’s Bono Calls for Hamas to ‘Release the Hostages, Stop the War’ During Ivor Novello Awards Speech",
      "content": "---\ntitle: U2’s Bono Calls for Hamas to ‘Release the Hostages, Stop the War’ During Ivor Novello Awards Speech\nauthor: Anna Chan\nurl: https://www.billboard.com/music/music-news/u2-bono-hamas-release-hostages-stop-war-ivor-novello-awards-1235979690/\nhostname: billboard.com\ndescription: U2's Bono called for Hamas to \"release the hostages\" and \"stop the war\" during his speech at the Ivor Novello Awards.\nsitename: Billboard\ndate: 2025-05-23\ncategories: ['Music News']\ntags: ['Awards, Israel-Gaza, Music News, nsfs']\n---\nBono is tired of the broken bottles under children’s feet and bodies strewn across the dead-end street, so he called for the Israel-Hamas war to stop during U2‘s induction into the Ivor’s Fellowship Academy at the Ivor Novello Awards ceremony in London on Thursday (May 22).\nThe singer-songwriter’s message came as he introduced the band’s acoustic performance of its 1983 hit “Sunday Bloody Sunday,” about the January 1972 massacre that saw British soldiers fire upon protesters in Derry, Northern Ireland, killing 14 unarmed people.\n“I used to introduce this next song by saying it wasn’t a rebel song,” Bono began. “Believing in the possibilities of peace was then and is now a rebellious act — and some would say a ridiculous one. To believe peace was attainable between your country and ours, between our country and itself, was a ridiculous idea because peace creates possibilities in the most intractable situations, and lord knows theres a few of them out there right now.”\n“Hamas, release the hostages, stop the war,” the Irish rocker continued. “Israel, be released from Benjamin Netanyahu and the far-right fundamentalists that twist your sacred texts. All of you protect our aid workers, they are the best of us!”\nHamas launched an attack on Israel Oct. 7, 2023, killing about 1,200 people and taking more than 250 others as captives, with the Associated Press reporting that 58 are still being held. More than 53,000 people — mostly children and women — have been killed across Gaza in Israel’s retaliatory attacks. On Friday, Gaza’s health ministry said that at least another 60 have been killed in Israeli strikes in the past 24 hours.\nThe band has been outspoken in its stances. In February, U2 shared a message of support for Ukraine, which has been fighting against an invasion by Russia launched thee years earlier. “All who believe in freedom and sense the jeopardy we Europeans now find ourselves in are not sleeping easily on this, the third anniversary of the invasion,” Bono captioned the Instagram post, which included a reading of Taras Shevchenko’s “My Friendly Epistle” accompanied by piano.\nIn January, President Joe Biden honored Bono with the Presidential Medal of Freedom, highlighting the rocker’s work as a “pioneering activist against AIDS and poverty.”",
      "author": "Anna Chan",
      "published_date": "2025-05-23",
      "word_count": 437,
      "fetch_timestamp": "2025-08-20T17:03:36.132451",
      "metadata": {
        "char_count": 2808,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T17:03:36.132446"
      }
    },
    {
      "url": "https://www.billboard.com/music/rock/bono-stories-of-surrender-doc-u2-singer-one-man-show-apple-tv-plus-debut-1235910490/",
      "source": "billboard",
      "artist_name": "U2",
      "title": "‘Bono: Stories of Surrender’ Doc About U2 Singer’s One-Man Show Headed to Apple TV+: Watch the Trailer",
      "content": "---\ntitle: ‘Bono: Stories of Surrender’ Doc About U2 Singer’s One-Man Show Headed to Apple TV+: Watch the Trailer\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/rock/bono-stories-of-surrender-doc-u2-singer-one-man-show-apple-tv-plus-debut-1235910490/\nhostname: billboard.com\ndescription: A doc about U2 singer Bono's memoir tour, 'Bono: Stories of Surrender,' has set a May 30 debut on Apple TV+ and on Apple Vision Pro devices.\nsitename: Billboard\ndate: 2025-04-30\ncategories: ['Rock']\ntags: ['movies, Music News, music rock']\n---\nUPDATE (April 30): A new trailer was released for Bono: Stories of Surrender on Wednesday (April 30). The film, based on Bono’s one-man show of the same name, arrives May 30 on Apple TV+.\nCheck out the new trailer below.\nPREVIOUSLY (Feb. 26): Apple Original Films announced that the documentary Bono: Stories of Surrender will premiere globally on Apple TV+ on May 30. In addition, the “lyrical, bold exploration” of the U2 singer’s one-man show of the same name based on his 2022 memoir, Surrender: 40 Songs One Story, will also be the first feature-length film available on the Apple Vision Pro in Apple Immersive Video.\nThe movie directed by Andrew Dominik (The Assassination of Jesse James) is described in a press release as, “a vivid reimagining of Bono’s critically-acclaimed one-man stage show, Stories of Surrender: An Evening of Words, Music and Some Mischief…, as he pulls back the curtain on a remarkable life and the family, friends, and faith that have challenged and sustained him, revealing personal stories about his journey as a son, father, husband, activist and rockstar. Along with never-before-seen, exclusive footage from the Beacon Theatre shows, the film features Bono performing many of the iconic U2 songs that have shaped his life and legacy.”\nTrending on Billboard\nThe Apple Vision Pro version will present the film in 8K with Spatial Audio, producing a 180-degree visual that, “places viewers onstage with Bono and in the center of his story. With this special edition of the film available only on Vision Pro, viewers will feel completely immersed in the music and storytelling of Surrender.”\nThe movie was produced by RadicalMedia’s Oscar- and Emmy-winning duo of Jon Kamen and Dave Sirulnick (Summer of Soul, Hamilton), along with Plan B Entertainment’s Oscar-winning actor/producer Brad Pitt, Dede Gardner and Jeremy Kleiner (Moonlight, 12 Years a Slave), with Bono executive producing with Jennifer Pitcher (Kiss The Future) and Kelly McNamara (V-U2 an Immersive Concert Film at Sphere Las Vegas).\nAn abridged and updated edition of Bono’s memoir — described as “introspective, intimate and irreverent in equal measure… refined to mirror the arc of his one-man show and featur[ing] a film tie-in book cover and new introduction by the author” — will be released in conjunction with the documentary.",
      "author": "Gil Kaufman",
      "published_date": "2025-04-30",
      "word_count": 443,
      "fetch_timestamp": "2025-08-20T17:03:36.179846",
      "metadata": {
        "char_count": 2875,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T17:03:36.179826"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/u2-supports-ukraine-russian-invasion-poem-3-years-1235908509/",
      "source": "billboard",
      "artist_name": "U2",
      "title": "U2 Shares Message of Support for Ukraine 3 Years After Russian Invasion: Listen to the Poem",
      "content": "---\ntitle: U2 Shares Message of Support for Ukraine 3 Years After Russian Invasion: Listen to the Poem\nauthor: Hannah Dailey\nurl: https://www.billboard.com/music/music-news/u2-supports-ukraine-russian-invasion-poem-3-years-1235908509/\nhostname: billboard.com\ndescription: U2 supports Ukraine three years after the Russian invasion began. Listen to the poem.\nsitename: Billboard\ndate: 2025-02-24\ncategories: ['Music News']\ntags: ['Music News, nsfs, politics']\n---\nThe members of U2 are making sure the people of Ukraine know that they still have their backs three years after Russia’s invasion.\nOn Monday (Feb. 24) — the same date Russia launched its full-fledged military operation on Ukraine in 2022, effectively sending the countries into a war that is still ongoing — Bono shared an emotional piano-accompanied reading of Taras Shevchenko’s “My Friendly Epistle” on the Irish rock band’s Instagram. “Break then your chains, in love unite, nor seek in foreign lands the sight of things not even found above,” the poem dictates. “Then, in your own house, you will see true justice, strength and liberty!”\n“All who believe in freedom and sense the jeopardy we Europeans now find ourselves in are not sleeping easily on this, the third anniversary of the invasion,” Bono wrote in his caption, revealing that he and The Edge had originally sent the musical reading to Ukraine president Volodymyr Zelenskyy days after Russia first invaded three years ago.\n“More to say about this and other bewilderments later,” added the “Mysterious Ways” musician.\nBono and his U2 bandmates have been vocal in their support of Ukraine throughout the country’s war against Russia, which began in February 2022 when the latter country’s president, Vladimir Putin, ordering multiple attacks on Ukraine’s major cities as part of a “special military operation.” In April that year, Irish rockers performed on a bill with Celine Dion, Katy Perry and more stars as part of a Stand Up for Ukraine relief show, a month after which Bono and Edge traveled to Kyiv to perform Ben E. King’s “Stand by Me” in a metro station.\nLast year, Bono also paid tribute to late Russian opposition leader Alexei Navalny — one of Putin’s most outspoken critics who died in Russian prison in February 2024 — during one of U2’s residency shows at Las Vegas’ The Sphere. “For these people, freedom is the most important word in the world,” the frontman told the crowd at the time. “So important that Ukrainians are fighting and dying for it, and so important that Alexey Navalny chose to give his up.”\nAs Ukraine enters a fourth year of fighting off Russia, its fate remains uncertain. Many Western leaders gathered in Kyiv Monday to observe the date and, in some cases, pledge more military aid to Zelenskyy’s efforts. However, President Donald Trump recently stirred up concern over the United States’ yearslong Biden-era alliance with Ukraine by calling Zelenskyy a “dictator,” while maintaining a cordial relationship with Putin amid Trump’s pushes for a peace settlement.\nSee U2’s tribute to Ukraine below.",
      "author": "Hannah Dailey",
      "published_date": "2025-02-24",
      "word_count": 485,
      "fetch_timestamp": "2025-08-20T17:03:36.227335",
      "metadata": {
        "char_count": 3064,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T17:03:36.227330"
      }
    }
  ],
  "total_articles": 5,
  "total_words": 3503,
  "extracted_at": "2025-08-20T17:03:37.341000",
  "urls_processed": [
    "https://www.billboard.com/music/rock/u2-statements-gaza-israel-hamas-war-starvation-palestinians-1236040325/",
    "https://www.billboard.com/music/rb-hip-hop/lil-wayne-tha-carter-vi-song-bono-nba-finals-promo-1235990139/",
    "https://www.billboard.com/music/music-news/u2-bono-hamas-release-hostages-stop-war-ivor-novello-awards-1235979690/",
    "https://www.billboard.com/music/rock/bono-stories-of-surrender-doc-u2-singer-one-man-show-apple-tv-plus-debut-1235910490/",
    "https://www.billboard.com/music/music-news/u2-supports-ukraine-russian-invasion-poem-3-years-1235908509/"
  ]
}