{
  "artist_name": "Johnny Cash",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/artist/johnny-cash/chart-history/hsi",
      "source": "billboard",
      "artist_name": "Johnny Cash",
      "title": "Johnny Cash | Biography, Music & News | Billboard",
      "content": "---\ntitle: Johnny Cash | Biography, Music & News | Billboard\nauthor: Wp-Block-Co-Authors-Plus-Coauthors Is-Layout-Flow\nurl: https://www.billboard.com/artist/johnny-cash/\nhostname: billboard.com\ndescription: Explore Johnny Cash's music on Billboard. Get the latest news, biography, and updates on the artist.\nsitename: Billboard\ndate: 2024-10-17\n---\nA Boy Named Sue\nJohnny Cash\nWhat Is Truth\nJohnny Cash\nGuess Things Happen That Way\nJohnny Cash And The Tennessee Two\nThe Ways Of A Woman In Love\nJohnny Cash And The Tennessee Two\nOne Piece At A Time\nJohnny Cash And The Tennessee Three\nFolsom Prison Blues\nJohnny Cash\nDon't Take Your Guns To Town\nJohnny Cash\nUnderstand Your Man\nJohnny Cash\nIf I Were A Carpenter\nJohnny Cash & June Carter\nAll Over Again\nJohnny Cash\nDaddy Sang Bass\nJohnny Cash\nI Got Stripes\nJohnny Cash\nSunday Morning Coming Down\nJohnny Cash\nThe One On The Right Is On The Left\nJohnny Cash\nIt's Just About Time\nJohnny Cash And The Tennessee Two\nBlistered/See Ruby Fall\nJohnny Cash\nWhat Do I Care\nJohnny Cash\nFlesh And Blood\nJohnny Cash\nFrankie's Man, Johnny\nJohnny Cash\nIt Ain't Me, Babe\nJohnny Cash\nThe Little Drummer Boy\nJohnny Cash\nKaty Too\nJohnny Cash And The Tennessee Two\nKate\nJohnny Cash And The Tennessee Three\nSee Ruby Fall\nJohnny Cash\nFive Feet High And Rising\nJohnny Cash\nSecond Honeymoon\nJohnny Cash\nOrange Blossom Special\nJohnny Cash\nTennessee Flat-Top Box\nJohnny Cash\nStraight A's In Love\nJohnny Cash And The Tennessee Two\nDown The Street To 301\nJohnny Cash And The Tennessee Two\nI Just Thought You'd Like To Know\nJohnny Cash And The Tennessee Two\nCome In Stranger\nJohnny Cash And The Tennessee Two\nRosanna's Going Wild\nJohnny Cash\nHonky-Tonk Girl\nJohnny Cash\nRock Island Line\nJohnny Cash\nOh Lonesome Me\nJohnny Cash With The Gene Lowery Singers\nEverybody Loves A Nut\nJohnny Cash",
      "author": "Wp-Block-Co-Authors-Plus-Coauthors Is-Layout-Flow",
      "published_date": "2024-10-17",
      "word_count": 303,
      "fetch_timestamp": "2025-08-20T16:59:49.394723",
      "metadata": {
        "char_count": 1807,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:59:49.394714"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/tommy-cash-dead-johnny-cash-brother-dies-obituary-1235775606/",
      "source": "billboard",
      "artist_name": "Johnny Cash",
      "title": "Tommy Cash, Country Singer & Johnny Cash’s Brother, Dies at 84",
      "content": "---\ntitle: Tommy Cash, Country Singer & Johnny Cash’s Brother, Dies at 84\nauthor: Mitchell Peters\nurl: https://www.billboard.com/music/music-news/tommy-cash-dead-johnny-cash-brother-dies-obituary-1235775606/\nhostname: billboard.com\ndescription: Tommy Cash, a country singer and the younger brother of Johnny Cash, has died. He was 84.\nsitename: Billboard\ndate: 2024-09-14\ncategories: ['Music News']\ntags: ['Country, Death, Music News, nsfs, obituary']\n---\nTommy Cash, a country singer and the younger brother of Johnny Cash, has died. He was 84.\nThe news of Tommy’s passing was confirmed on Saturday (Sept. 14) in a social media post by the Johnny Cash Museum in Nashville.\n“We are saddened to announce that the world lost a bright light last evening with the passing of Tommy Cash,” reads a statement on Instagram from Icon Entertainment CEO Bill Miller, who founded the museum.\nA cause of death was not provided at press time.\nTommy died on Friday, just one day after the 21st anniversary of late country music icon Jonny Cash, who passed away on Sept. 12, 2003, from complications of diabetes.\n“Tommy Cash was a loyal supporter of the Johnny Cash Museum and a very beloved member of our extended family as well as a highly respected member of the music industry,” Miller added. “This great man will be deeply missed by his friends and many loyal fans around the world. Please keep Tommy’s beloved wife, Marcy and his family in your prayers.”\nTommy was born in Dyess, Ark., on April 5, 1940. Following the artistic path of his older brother, Tommy enlisted in the U.S. Army and worked as a radio DJ for the Armed Forces, and later performed as a musician with Hank Williams Jr.‘s band.\nTommy’s solo music career began to take off after scoring his first record deal in 1965. Three years later, he released his debut album, Here’s Tommy Cash, and scored his first top 10 on Billboard‘s Hot Country Songs in 1970 with “Six White Horses,” a tribute to John F. Kennedy, Robert F. Kennedy and Martin Luther King. The track, which reached No. 4, was later covered by country great Waylon Jennings.\nTommy scored two more top 10 hits on Hot Country Songs in 1970 with “Rise and Shine” and “One Song Away.” He went on to perform as a musician over the decades, teaming up with his big brother Johnny on “Guess Things Happen That Way” in 1990.\n“He performed around the world throughout his career, carrying on the Cash legacy long after his brother, Johnny Cash, passed in 2003,” Miller concluded in his statement.\nSee the Johnny Cash Museum’s announcement about Tommy Cash’s death on Instagram here.",
      "author": "Mitchell Peters",
      "published_date": "2024-09-14",
      "word_count": 432,
      "fetch_timestamp": "2025-08-20T16:59:49.442343",
      "metadata": {
        "char_count": 2592,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:59:49.442334"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/new-elvis-presley-johnny-cash-releases-different-spin-classic-voices-1235747437/",
      "source": "billboard",
      "artist_name": "Johnny Cash",
      "title": "How New Elvis Presley and Johnny Cash Releases Put a Different Spin on Two Classic Voices",
      "content": "---\ntitle: How New Elvis Presley and Johnny Cash Releases Put a Different Spin on Two Classic Voices\nauthor: Tom Roland\nurl: https://www.billboard.com/music/music-news/new-elvis-presley-johnny-cash-releases-different-spin-classic-voices-1235747437/\nhostname: billboard.com\ndescription: New releases from Elvis Presley and Johnny Cash highlight two classic artists.\nsitename: Billboard\ndate: 2024-08-06\ncategories: ['Music News']\ntags: ['Elvis, johnny cash']\n---\nThey’ve both been gone for decades, and yet it’s still possible to hear two Country Music Hall of Fame members who started at Sun Records, Elvis Presley and Johnny Cash, in new ways.\nPresley is the subject of Memphis (due Aug. 9 from RCA/Legacy), a 111-track, five-disc box set that mines recordings from five different locations in his adopted hometown: the Sun Recording Studio, the American Studios, the Stax Studio, the Mid-South Coliseum and Graceland Mansion’s Jungle Room. On three of the studio discs, previously released tracks are remixed strictly using the instrumentation from the core tracking session, leaving out material that was overdubbed at a later date.\n“By not having the additional strings and backing vocals, there [is] an intimacy to it that would reveal things that we hadn’t heard before,” says Memphis producer Ernst Jorgensen, a well-established Presley authority. “So songs come out with a different feel to them.”\nTrending on Billboard\nThe Presley package arrives with the 70th anniversary of his seminal recording of “That’s All Right,” the single that launched his career.\nCoincidentally, Cash’s 11-track Songwriter (released June 28 by Mercury Nashville/Universal Music Enterprises) includes the similarly titled “Well Alright” — a previously unreleased, 30-year-old song that echoes the spacious, simplistic sound that characterized his own Sun recordings. John Carter Cash produced the album with David Ferguson, isolating the Man in Black’s vocals from a series of 1993 recordings and reframing them with new arrangements.\n“I always wanted to know what would happen if it went down to the bare essence of the correct, simple picture behind my father,” John Carter said during a media listening event earlier this year. It’s “the right instrumentation, the sound of Johnny Cash supported by people who had played with him, mostly.”\nIt’s no secret that record labels are able to bolster their bottom lines by repackaging and/or reimagining catalog material from their best-selling artists, though after creating multiple retro releases of classic artists, it becomes increasingly difficult to find fresh ways to celebrate them. The new Presley and Cash releases succeed in representing multiple facets of each performer’s career. Memphis captures Presley in his early rockabilly stage, explores his “Suspicious Minds” comeback era and wraps with the massive productions that marked his live shows and studio efforts in his final, mid-’70s years.\nSongwriter, while drawing on Cash cuts from 1993, points to different eras in his own evolution. “Well Alright,” by adapting “boom-chick” production to a story about meeting a woman in a laundromat, has elements of his 1957 hit “Ballad of a Teenage Queen.” “I Love You Tonite” reflects on his relationship with June Carter Cash while employing an appropriate country-ballad posture. “Hello Out There” — written after the 1977 launch of the Voyager spacecraft — takes a spiritual view of the universe’s expanse, much like his “I fly a starship” verse in “Highwayman.” And the tremolo-enhanced “Spotlight,” with a bluesy guitar solo by Dan Auerbach,fits neatly into the Americana genre that coalesced during Cash’s latter years.\n“Dad saw no limits, and he said, ‘Always follow your heart,’ ” John Carter recalled. “So that’s what we did.”\nWorking with catalogs of such cultural heft as Presley and Cash is not for the faint of heart. “It’s very nerve-wracking,” says Memphis-based engineer Matt Ross-Spang, who remixed Memphis.\nWith the Cash material, the job was to enhance unfamiliar songs with musical settings that felt appropriate to his artistic sensibilities. With Presley, the assignment involved treating familiar performances — including a number of classics — with reverence, even while revising them. “You want to make it better, but you also don’t want to take it out of the realm of how we’ve all heard it and loved it all these decades,” Ross-Spang says. “I tried to really be true to the original. I tried to be true to the musicians’ and the producers’ direction.”\nIn the new remix of “Kentucky Rain,” sans the background chorus and horn section, Hammond B-3 stabs become suddenly evident. And on Presley’s underappreciated “My Boy,” Ronnie Tutt’s drum fills take on extra importance. In some ways, it sets up the sound of the live disc, where Tutt is a driving force.\n“In a wonderful way, he’s overplaying,” Ross-Spang observes. “Every hip shake from Elvis, every scarf throw, every look or hand throw Elvis does, Ronnie’s doing an amazing drum fill. All the songs are going 90 miles an hour, and Ronnie’s leading the charge. It’s incredible. A big reason why those live shows were so exciting was Ronnie Tutt’s drums.”\nConsidered in tandem, Presley’s Memphis and Cash’s Songwriter hint at interesting parallels between both artists. They each played a role in the development of rockabilly while they were Sun labelmates in the 1950s. And both employed large concert ensembles during the 1970s — Presley stacked two backing vocal groups atop a large-size live band; Cash similarly performed on his ABC-TV show in the early 1970s with his band expanded by two supporting vocal groups (The Carter Family and The Statler Brothers), plus a sizable orchestra.\nCash eventually returned to a simpler sound with his Rick Rubin-produced American Recordings, beginning just months after he recorded the vocals that appear on Songwriter. Since Presley died at age 42, how he would have approached his senior recording years remains a mystery. But the two packages provide a reminder of how two significant 20th-century voices drew on small-town roots music to help shape the arc of modern country.\n“They had great determination to go along with the melting pot of music that they came from,” Jorgensen notes. “Any kind of music — if you came from Arkansas, or Mississippi or Louisiana — was available to you. You couldn’t say the same about a lot of city environments.”",
      "author": "Tom Roland",
      "published_date": "2024-08-06",
      "word_count": 1007,
      "fetch_timestamp": "2025-08-20T16:59:49.494668",
      "metadata": {
        "char_count": 6417,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:59:49.494662"
      }
    },
    {
      "url": "https://www.billboard.com/music/country/johnny-cash-statue-us-capitol-1235745327/",
      "source": "billboard",
      "artist_name": "Johnny Cash",
      "title": "Johnny Cash Statue Coming to U.S. Capitol",
      "content": "---\ntitle: Johnny Cash Statue Coming to U.S. Capitol\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/country/johnny-cash-statue-us-capitol-1235745327/\nhostname: billboard.com\ndescription: Johnny Cash will be enshrined in the U.S. Capitol's Statuary Hall in September as part of Arkansas' contribution the collection of historic figures.\nsitename: Billboard\ndate: 2024-08-02\ncategories: ['Country']\ntags: ['Country, Music News']\n---\nThe Man in Black will soon be the Man in Marble. Later this year, a statue of country icon Johnny Cash will become the first professional musician to take its place in Statuary Hall in the U.S. Capitol. The tribute to Cash will be unveiled during a ceremony in the Capitol’s Emancipation Hall on Sept. 24.\nCash will take his place in the National Statuary Hall Collection, where each U.S. state receives two statues to commemorate important figures from its history. Cash, born in Dyess, AR, will be enshrined alongside civil rights activist Daisy Bates, whose statue was put in place in May; in 2019, Arkansas’ state legislature passed a bill to replace existing statues of Sen. James P. Clark and lawyer Uriah Rose with Cash and Bates.\nThe news about the eight-foot tall bronze statue of a stern-looking Cash holding a Bible and a guitar designed by artist Kevin Kresse was announced on Thursday (August 1) by House speaker Mike Johnson and Democratic House Minority leader Hakeem Jeffries. In December 2022, Kresse posted an image of the statue, writing, “Although I finished this 8ft. tall sculpture of Johnny Cash 2-3 months ago, I couldn’t take it to the foundry until we received approval from Washington D.C. for the entire packet. (Sculpture, Pedestal, Inscriptions, Engineering, etc.). Yesterday we received ‘official’ approval from D.C. Although I don’t know when the unveiling will be, I do know that statues of Daisy Bates and Johnny Cash will be the new representatives of Arkansas in the US Capitol, starting in 2023. I couldn’t be happier with these choices for Arkansas. I’m also extremely proud to be a native son of Arkansas, getting this opportunity to sculpt an Arkansas icon for the nation’s Capitol.”\nTrending on Billboard\nCash’s enshrinement will place him in good company alongside such historic figures as Ethan Allen, Dr. Mary McLeod Bethune (educator, civil rights activist and co-founder of the United Negro College Fund), Pulitzer Prize winner author Willa Cather, Amelia Earhart, inventor Thomas Alva Edison, Dwight D. Eisenhower, Andrew Jackson, Hellen Keller, astronaut John Swigert, Jr., George Washington and many others.\nWith his signature rumbling baritone voice and songs of faith, murder, longing and love, Cash was a beloved country outlaw best known for such iconic tracks as “I Walk the Line,” “Ring of Fire,” “Folsom Prison Blues,” “Man in Black” and “Daddy Sang Bass,” and many others.\nAccording to NBC News, Johnson, Jeffries, Arkansas Gov. Sarah Huckabee Sanders and Cash’s family are expected to attend the unveiling. Cash died in 2003 at age 71 due to respiratory failure tied to complications from diabetes.\nSee the announcement and a picture of the statue below.",
      "author": "Gil Kaufman",
      "published_date": "2024-08-02",
      "word_count": 495,
      "fetch_timestamp": "2025-08-20T16:59:49.543848",
      "metadata": {
        "char_count": 3153,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:59:49.543842"
      }
    },
    {
      "url": "https://www.billboard.com/music/country/best-new-country-songs-miranda-lambert-johnny-cash-1235721585/",
      "source": "billboard",
      "artist_name": "Johnny Cash",
      "title": "5 Must-Hear New Country Songs: Miranda Lambert, The Castellows, Johnny Cash & More",
      "content": "---\ntitle: 5 Must-Hear New Country Songs: Miranda Lambert, The Castellows, Johnny Cash & More\nauthor: Jessica Nicholson\nurl: https://www.billboard.com/music/country/best-new-country-songs-miranda-lambert-johnny-cash-1235721585/\nhostname: billboard.com\ndescription: This week's crop of new country music features songs from Miranda Lambert, The Castellows, Johnny Cash and more.\nsitename: Billboard\ndate: 2024-07-01\ncategories: ['Country']\ntags: ['Country']\n---\nIn this week’s crop of new country releases, Miranda Lambert displays strength against those who would underestimate her, while a new posthumous album from country music icon Johnny Cash highlights previously unreleased music of his from 1993. Check out all that and more of our latest favorites below.\nMiranda Lambert, “Dammit Randy”\nTrending on Billboard\nACM Awards Triple Crown winner Miranda Lambert’s songs are known for whiskey-fueled, fiery dismissals of wrecked relationships, whether on early hits such as “Kerosene” or her recent “Wranglers” — but this time around, there’s no need for blazing, burn-it-all-down anthems. Here, in her latest release since inking a deal with Republic Records, she’s confident in her own value and strength (of both song and character) — she simply moves on, knowing the one who underestimated her will come to regret it. That perspective is evident on lines such as “You gave up ’til the very last minute/ Now that I’ve gone, I’ve got your attention.”\nThe Castellows, “Miss America”\nThis sibling trio offers up a harmonica-laced, coming-of-age story arc, one embedded with nostalgia and longing for simpler childhood moments of “bare feet in the dirt,” before this small-town girl grew up, moved away from home, and “got a big city chip on her shoulder.” This trio excels at these kinds of sepia-toned, neo-traditional country songs, which operate as a perfect vessel for their idyllic harmonies. The trio’s Powell, Lily and Eleanor wrote the song with Nicolle Galyon and Will Bundy.\nJohnny Cash, “Hello Out There”\nCash’s new posthumous, 11-song project Songwriter stems from untouched demos Cash recorded at LSI Studios in Nashville in 1993, in between his 1991 set The Mystery of Life and what would become his career-revitalizing American Recordings series of projects with producer Rick Rubin. This celestial-tinged gospel song marks the project’s opening track, centered by Cash’s haunting calls for redemption and keen observations on humankind, and entrenching Cash’s reputation as not only a commanding vocalist but also a versatile songcrafter. “Hello Out There” is further elevated by a mesh of guitar from Marty Stuart, along with additional steel guitar, percussion, and vocals from Ana Cristina Cash and Harry Stinson.\nMackenzie Carpenter, “Only Girl”\nCarpenter offers up her first true love song here, capturing the heady feeling of young love in this lilting, acoustic guitar-driven ballad. She wrote this song with her brother Micah, as well as Mia Mantia and SJ McDonald. With its slow-rolling feel and Carpenter’s honeyed vocal, “Only Girl” feels destined to be a wedding dance staple.\nMidland, “Lucky Sometimes”\nTrio Midland will issue their new eight-song project Barely Blue on Sept. 20, and are offering an early look at the set with their new single “Lucky Sometimes.” A tumble of pared-back guitars, harmonica and Laurel Canyon-esque harmonies, the group captures the euphoric feeling of being on a high-rolling streak of good luck, and enjoying the ride no matter how long it runs.",
      "author": "Jessica Nicholson",
      "published_date": "2024-07-01",
      "word_count": 534,
      "fetch_timestamp": "2025-08-20T16:59:49.594366",
      "metadata": {
        "char_count": 3509,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:59:49.594360"
      }
    }
  ],
  "total_articles": 5,
  "total_words": 2771,
  "extracted_at": "2025-08-20T16:59:49.999418",
  "urls_processed": [
    "https://www.billboard.com/artist/johnny-cash/chart-history/hsi",
    "https://www.billboard.com/music/music-news/tommy-cash-dead-johnny-cash-brother-dies-obituary-1235775606/",
    "https://www.billboard.com/music/music-news/new-elvis-presley-johnny-cash-releases-different-spin-classic-voices-1235747437/",
    "https://www.billboard.com/music/country/johnny-cash-statue-us-capitol-1235745327/",
    "https://www.billboard.com/music/country/best-new-country-songs-miranda-lambert-johnny-cash-1235721585/"
  ]
}