{
  "artist_name": "Joni Mitchell",
  "source": "guardian",
  "articles": [
    {
      "url": "https://www.theguardian.com/music/2024/oct/21/joni-mitchell-jam-hollywood-bowl-review",
      "source": "guardian",
      "artist_name": "Joni Mitchell",
      "title": "Joni Mitchell review – a triumphant star-studded Hollywood show",
      "content": "---\ntitle: Joni Mitchell review – a triumphant star-studded Hollywood show\nauthor: Alaina Demopoulos\nurl: https://www.theguardian.com/music/2024/oct/21/joni-mitchell-jam-hollywood-bowl-review\nhostname: theguardian.com\ndescription: The star delivered a transcendent, career-spanning retrospective, surrounded by famous faces including Elton John and Meryl Streep\nsitename: The Guardian\ndate: 2024-10-21\ncategories: ['Music']\ntags: ['Joni Mitchell,Music,Pop and rock,Culture']\n---\nFew expected Joni Mitchell to ever perform again after the singer survived a near-fatal aneurism in 2015. But with the help of Brandi Carlile and other famous fans who turned their invite-only Laurel Canyon Joni Jams into a two-hour performance, Mitchell returned to the stage during a surprise set at the 2022 Newport folk festival.\nSince then, the songwriter from Alberta, Canada (real name Roberta Joan Anderson), headlined a show in Washington state and dropped in on this year’s Grammys. It’s a triumphant victory lap for a 80-year-old who, less than a decade ago, this publication wrote a sort of obituary for. Still, when I bought tickets to Mitchell’s second night of a sold-out weekend at the Hollywood Bowl earlier this year, I was expecting a somber turnout from Mitchell, who sings sitting down on a plush velvet loveseat, using a cane to both keep the beat and keep her upright. She’s been written off as fragile, a little shaky.\nThat ended this weekend, when Mitchell took the Bowl with an almost mischievous swagger, belting out hits such as Big Yellow Taxi, A Case of You and Circle Game (cue full-body sobs) and deep cuts she chose from a career spanning half a century. The greatest thing about seeing Joni Mitchell perform today (other than just that – seeing Joni Mitchell), is her cadre of backup. Carlile, who Mitchell joked brought her “out of retirement”, serves as an emcee and ultimate hype man. (“Shit Joni,” she said near the top of the Sunday set, “I thought you sounded good last night, but …”) Famous faces like Elton John, Meryl Streep, Annie Lennox, Jon Batiste, Prince and the Revolution alums Wendy & Lisa made up the backing band. Marcus Mumford, of Mumford & Sons fame, and responsible for some of the corniest hey ho music of the mid 2010s, redeemed himself via a duet of California, a song that’s both equally beautiful to listen to while lying alone on the floor of your apartment and in the presence of screaming Angelinos at the Bowl.\nThough Mitchell’s command of the material indicates she has no intention of going anywhere, and can still work a crowd on her own thank you very much, there is a sense of passing the baton. Much of her band is young, like the British songwriter Jacob Collier, on piano, and Fleet Foxes’ Robin Pecknold, on guitar. There’s a deep, inter-generational appreciation for these songs, a feeling of responsibility for and protection of her work. You could see it on stage, and in the audience – yes, it felt as though just about every boomer woman in southern California was present, but there were lots of young people too, some mother-daughter pairs (I brought my mom, who used to drive me around the suburbs playing Hejira or Ladies of the Canyon).\nMitchell has never held back, in her life and lyrics, and she got mouthy onstage, notably letting out a “fuck Donald Trump”, and calling herself “one of those terrible immigrants … [who should be] rounded up and put in a concentration camp”. At times, Mitchell’s deep cuts veered into the truly morose – Cherokee Louise, from 1991’s Night Ride Home, documents sexual abuse of a childhood friend, and elicited some tense reactions from a crowd more primed for, say, the jingling dulcimer lines of the frothy hippie anthem Carey. But as Carlile said, Mitchell picked the set list, and she’s more than earned that control. Other snapshots from the night that deserve a mention: the comically large glass of white wine Mitchell sipped from in between songs, Mitchell’s blazing white hair, arranged in two braids, Annie Lennox’s vocals on Ladies of the Canyon.\nMitchell is one of those artists who seems to speak directly to you, the listener, making sense out of your darkest days or most personal experiences. That’s partly why the Joni Jam felt so emotional, akin to a church service, or at least a cult meeting. In a timeline where “vulnerability” is a trend and over sharing is the norm, it can be hard to remember how radical it is for a woman to stand behind a microphone and tell – or sing – the truth.",
      "author": "Alaina Demopoulos",
      "published_date": "2024-10-21",
      "word_count": 751,
      "fetch_timestamp": "2025-08-20T15:50:40.774910",
      "metadata": {
        "char_count": 4506,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:50:40.774892",
        "access_status": "ok",
        "paywall": false
      }
    },
    {
      "url": "https://www.theguardian.com/music/2025/may/06/chris-odell-drug-runs-the-stones-love-triangle-joni-mitchell-george-harrison-",
      "source": "guardian",
      "artist_name": "Joni Mitchell",
      "title": "Drug runs for the Stones, a love triangle with Joni Mitchell: has Chris O’Dell had the music industry’s wildest career?",
      "content": "---\ntitle: Drug runs for the Stones, a love triangle with Joni Mitchell: has Chris O’Dell had the music industry’s wildest career?\nauthor: Christian Kriticos; Guardian staff reporter\nurl: https://www.theguardian.com/music/2025/may/06/chris-odell-drug-runs-the-stones-love-triangle-joni-mitchell-george-harrison-\nhostname: theguardian.com\ndescription: She managed tours for Queen and Led Zeppelin and was at George Harrison’s house when the Beatles split – but O’Dell is most proud of her legacy as a woman in a macho industry\nsitename: The Guardian\ndate: 2025-05-06\ncategories: ['Music']\ntags: ['Music,Pop and rock,The Beatles,John Lennon,Paul McCartney,George Harrison,Ringo Starr,The Rolling Stones,Keith Richards,Mick Jagger,Bob Dylan,Joni Mitchell,Echo & the Bunnymen,Culture']\n---\n‘When you start with the Beatles, your résumé looks pretty good,” Chris O’Dell says. A new documentary charts the extent of that CV, as a music manager with bands including Fleetwood Mac, Genesis and Santana, but it all began with a chance encounter in Los Angeles in 1968.\nDerek Taylor was heading publicity at the Beatles’ company, Apple Corps, and O’Dell was a low-level assistant in radio promotion. When Taylor suggested she come work at the Apple office in London, she dropped everything and moved halfway across the world. “Paul [McCartney] was there every day organising everything,” she says, on the phone from her home in Arizona. “One day he came into my office and said, ‘Chris, should we use paper towels or cloth towels in the bathroom?’ That’s how detailed he was.”\nO’Dell didn’t just stay at her desk: she joined the Beatles in the studio to sing on the epic climax to Hey Jude, was on the roof of Apple headquarters for their last ever live show, and even moved in with George Harrison and his wife – she was at their house when McCartney announced he wouldn’t be playing in the Beatles any more. “I came down for breakfast and every newspaper was on the table, saying: ‘Paul quits.’ It felt so abrupt and so unexpected. George went out in the garden, because that’s where he went for his peace. That afternoon, John [Lennon] came over and he and George spent quite a long time walking together.”\nEven after the band split, O’Dell remained in their orbit. “I got to know John better when he was with May Pang,” she says, referring to Lennon’s “lost weekend” in the mid-1970s. “We all lived in this beach house in Santa Monica. That was the closest I ever got to John. The time before, when he was with Yoko [Ono], they were really focused on what they were doing. So I didn’t know him as intimately – if I can use that word.”\nO’Dell might hesitate over that term because her relationship with another Beatle became a lot more intimate: in her memoir, published in 2009, she wrote candidly about her turbulent affair with Ringo Starr in the 1970s. But now she prefers to focus on how they’ve remained on good terms: “I could honestly say he’s a friend.” Like all her remarkable anecdotes, this is told with an easy-going charm. “We’ve stayed in touch up until probably the last couple of years. He’s the godfather to my son.”\nHarrison, though, is the Beatle she is most closely associated with among music fans, thanks to the song he wrote about her: Miss O’Dell, which gives the new documentary its name. The song came about in 1971, when they were both in Los Angeles. “George kept calling me,” O’Dell says. “But I didn’t want to go over. I thought there were going to be all these hangers-on.” Inspired by her absence, Harrison wrote the song, with its pleading refrain, “Why don’t you call me, Miss O’Dell?” It was the B-side to Give Me Love (Give Me Peace on Earth), which hit No 1 in the US. “I was really happy every time I heard the A-side because I thought, ‘I’m spinning around as the B-side right now,’” she says.\nO’Dell expands on this story (and many more) in the new documentary, which sees her return to key sites such as the Apple offices on London’s Wigmore Street and Saville Row. The film also reunites her with Harrison’s then-wife, Pattie Boyd, and Apple’s head of A&R, Peter Asher. But the documentary goes beyond her time with the Beatles, showing how she built on that remarkable first experience to develop an even more extraordinary CV.\nSoon after, she was working as an assistant to the Rolling Stones during the Exile on Main St sessions – she even appears on the artwork for the album. O’Dell once joked that her job description should have included: “Sleep with Mick [Jagger] whenever he asks.” But her memories of him now are more innocent. “He was like a brother,” she says.\nThat fraternal loyalty might have been on display when Jagger got O’Dell her first job on the road, working on the Rolling Stones’ tour in 1972. But some of her duties were a bit unconventional. “Keith [Richards] sent me on a drug run,” she recalls. “Back then, it was just called being an assistant.” She joined in with the debauchery, and one comment from Richards sticks in her mind all these years later. “He said, ‘You know, Chris, you can keep up with the guys.’ I thought that was a compliment then. Today I don’t see it quite that way.”\nGradually, O’Dell built a career as one of rock’s first female tour managers. With Crosby, Stills, Nash & Young, she gained her first experience managing travel logistics. “That was a nightmare,” she remembers wryly. But working for Linda Ronstadt in 1975 was a breakthrough, allowing her to be “in charge of everything” for the first time. She also brought some much-needed sensitivity to the often boorish and brutal world of tour management. “One time before Mother’s Day I went to Linda and asked, ‘Do you want me to send flowers to your mom?’ She said, ‘I’ve never had a tour manager who asked me that question.’”\nAnother highlight was working on Bob Dylan’s mid-1970s Rolling Thunder Revue. “I found Bob extremely fun to work with,” she says. “I remember, he and I were sitting at a table in a restaurant one time. We just talked about all kinds of different things. But never did his eyes leave mine. Ever. He is highly focused.”\nDuring the Revue, O’Dell became the subject of another song. “Joni Mitchell came on the tour and we got caught up in a bit of a love triangle with Sam Shepard. I’d already been sort of seeing him, and then she had a thing with him. This dude was married and had a wife back in California! So what was wrong with us?” she says, disbelievingly. “From that came the song Coyote about ‘a woman at home’ and ‘another woman down the hall’. I am that woman down the hall.”\nAs O’Dell remembers, the drama unfolded over just a few days, with Mitchell debuting the song at Gordon Lightfoot’s home during a stop on the tour (an incident captured in Martin Scorsese’s 2019 film Rolling Thunder Revue: A Bob Dylan Story). “I had heard she’d written this song and I thought, ‘I don’t know if I want to hear this!’” O’Dell recalls. But in her typical easy-going way, O’Dell seems to have been able to patch things up: “She and I became really good friends after that.”\nShe spent the latter part of her career as a tour manager in Germany in the 80s, adding more bands to her résumé including Led Zeppelin and Queen, but Echo and the Bunnymen proved to be her last job. “I was just like: I’m done. I don’t know who these people are and they want me to get them a towel and I probably am not gonna do that any more.”\nDrugs and alcohol had also taken their toll. “I had consumed quite a lot”, O’Dell says. She quit touring to get a master’s degree and became a therapist working with people with addictions: “I had been in recovery myself, so it was a natural transition.”\nShe gradually lost contact with many of the male rock stars she worked with, but is still “very much in touch with the women”. She recently launched a YouTube series chronicling her conversations with the likes of Suzi Ronson (David Bowie’s hair stylist) and her old friend May Pang. She plans to release some older interviews too, which she did in the 1980s with Linda McCartney and several other women, possibly as a documentary or book: “It was so amazing because they talked about how they really felt,” O’Dell says.\nNo matter what she does next, the Beatles will probably continue to dominate Chris O’Dell’s story. But, she says, “I worked with over 21 bands. That is something to be quite proud of – being the first woman to really operate in the music world on the road. I can look back and say, ‘That was a good legacy.’”",
      "author": "Christian Kriticos; Guardian staff reporter",
      "published_date": "2025-05-06",
      "word_count": 1482,
      "fetch_timestamp": "2025-08-20T15:50:40.798312",
      "metadata": {
        "char_count": 8475,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:50:40.798307",
        "access_status": "ok",
        "paywall": false
      }
    },
    {
      "url": "https://www.theguardian.com/music/2024/oct/27/joni-mitchell-amy-key-arrangements-in-blue-hollywood-bowl#comments",
      "source": "guardian",
      "artist_name": "Joni Mitchell",
      "title": "Writer Amy Key: ‘Knowing I’d finally hear Joni Mitchell sing live left me woozily panicked’",
      "content": "---\ntitle: Writer Amy Key: ‘Knowing I’d finally hear Joni Mitchell sing live left me woozily panicked’\nauthor: Amy Key; Guardian staff reporter\nurl: https://www.theguardian.com/music/2024/oct/27/joni-mitchell-amy-key-arrangements-in-blue-hollywood-bowl\nhostname: theguardian.com\ndescription: The author of an acclaimed memoir inspired by the singer’s album Blue fulfils her dream of seeing the reclusive star in a rare concert at the Hollywood Bowl\nsitename: The Guardian\ndate: 2024-10-27\ncategories: ['Music']\ntags: ['Joni Mitchell,Music,Culture,Pop and rock,Annie Lennox']\n---\nThe last time I was in Los Angeles, in February 2020, I had told a white lie. My taxi driver asked me what I was doing there. “I’m here to write about Joni Mitchell,” I said. I wanted to have a story. Earlier this month, I landed at LAX airport, returning to see Mitchell play at the Hollywood Bowl.\nIn 2020, the idea she would perform again seemed like fantasy. In 2015 she had an aneurysm that left her unable to speak or walk, and even before that, her public performances had been rare. But over the past few years, Mitchell has hosted musicians at her home for a “jam” in her living room. For a long time, she listened to others sing her songs to her, but then, gradually, she began to sing along. In 2022, she made a surprise appearance at the Newport folk festival in Rhode Island and, last year, headlined a show in Washington state. I failed to get tickets. In the days after, I’d watch videos of it people posted on Instagram, but with the sound down because it felt too painful to listen to, as though I was seeing the love of my life get married to someone else. I wanted to hold on to an idea I’d hear her for myself one day.\nAfter my first trip to Los Angeles, I began to write a book, Arrangements in Blue, inspired by the type of intimate self-examination that is at the heart of Mitchell’s music, especially her album Blue. Like millions of her fans, I felt – I feel – that Blue belongs to me, as if it is part of my own personal mode of emotional expression. It shaped my ideas of romantic love, of the life I believed I would lead and the woman I would grow to be. So when I wanted to look at the life I’d created and the one I wanted, it was Blue I turned to, using a lyric from each of the songs as a prompt to explore different parts of life. Since my book was published last spring, I’ve become, for some people, tethered to Mitchell. I’m sent news about her, links to interviews and clips. Readers tell me what she means to them – what their favourite song is. And some tell me they’ve listened to her for the first time: they’ve found Blue because of my book. I’m hardly the first writer to fall under her spell, but I’m glad to have contributed to a growing body of culture that celebrates her significance as an artist.\nThen, in January this year, she announced another show. I unfroze a credit card and bought – in a state of real panic and confusion, as though I was trying to escape the Crystal Maze – two tickets at the cost of £1,979.29. After, I was in shock. The combination of spending more money on a single thing than I’d ever done in my life and the near certainty I’d get to see Mitchell perform took hold of my nervous system in a way I couldn’t comprehend. How was I going to pay for all this and how would I survive the emotional debt this encounter with Mitchell might generate?\nOnce I land in LA, for the first few days I work in the courtyard of my hotel, my brain soothed by the sound of water running from the spout of a stonework lion into a small pond. Then I take a trip to the Getty museum. My Uber driver, a cheerful man named Gregory, asks me what I’m doing in LA. “I’m here to see Joni Mitchell at the Bowl,” I say. “I’m going to be writing about it for a newspaper back home.” “I’ve got chills!” he replies. “I’m so excited for you, you’re going to have the best time.” I can’t get my enthusiasm to match his. I realise I am feeling afraid.\nMy friend the Scottish poet Roddy Lumsden died just before my last trip to Los Angeles. He’d been ill for a long time, suffering from complications of alcohol addiction. That time is infused with grief: everything I saw and experienced was illuminated by or in the shadow of his absence and the confrontation his death had instigated. While I was standing outside Mitchell’s old house in Laurel Canyon on a kind of pilgrimage in 2020, for the first time I allowed myself to acknowledge a pain I’d been carrying. I had let the absence of romantic love become the organising principle of my life. I’d built my life around, and defined it through, lack. The trip was transformative: it opened up a space to rethink my life and ultimately it was the impetus to write Arrangements in Blue, which, while it isn’t a book about Mitchell, is a book that would not exist without her.\nThat I would tether my life so intimately to someone I’ve never met surprises me. I love to be a fan, but I’ve never signed up to fandom. I don’t get into fights about Mitchell on the internet and I am not a completist. There’s a lot of her oeuvre I’m yet to spend time with. But I have written a book inspired by a work of art created by a person who doesn’t know I exist. If that’s not fandom, then what is? The thought of sharing a space with her, the knowledge I would hear her speak and sing live gave me the woozy panicked feeling of waking from a dream where someone you’ve lost appears to be alive.\n“The things we want most we will never have,” wrote Roddy in a poem. Will I get what I want? Do I deserve to have it? When it comes, will I be able to experience it, inhabit the moment completely? This was where the fear was coming from, that I might not be equal to the opportunity. Maybe Roddy meant not that you don’t get the things you want most, but that if you do, the experience will not correspond to the desire you felt. A bride left disenchanted by her longed-for wedding day.\nSince my book came out I’ve been asked countless times: “Has Joni read it?” “I wish,” I say. “Oh God, I hope not,” I think. I hate the thought of my own art inspired by Mitchell finding its way to her and for her to hate it or, worse, be utterly indifferent. I don’t need her to know who I am, or what I think of her and how her music made me. A Mitchell lyric to hand for every heartbreak, for every sense of restlessness.\nThis is almost true. In the days leading up to the concert, I’ve daydreamed about what I might post about it on Instagram: a photo of Mitchell singing captioned: “This is my Eras tour.” There isn’t a Swiftie friendship bracelet exchange equivalent for the Mitchell fanbase, but I’ve brought my own merch. A customised jacket inspired by an original tour jacket from 1976. I commissioned someone to recreate the beautiful chain-stitched lettering on the back. At the show, I want people to say: “I love your jacket, where did you get it?” I want, I now realise with some small degree of shame, to identify myself as a big fan, attract Mitchell’s attention. My heart not just on my sleeve but embroidered on my back.\nOn my first trip to LA, I had a sense of wanting to trace Mitchell’s steps, as though being eye level with her experience might reveal something to me. I got more than I bargained for in that respect: it sent me careening into something more intimate than I could have imagined. But this time I have a strange sense of haunting myself, retracing my steps to check how I correspond with past me. LA keeps throwing cinematic narratives my way. Visiting a flea market, I stop at a box of old postcards and immediately find one, sent in 1934, with an ethereal illustration of the Hollywood Bowl at night. A couple of days later, I call an Uber and the driver gets out: it’s Gregory, from my trip to the Getty. He tells me that earlier that day he dropped a woman off in Laurel Canyon, saying she’d met Mitchell back in the day.\nThe day before the show, I meet up with photographer Dan Tuffs. We stop at the Canyon Country Store, a famous landmark from the 1960s and 70s, then take a detour so I can once more walk down Mitchell’s old street, site of my epiphany back in 2020.\nThe day of the concert, I have lunch with the writer Dolly Alderton (back in London, we met and became friends because we both love Mitchell). “How are you feeling?” We ask each other over our bloody marys. “I have a confusing sense of nervy excitement,” I say. “It’s like I am going to be doing a show.”\nI go with my friend Doug Powell, a poet who lives in San Francisco. We meet before the show and walk to the Bowl, slowly meeting others going in the same direction, a snaking crowd forming. I tune into bits of conversation. “I hope she plays Morning Morgantown,” a man says. “I think she loves mozzarella sticks,” a girl says. “She loves mozzarella sticks?” her companion says in reply. “Yeah, well I think she’s definitely a vegetarian.” “Look at that jacket,” a woman says, and I wonder if she’s talking about me.\nTaking our seats at the Bowl, I am surprised to find mine is slap bang in the middle: I will be eye to eye with Mitchell even if I can’t see her face from that distance. In the row behind us is a family, in front a lesbian couple; people with pizzas and drinks, wearing merch while holding on to their new merch.\nThe house lights go down and the stage begins to revolve. We all get to our feet. The big screen shows Mitchell on her throne, wearing purple velvet and her hair in plaits under a beret. Her skin seemingly lit from within, she holds a walking stick tipped with a diamond-encrusted cat’s head like a sceptre. Beside her, a table with a stained-glass Tiffany lamp. We are invited into her living room, all on the same level, seated, but spiritually at her feet.\nShe opens with two songs I don’t know, Be Cool and Harlem in Havana. It doesn’t matter. I almost need that dislocation from my personal Mitchell canon to adjust to what is happening: I am really there, she is really there. But the third song she plays is Hejira, the one I had dared to hope for. “So now I’m returning to myself,” she sings, “These things that you and I suppressed.” The tears come then, silent and steady. She sings Coyote, mischievous and sexy. I think of a young woman, Íde, who I met last year at a book event, and how happy she must be – I know she is somewhere in the audience – with her “No regrets Coyote” tattoo.\nThere is a singalong to Carey, reminding me of when I visited Matala in Crete, where Mitchell met Cary Raditz, and felt too self-conscious to sing along when the tour guide played the song on the coach. This time, I stand up with everyone else, add my voice to theirs. Closing her first set, she sings Both Sides Now; the moon rises to the right of the stage, inching over the hills as she begins and finishing high above the Bowl as she takes us into the interval. As counterpoint to her incredibly rich, strong voice, I can hear a woman behind me weeping uncontrollably.\nThe second half is more bombastic: out come the special guests (Doug leaps out of his seat at the sight of Annie Lennox). They begin with a barnstorming Big Yellow Taxi, a song I can ordinarily take or leave but find myself swept up by. A thrilling Raised on Robbery, followed by California, sung mainly by Marcus Mumford but redeemed for me by Joni’s spontaneous interjections. Hearing her ask an audience if they will “take me as I am” moves me deeply. The distance Mitchell has travelled between recording that song in her 20s and singing it to a rapt audience at 80 years old is so gorgeously felt in her voice. Every lyric and evolution of her register is enriched by the journey she has been on, and it feels a privilege to get to hear it: hear how life – its pain, glory, futility, rancour, joy – accumulates.\nAfter Dog Eat Dog, someone shouts: “Fuck Donald Trump” and she replies: “I love that song.” Throughout, she chuckles and laughs, letting her pleasure show. During Shine, I scribble down a lyric – “They travelled inward / Past themselves” – because it feels important to remember. It’s where I need to go. To quote Come in from the Cold: “I longed to lose control.” I want to know I can just love Mitchell and (to quote an earlier song) “forget about me”.\nI’m left wondering how you metabolise profound experience. I’m not sure you can in its immediate wake. That night with Mitchell was so intimately mine yet shared with almost 18,000 others. I was just a biggest fan among all her biggest fans. It has entered me in a form beyond language, infused my cells. I’m rendered daft and incapable other than the most cliched expression. If I feel overwhelmed, then good. I’m grateful. How wonderful to know what something has meant to you with no need to persuade someone of it.\nOn the postcard I found at the flea market, the sender wrote: “It was thrilling sitting there with just the stars for a roof.” Twice, when I looked up at the night sky above the Bowl, I saw a shooting star.\n-\nArrangements in Blue by Amy Key is published by Vintage (£10.99). To support the Guardian and Observer order your copy at guardianbookshop.com. Delivery charges may apply",
      "author": "Amy Key; Guardian staff reporter",
      "published_date": "2024-10-27",
      "word_count": 2428,
      "fetch_timestamp": "2025-08-20T15:50:40.818954",
      "metadata": {
        "char_count": 13129,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:50:40.818949",
        "access_status": "ok",
        "paywall": false
      }
    },
    {
      "url": "https://www.theguardian.com/music/2024/oct/27/joni-mitchell-amy-key-arrangements-in-blue-hollywood-bowl",
      "source": "guardian",
      "artist_name": "Joni Mitchell",
      "title": "Writer Amy Key: ‘Knowing I’d finally hear Joni Mitchell sing live left me woozily panicked’",
      "content": "---\ntitle: Writer Amy Key: ‘Knowing I’d finally hear Joni Mitchell sing live left me woozily panicked’\nauthor: Amy Key; Guardian staff reporter\nurl: https://www.theguardian.com/music/2024/oct/27/joni-mitchell-amy-key-arrangements-in-blue-hollywood-bowl\nhostname: theguardian.com\ndescription: The author of an acclaimed memoir inspired by the singer’s album Blue fulfils her dream of seeing the reclusive star in a rare concert at the Hollywood Bowl\nsitename: The Guardian\ndate: 2024-10-27\ncategories: ['Music']\ntags: ['Joni Mitchell,Music,Culture,Pop and rock,Annie Lennox']\n---\nThe last time I was in Los Angeles, in February 2020, I had told a white lie. My taxi driver asked me what I was doing there. “I’m here to write about Joni Mitchell,” I said. I wanted to have a story. Earlier this month, I landed at LAX airport, returning to see Mitchell play at the Hollywood Bowl.\nIn 2020, the idea she would perform again seemed like fantasy. In 2015 she had an aneurysm that left her unable to speak or walk, and even before that, her public performances had been rare. But over the past few years, Mitchell has hosted musicians at her home for a “jam” in her living room. For a long time, she listened to others sing her songs to her, but then, gradually, she began to sing along. In 2022, she made a surprise appearance at the Newport folk festival in Rhode Island and, last year, headlined a show in Washington state. I failed to get tickets. In the days after, I’d watch videos of it people posted on Instagram, but with the sound down because it felt too painful to listen to, as though I was seeing the love of my life get married to someone else. I wanted to hold on to an idea I’d hear her for myself one day.\nAfter my first trip to Los Angeles, I began to write a book, Arrangements in Blue, inspired by the type of intimate self-examination that is at the heart of Mitchell’s music, especially her album Blue. Like millions of her fans, I felt – I feel – that Blue belongs to me, as if it is part of my own personal mode of emotional expression. It shaped my ideas of romantic love, of the life I believed I would lead and the woman I would grow to be. So when I wanted to look at the life I’d created and the one I wanted, it was Blue I turned to, using a lyric from each of the songs as a prompt to explore different parts of life. Since my book was published last spring, I’ve become, for some people, tethered to Mitchell. I’m sent news about her, links to interviews and clips. Readers tell me what she means to them – what their favourite song is. And some tell me they’ve listened to her for the first time: they’ve found Blue because of my book. I’m hardly the first writer to fall under her spell, but I’m glad to have contributed to a growing body of culture that celebrates her significance as an artist.\nThen, in January this year, she announced another show. I unfroze a credit card and bought – in a state of real panic and confusion, as though I was trying to escape the Crystal Maze – two tickets at the cost of £1,979.29. After, I was in shock. The combination of spending more money on a single thing than I’d ever done in my life and the near certainty I’d get to see Mitchell perform took hold of my nervous system in a way I couldn’t comprehend. How was I going to pay for all this and how would I survive the emotional debt this encounter with Mitchell might generate?\nOnce I land in LA, for the first few days I work in the courtyard of my hotel, my brain soothed by the sound of water running from the spout of a stonework lion into a small pond. Then I take a trip to the Getty museum. My Uber driver, a cheerful man named Gregory, asks me what I’m doing in LA. “I’m here to see Joni Mitchell at the Bowl,” I say. “I’m going to be writing about it for a newspaper back home.” “I’ve got chills!” he replies. “I’m so excited for you, you’re going to have the best time.” I can’t get my enthusiasm to match his. I realise I am feeling afraid.\nMy friend the Scottish poet Roddy Lumsden died just before my last trip to Los Angeles. He’d been ill for a long time, suffering from complications of alcohol addiction. That time is infused with grief: everything I saw and experienced was illuminated by or in the shadow of his absence and the confrontation his death had instigated. While I was standing outside Mitchell’s old house in Laurel Canyon on a kind of pilgrimage in 2020, for the first time I allowed myself to acknowledge a pain I’d been carrying. I had let the absence of romantic love become the organising principle of my life. I’d built my life around, and defined it through, lack. The trip was transformative: it opened up a space to rethink my life and ultimately it was the impetus to write Arrangements in Blue, which, while it isn’t a book about Mitchell, is a book that would not exist without her.\nThat I would tether my life so intimately to someone I’ve never met surprises me. I love to be a fan, but I’ve never signed up to fandom. I don’t get into fights about Mitchell on the internet and I am not a completist. There’s a lot of her oeuvre I’m yet to spend time with. But I have written a book inspired by a work of art created by a person who doesn’t know I exist. If that’s not fandom, then what is? The thought of sharing a space with her, the knowledge I would hear her speak and sing live gave me the woozy panicked feeling of waking from a dream where someone you’ve lost appears to be alive.\n“The things we want most we will never have,” wrote Roddy in a poem. Will I get what I want? Do I deserve to have it? When it comes, will I be able to experience it, inhabit the moment completely? This was where the fear was coming from, that I might not be equal to the opportunity. Maybe Roddy meant not that you don’t get the things you want most, but that if you do, the experience will not correspond to the desire you felt. A bride left disenchanted by her longed-for wedding day.\nSince my book came out I’ve been asked countless times: “Has Joni read it?” “I wish,” I say. “Oh God, I hope not,” I think. I hate the thought of my own art inspired by Mitchell finding its way to her and for her to hate it or, worse, be utterly indifferent. I don’t need her to know who I am, or what I think of her and how her music made me. A Mitchell lyric to hand for every heartbreak, for every sense of restlessness.\nThis is almost true. In the days leading up to the concert, I’ve daydreamed about what I might post about it on Instagram: a photo of Mitchell singing captioned: “This is my Eras tour.” There isn’t a Swiftie friendship bracelet exchange equivalent for the Mitchell fanbase, but I’ve brought my own merch. A customised jacket inspired by an original tour jacket from 1976. I commissioned someone to recreate the beautiful chain-stitched lettering on the back. At the show, I want people to say: “I love your jacket, where did you get it?” I want, I now realise with some small degree of shame, to identify myself as a big fan, attract Mitchell’s attention. My heart not just on my sleeve but embroidered on my back.\nOn my first trip to LA, I had a sense of wanting to trace Mitchell’s steps, as though being eye level with her experience might reveal something to me. I got more than I bargained for in that respect: it sent me careening into something more intimate than I could have imagined. But this time I have a strange sense of haunting myself, retracing my steps to check how I correspond with past me. LA keeps throwing cinematic narratives my way. Visiting a flea market, I stop at a box of old postcards and immediately find one, sent in 1934, with an ethereal illustration of the Hollywood Bowl at night. A couple of days later, I call an Uber and the driver gets out: it’s Gregory, from my trip to the Getty. He tells me that earlier that day he dropped a woman off in Laurel Canyon, saying she’d met Mitchell back in the day.\nThe day before the show, I meet up with photographer Dan Tuffs. We stop at the Canyon Country Store, a famous landmark from the 1960s and 70s, then take a detour so I can once more walk down Mitchell’s old street, site of my epiphany back in 2020.\nThe day of the concert, I have lunch with the writer Dolly Alderton (back in London, we met and became friends because we both love Mitchell). “How are you feeling?” We ask each other over our bloody marys. “I have a confusing sense of nervy excitement,” I say. “It’s like I am going to be doing a show.”\nI go with my friend Doug Powell, a poet who lives in San Francisco. We meet before the show and walk to the Bowl, slowly meeting others going in the same direction, a snaking crowd forming. I tune into bits of conversation. “I hope she plays Morning Morgantown,” a man says. “I think she loves mozzarella sticks,” a girl says. “She loves mozzarella sticks?” her companion says in reply. “Yeah, well I think she’s definitely a vegetarian.” “Look at that jacket,” a woman says, and I wonder if she’s talking about me.\nTaking our seats at the Bowl, I am surprised to find mine is slap bang in the middle: I will be eye to eye with Mitchell even if I can’t see her face from that distance. In the row behind us is a family, in front a lesbian couple; people with pizzas and drinks, wearing merch while holding on to their new merch.\nThe house lights go down and the stage begins to revolve. We all get to our feet. The big screen shows Mitchell on her throne, wearing purple velvet and her hair in plaits under a beret. Her skin seemingly lit from within, she holds a walking stick tipped with a diamond-encrusted cat’s head like a sceptre. Beside her, a table with a stained-glass Tiffany lamp. We are invited into her living room, all on the same level, seated, but spiritually at her feet.\nShe opens with two songs I don’t know, Be Cool and Harlem in Havana. It doesn’t matter. I almost need that dislocation from my personal Mitchell canon to adjust to what is happening: I am really there, she is really there. But the third song she plays is Hejira, the one I had dared to hope for. “So now I’m returning to myself,” she sings, “These things that you and I suppressed.” The tears come then, silent and steady. She sings Coyote, mischievous and sexy. I think of a young woman, Íde, who I met last year at a book event, and how happy she must be – I know she is somewhere in the audience – with her “No regrets Coyote” tattoo.\nThere is a singalong to Carey, reminding me of when I visited Matala in Crete, where Mitchell met Cary Raditz, and felt too self-conscious to sing along when the tour guide played the song on the coach. This time, I stand up with everyone else, add my voice to theirs. Closing her first set, she sings Both Sides Now; the moon rises to the right of the stage, inching over the hills as she begins and finishing high above the Bowl as she takes us into the interval. As counterpoint to her incredibly rich, strong voice, I can hear a woman behind me weeping uncontrollably.\nThe second half is more bombastic: out come the special guests (Doug leaps out of his seat at the sight of Annie Lennox). They begin with a barnstorming Big Yellow Taxi, a song I can ordinarily take or leave but find myself swept up by. A thrilling Raised on Robbery, followed by California, sung mainly by Marcus Mumford but redeemed for me by Joni’s spontaneous interjections. Hearing her ask an audience if they will “take me as I am” moves me deeply. The distance Mitchell has travelled between recording that song in her 20s and singing it to a rapt audience at 80 years old is so gorgeously felt in her voice. Every lyric and evolution of her register is enriched by the journey she has been on, and it feels a privilege to get to hear it: hear how life – its pain, glory, futility, rancour, joy – accumulates.\nAfter Dog Eat Dog, someone shouts: “Fuck Donald Trump” and she replies: “I love that song.” Throughout, she chuckles and laughs, letting her pleasure show. During Shine, I scribble down a lyric – “They travelled inward / Past themselves” – because it feels important to remember. It’s where I need to go. To quote Come in from the Cold: “I longed to lose control.” I want to know I can just love Mitchell and (to quote an earlier song) “forget about me”.\nI’m left wondering how you metabolise profound experience. I’m not sure you can in its immediate wake. That night with Mitchell was so intimately mine yet shared with almost 18,000 others. I was just a biggest fan among all her biggest fans. It has entered me in a form beyond language, infused my cells. I’m rendered daft and incapable other than the most cliched expression. If I feel overwhelmed, then good. I’m grateful. How wonderful to know what something has meant to you with no need to persuade someone of it.\nOn the postcard I found at the flea market, the sender wrote: “It was thrilling sitting there with just the stars for a roof.” Twice, when I looked up at the night sky above the Bowl, I saw a shooting star.\n-\nArrangements in Blue by Amy Key is published by Vintage (£10.99). To support the Guardian and Observer order your copy at guardianbookshop.com. Delivery charges may apply",
      "author": "Amy Key; Guardian staff reporter",
      "published_date": "2024-10-27",
      "word_count": 2428,
      "fetch_timestamp": "2025-08-20T15:50:40.837687",
      "metadata": {
        "char_count": 13129,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:50:40.837683",
        "access_status": "ok",
        "paywall": false
      }
    },
    {
      "url": "https://www.theguardian.com/music/2024/oct/21/joni-mitchell-lets-rip-at-donald-trump-at-rarity-laden-us-concert",
      "source": "guardian",
      "artist_name": "Joni Mitchell",
      "title": "Joni Mitchell lets rip at Donald Trump at rarity-laden US concert",
      "content": "---\ntitle: Joni Mitchell lets rip at Donald Trump at rarity-laden US concert\nauthor: Laura Snapes\nurl: https://www.theguardian.com/music/2024/oct/21/joni-mitchell-lets-rip-at-donald-trump-at-rarity-laden-us-concert\nhostname: theguardian.com\ndescription: Performing in Los Angeles, the singer encouraged US citizens to ‘get out and vote’ – and played rarely heard political songs such as Dog Eat Dog\nsitename: The Guardian\ndate: 2024-10-21\ncategories: ['Music']\ntags: ['Joni Mitchell,Donald Trump,US news,Music,Culture,Pop and rock,US elections 2024']\n---\nJoni Mitchell has made her voice heard in the upcoming US election, responding: “Fuck Donald Trump!” to an audience member who yelled an insult about the Republican presidential candidate.\n“I love that song,” Mitchell continued – presumably a reference to the 2016 YG song FDT.\nPerforming her first headline concert in Los Angeles in 24 years on Saturday, Mitchell, 80, said: “Everybody get out and vote. This is an important one. I wish I could vote – I’m Canadian. I’m one of those lousy immigrants.”\nMitchell’s comments came after she performed the political title track of her 1985 album Dog Eat Dog for the first time since its year of release. In the song she sings of: “Holy hope in the hands of / Snakebite evangelists and racketeers / And big wig financiers.” After the latter line, she ad libbed “like Donald Trump.”\nAt the self-styled “Joni Jam”, across two nights at the Hollywood Bowl, Mitchell performed with musicians including Brandi Carlile, Wendy & Lisa, Allison Russell, Robin Pecknold of Fleet Foxes, Marcus Mumford, Annie Lennox – on Ladies of the Canyon – Jacob Collier and Jon Batiste.\nShe also gave newer songs their live debut, with If I Had a Heart, from 2007’s Shine, and The Sire of Sorrow, from 1994’s Turbulent Indigo: the former castigates “Holy war / Genocide / Suicide”, while the latter speaks of losing “all taste for life”.\nThe concerts come two years after Mitchell’s surprise appearance at the 2022 Newport folk festival – her return to live performance after experiencing a brain aneurysm in 2015 that left her unable to speak or walk.\nShe also covered Elton John’s I’m Still Standing – but remained seated throughout the concert, and changed a line accordingly: “I’m still sitting after all this time,” she sang.\nMitchell’s last original album was Shine; she is in the midst of an archival reissues project highlighting remastered and unreleased material, the last of which was The Asylum Albums (1976-1980), released in June.",
      "author": "Laura Snapes",
      "published_date": "2024-10-21",
      "word_count": 395,
      "fetch_timestamp": "2025-08-20T15:50:40.851956",
      "metadata": {
        "char_count": 2521,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:50:40.851951",
        "access_status": "ok",
        "paywall": false
      }
    },
    {
      "url": "https://www.theguardian.com/music/2024/mar/22/joni-mitchell-court-and-spark-reviewed-1974",
      "source": "guardian",
      "artist_name": "Joni Mitchell",
      "title": "Joni Mitchell’s Court and Spark reviewed – archive, March 1974",
      "content": "---\ntitle: Joni Mitchell’s Court and Spark reviewed – archive, March 1974\nauthor: Robin Denselow\nurl: https://www.theguardian.com/music/2024/mar/22/joni-mitchell-court-and-spark-reviewed-1974\nhostname: theguardian.com\ndescription: 22 March 1974: The album shows how rock is growing up, gracefully, maturely, and dealing with the concern of a now slightly ageing generation\nsitename: The Guardian\ndate: 2024-03-22\ncategories: ['Music']\ntags: ['Joni Mitchell,Pop and rock,Music']\n---\nFrom being the folksy best friend of anyone who was anything in the West Coast music scene, Joni Mitchell has gradually and unevenly developed into a songwriter of considerable stature. Her sixth and best album to date, Court and Spark (Asylum), is currently the top seller in America, which is mildly surprising: it is both too solemn and too good for that.\nLike the rest of her West Coast singer-songwriter mates (from Graham Nash through to Jackson Browne) she bases her songs around herself, her worries and experiences. What sets her work aside from the egocentric tedium that such a style can produce is both the sheer quality of her writing and performing, and her ability to deal with private thoughts in a public way, make personal experiences of general significance.\nThe album shows how rock is growing up, gracefully, maturely, and a little sadly, dealing with the concern of a now slightly ageing generation. The songs are of indecision, the inability to act or get away, tension and unease at a party, or just waiting for a friend who doesn’t turn up. Trivial experiences, many of them, but always with a hint of something seriously wrong behind them, whether alienation, loneliness or plain world-weariness.\nHer writing is sometimes shatteringly honest, imaginative and with an underlying desperation. Down To You starts with the observation that “everything comes and goes, marked by lovers and styles of clothes” and moves off into a stark and evocatively understated impression of brief midnight passion followed by equally bleak non-communication with the world in general the next morning. The Same Situation is even more revealing and sad, with thoughts on yet another highly experienced lover and his problems (“like the church, like a cop, like a mother, you want me to be truthful”), and her own situation “caught in my struggle for higher achievement and my search for love that doesn’t seem to cease.”\nAnother song deals with the problems of fame. The title track hints back to For Free (on the Ladies of the Canyon album) in its concern for the ideals of a street musician who has the freedom that she has lost, stuck in Los Angeles “the city of the fallen angels.”\nMiss Mitchell leads the kind of liberated, rich, glamorous; life that many mere mortals would envy. Her hang-ups are worthy of our note not because of any insight they give to her lifestyle, but because of the way she treats them. Her musicianship is as fine as her lyrics; her voice has lightness as well as intensity and copes admirably with the musical gymnastics of her writing, Her piano playing backs it up well, as do the predictably famous session musicians (everyone from Robbie Robertson to Jose Feliciano).\nMost of what they have to play is slow and melodic, with two exceptions right at the end of the album. Raised on Robbery is a successful all-out rocker (with witty but still bleak lyrics), while the old Annie Ross hit Twisted is the only disappointment. Joni Mitchell can’t sing jazz, and this curious track sounds all the more wrong after her own major songs.",
      "author": "Robin Denselow",
      "published_date": "2024-03-22",
      "word_count": 580,
      "fetch_timestamp": "2025-08-20T15:50:40.868202",
      "metadata": {
        "char_count": 3553,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:50:40.868198",
        "access_status": "ok",
        "paywall": false
      }
    },
    {
      "url": "https://www.theguardian.com/music/2024/mar/22/joni-mitchell-court-and-spark-reviewed-1974#comments",
      "source": "guardian",
      "artist_name": "Joni Mitchell",
      "title": "Joni Mitchell’s Court and Spark reviewed – archive, March 1974",
      "content": "---\ntitle: Joni Mitchell’s Court and Spark reviewed – archive, March 1974\nauthor: Robin Denselow\nurl: https://www.theguardian.com/music/2024/mar/22/joni-mitchell-court-and-spark-reviewed-1974\nhostname: theguardian.com\ndescription: 22 March 1974: The album shows how rock is growing up, gracefully, maturely, and dealing with the concern of a now slightly ageing generation\nsitename: The Guardian\ndate: 2024-03-22\ncategories: ['Music']\ntags: ['Joni Mitchell,Pop and rock,Music']\n---\nFrom being the folksy best friend of anyone who was anything in the West Coast music scene, Joni Mitchell has gradually and unevenly developed into a songwriter of considerable stature. Her sixth and best album to date, Court and Spark (Asylum), is currently the top seller in America, which is mildly surprising: it is both too solemn and too good for that.\nLike the rest of her West Coast singer-songwriter mates (from Graham Nash through to Jackson Browne) she bases her songs around herself, her worries and experiences. What sets her work aside from the egocentric tedium that such a style can produce is both the sheer quality of her writing and performing, and her ability to deal with private thoughts in a public way, make personal experiences of general significance.\nThe album shows how rock is growing up, gracefully, maturely, and a little sadly, dealing with the concern of a now slightly ageing generation. The songs are of indecision, the inability to act or get away, tension and unease at a party, or just waiting for a friend who doesn’t turn up. Trivial experiences, many of them, but always with a hint of something seriously wrong behind them, whether alienation, loneliness or plain world-weariness.\nHer writing is sometimes shatteringly honest, imaginative and with an underlying desperation. Down To You starts with the observation that “everything comes and goes, marked by lovers and styles of clothes” and moves off into a stark and evocatively understated impression of brief midnight passion followed by equally bleak non-communication with the world in general the next morning. The Same Situation is even more revealing and sad, with thoughts on yet another highly experienced lover and his problems (“like the church, like a cop, like a mother, you want me to be truthful”), and her own situation “caught in my struggle for higher achievement and my search for love that doesn’t seem to cease.”\nAnother song deals with the problems of fame. The title track hints back to For Free (on the Ladies of the Canyon album) in its concern for the ideals of a street musician who has the freedom that she has lost, stuck in Los Angeles “the city of the fallen angels.”\nMiss Mitchell leads the kind of liberated, rich, glamorous; life that many mere mortals would envy. Her hang-ups are worthy of our note not because of any insight they give to her lifestyle, but because of the way she treats them. Her musicianship is as fine as her lyrics; her voice has lightness as well as intensity and copes admirably with the musical gymnastics of her writing, Her piano playing backs it up well, as do the predictably famous session musicians (everyone from Robbie Robertson to Jose Feliciano).\nMost of what they have to play is slow and melodic, with two exceptions right at the end of the album. Raised on Robbery is a successful all-out rocker (with witty but still bleak lyrics), while the old Annie Ross hit Twisted is the only disappointment. Joni Mitchell can’t sing jazz, and this curious track sounds all the more wrong after her own major songs.",
      "author": "Robin Denselow",
      "published_date": "2024-03-22",
      "word_count": 580,
      "fetch_timestamp": "2025-08-20T15:50:40.884314",
      "metadata": {
        "char_count": 3553,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:50:40.884309",
        "access_status": "ok",
        "paywall": false
      }
    },
    {
      "url": "https://www.theguardian.com/music/2024/mar/22/joni-mitchell-follows-neil-young-in-returning-her-music-to-spotify",
      "source": "guardian",
      "artist_name": "Joni Mitchell",
      "title": "Joni Mitchell follows Neil Young in returning her music to Spotify",
      "content": "---\ntitle: Joni Mitchell follows Neil Young in returning her music to Spotify\nauthor: Laura Snapes\nurl: https://www.theguardian.com/music/2024/mar/22/joni-mitchell-follows-neil-young-in-returning-her-music-to-spotify\nhostname: theguardian.com\ndescription: Mitchell originally acted in solidarity with Young’s protest over the spread of vaccine misinformation on the platform, which he has now ended\nsitename: The Guardian\ndate: 2024-03-22\ncategories: ['Music']\ntags: ['Joni Mitchell,Music,Culture,Neil Young,Spotify,Music streaming,Digital music and audio']\n---\nJoni Mitchell’s music has returned to Spotify more than two years after she left the streaming platform in solidarity with Neil Young’s protest over it hosting anti-vax content.\nMitchell made no comment about the return of her music, though the move comes a week after Young said he was putting his music back on Spotify after the platform ended its exclusivity deal with Joe Rogan’s podcast, which Young – along with 270 scientists and healthcare professionals – accused of spreading misinformation about Covid vaccines.\nSince February, The Joe Rogan Experience podcast has become available on other platforms including Apple Podcasts, YouTube and Amazon Music.\nOf his return to Spotify, Young wrote: “My decision comes as music services Apple and Amazon have started serving the same disinformation podcast features I had opposed at Spotify. I cannot just leave Apple and Amazon, like I did Spotify, because my music would have very little streaming outlet to music lovers at all, so I have returned to Spotify.”\nThe noted audio aficionado lamented the low-quality sound available on Spotify – “I hope all you millions of Spotify users enjoy my songs! They will now all be there for you except for the full sound we created” – and encouraged the service to introduce a high-definition tier in the vein of competitors Qobuz and Tidal.\nFor Mitchell, it is the latest move in a renewed phase of her career. In July 2022, she returned to live performance for the first time since she suffered an aneurysm in 2015. Last month, she performed at the Grammys for the first time; earlier this week, she covered I’m Still Standing with Brandi Carlile and Annie Lennox at the Gershwin prize concert in honour of Elton John and Bernie Taupin. Mitchell herself won the Gershwin prize last year.",
      "author": "Laura Snapes",
      "published_date": "2024-03-22",
      "word_count": 358,
      "fetch_timestamp": "2025-08-20T15:50:40.900103",
      "metadata": {
        "char_count": 2345,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:50:40.900098",
        "access_status": "ok",
        "paywall": false
      }
    }
  ],
  "total_articles": 8,
  "total_words": 9002,
  "extracted_at": "2025-08-20T15:50:40.900556",
  "urls_processed": [
    "https://www.theguardian.com/music/2024/oct/21/joni-mitchell-jam-hollywood-bowl-review",
    "https://www.theguardian.com/music/2025/may/06/chris-odell-drug-runs-the-stones-love-triangle-joni-mitchell-george-harrison-",
    "https://www.theguardian.com/music/2024/oct/27/joni-mitchell-amy-key-arrangements-in-blue-hollywood-bowl#comments",
    "https://www.theguardian.com/music/2024/oct/27/joni-mitchell-amy-key-arrangements-in-blue-hollywood-bowl",
    "https://www.theguardian.com/music/2024/oct/21/joni-mitchell-lets-rip-at-donald-trump-at-rarity-laden-us-concert",
    "https://www.theguardian.com/music/2024/mar/22/joni-mitchell-court-and-spark-reviewed-1974",
    "https://www.theguardian.com/music/2024/mar/22/joni-mitchell-court-and-spark-reviewed-1974#comments",
    "https://www.theguardian.com/music/2024/mar/22/joni-mitchell-follows-neil-young-in-returning-her-music-to-spotify"
  ]
}