{
  "artist_name": "Justin Bieber",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/justin-bieber-swag/",
      "source": "pitchfork",
      "artist_name": "Justin Bieber",
      "title": "Justin Bieber: SWAG",
      "content": "---\ntitle: Justin Bieber: SWAG\nauthor: Rawiya Kameir\nurl: https://pitchfork.com/reviews/albums/justin-bieber-swag/\nhostname: pitchfork.com\ndescription: Read Rawiya Kameir’s review of the album.\nsitename: Pitchfork\ndate: 2025-07-16\n---\nBeyoncé was on the cusp of 30 when she announced, in early 2011, that she had functionally shitcanned her father and longtime manager, Mathew Knowles. On one side of the gully was 15 years and “Single Ladies.” On the other was, well, you know. Managing her own affairs turned the pop star into an icon. A few years later, Rihanna, at 27, executed a similar self-rescue by establishing her own management infrastructure and released ANTI, an album so singular it made pivoting to billionaireship easier than following it up. Reclaiming control seemed to have fared well for her, too.\nI guess what I’m saying is: congratulations to Justin Bieber on his graduation—liberation, even—from the Scooter Braun academy for latter-day pop stars. SWAG, his seventh album and first sans Braun, was released within a day of the news last week that the pair had finally formalized the conclusion of their business affairs with a $31.5 million settlement. (Their personal disentanglement, and those of several other Bieber relationships dating back just as long, have been closely tracked in the form of mutual Instagram unfollowings.) Careful calculus or divine timing? No matter. Turns out that, at 31, Bieber may be in the spring of his own reclamations.\nA few weeks before billboards popped up to announce SWAG’s imminent arrival, Bieber got caught up in yet another battle with a scrum of paparazzi. This particular interaction, though, seemed to magnify two of his most enduring public issues: the apparent fragility of his psyche and the complexities of his relationship, as an R&B-singing white boy, to race. He wields a jarring mash-up of two pieces of slang: clock it and stand on business. Though neither is new, both have mushroomed into ubiquity over the past year, reaching far beyond their origins in, respectively, Black and Latine ballroom communities and Southern variants of AAVE. The clip went viral, mostly because Bieber misuses the former—he turns an imperative with an implied you (“clock it”) into a negative present participle (“It’s not clocking to you”)—and his awkward intonation of the latter.\nBut there are layers even to this. In its correct usage, “clock it” is often accompanied by a hand gesture, in which the middle finger extends to meet the thumb and taps it quickly and emphatically. What few seem to have clocked is that the gesture that has accompanied the phrase’s sudden ubiquity is itself a Bieberesque goof: Across TikTok, the wrong finger tends to tap the thumb. The original gesture has been fully subsumed by its corruptor. Bieber has a knack, however unintentional, for illuminating existing cultural norms by being accused of them.",
      "author": "Rawiya Kameir",
      "published_date": "2025-07-16",
      "word_count": 462,
      "fetch_timestamp": "2025-08-19T19:47:38.969712",
      "metadata": {
        "char_count": 2901,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:47:38.969692"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/justin-bieber-justice/",
      "source": "pitchfork",
      "artist_name": "Justin Bieber",
      "title": "Justin Bieber: Justice",
      "content": "---\ntitle: Justin Bieber: Justice\nauthor: Rawiya Kameir\nurl: https://pitchfork.com/reviews/albums/justin-bieber-justice/\nhostname: pitchfork.com\ndescription: Read Rawiya Kameir’s review of the album.\nsitename: Pitchfork\ndate: 2021-03-23\n---\nJustin Bieber’s decision to open his sixth album, Justice, with a sample of a Martin Luther King Jr. speech—and to plop in another one halfway through—is revealing, but perhaps not for the reasons he intended. In the half-century following Dr. King’s assassination, liberalism has turned him, a revolutionary figure once hated by the majority of white Americans for his commitment to racial, religious, and economic justice, into a convenient accessory through which to signal a vague, corporation-safe message in support of Black people. And if Bieber is anything, he is a corporation; perhaps that is why I don’t find it especially jarring to hear King’s exhortation for radical sacrifice juxtaposed with a song about being horny enough to walk through fire. On Instagram, I see this style of cognitive dissonance, or willful cynicism, deployed almost daily by media companies, influencers and celebrities, people I knew in college, even an Etsy plant store. This is just how we communicate now. Leave it to Bieber to, however unintentionally, hold up a mirror to a culture that doesn’t want to see itself.\nParadoxically, behind the cringeworthy MLK controversy is a surprisingly compelling record, an earnest pop album that unearths the charisma and agility that helped make him a star to begin with. Bieber, now 27, seems to be having fun for the first time since his well-documented pubescence. After all, he is in something like the spring solstice of his life, having emerged from a period of distress that included heavy drug use and suicidal ideation into a well-adjusted millennial adulthood, grounded in the joys of marriage and the salvation of Christ. Whereas his last album, 2020’s R&B-led Changes, was burdened by the compulsion to prove to an antagonistic public that he’s no longer the baby-faced teen they first met nor the tempestuous shithead he soon became, Justice shows Bieber experimenting with ideas that are new to him, even if they are not new to the pop landscape.\nIt’s buoyed by surprises at every turn, but never loses focus. The stadium jaunt “Die for You,” featuring Floridian pop parvenu Dominic Fike, ventures into pop-rock territory, a completely novel mode for Bieber. The synth-pop single “Hold On” begins as a ballad until the beat drops and curls around a serpentine bassline. “Ghost,” a song about grief, launches with a UK garage-lite beat, swells into a colossal hook, and eventually settles over a folky acoustic guitar. There might not be a hit on here the size of “Sorry,” but that's partly by design: This is Bieber's smoothest album-length statement to date.",
      "author": "Rawiya Kameir",
      "published_date": "2021-03-23",
      "word_count": 451,
      "fetch_timestamp": "2025-08-19T19:47:39.005430",
      "metadata": {
        "char_count": 2846,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:47:39.005422"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/justin-bieber-ariana-grande-stuck-with-u/",
      "source": "pitchfork",
      "artist_name": "Justin Bieber",
      "title": "Ariana Grande / Justin Bieber: “Stuck With U”",
      "content": "---\ntitle: Ariana Grande / Justin Bieber: “Stuck With U”\nauthor: Anna Gaca\nurl: https://pitchfork.com/reviews/tracks/justin-bieber-ariana-grande-stuck-with-u/\nhostname: pitchfork.com\ndescription: Two pop superstars team up for a coronavirus benefit song that’s fine, actually.\nsitename: Pitchfork\ndate: 2020-05-08\n---\nNow that they’ve got nothing else to do, Ariana Grande and Justin Bieber have found time to collaborate on a quarantine ballad. Their new song “Stuck With U” already feels a little late, as certain U.S. states are pushing to prematurely lift precautions. But everything’s cozy where they’re at: Grande and her dog Toulouse sing over webcam from bed, while Bieber and wife Hailey roam their house at the far end of a selfie stick.\nThough “Stuck With U” is merely serviceable as a pop song, it’s at least a big upgrade from that other product of rich-people lockdown culture, the celebrities singing “Imagine.” Instead of a bad take on a hoary classic, Grande and Bieber offer a new song with a pleasantly retro doo-wop vibe. Instead of Pollyannaish optimism, they sound a note of resignation: “Lock the door and throw out the key/Can’t fight this no more/It’s just you and me.” And where Gal Gadot and friends sought to comfort the masses with front-facing camera selfies, Grande and Bieber’s video team curates fan-generated footage to include people from many walks of life. It helps, of course, that “Stuck With U” is a charitable single, benefitting the First Responders Children’s Foundation. Ah—the sweet sound of stepping over a low bar.",
      "author": "Anna Gaca",
      "published_date": "2020-05-08",
      "word_count": 246,
      "fetch_timestamp": "2025-08-19T19:47:39.039944",
      "metadata": {
        "char_count": 1561,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:47:39.039938"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/justin-bieber-changes/",
      "source": "pitchfork",
      "artist_name": "Justin Bieber",
      "title": "Justin Bieber: Changes",
      "content": "---\ntitle: Justin Bieber: Changes\nauthor: Jayson Greene\nurl: https://pitchfork.com/reviews/albums/justin-bieber-changes/\nhostname: pitchfork.com\ndescription: The popstar returns with a grown-man album about domestic love that has all the glow and eroticism of an airport terminal.\nsitename: Pitchfork\ndate: 2020-02-18\n---\nAt some point in the endless world tour supporting his 2015 album Purpose, Justin Bieber stared into a sea of fans and pleaded with them to quiet down. “When you guys are screaming... it’s hard for me,” he muttered, pacing in front of his own JumboTron double in the opening montage of his new promotional documentary Seasons. In 2017, he canceled the remaining 14 dates of his tour. His team cited “unforeseen circumstances,” and for a while, the Bieber machine fell eerily silent.\nNow, as it fires back up again, his management is busily filling in the blanks. In one episode of the docuseries, Bieber discusses the severity of his former drug use; he smoked weed for the first time at age 13, he tells us, and by the time he entered his 20s, he had progressed to pills and lean: “My security... were coming into the room at night to check my pulse,” he admits. He also discusses his struggles with anxiety and his diagnosis of chronic Lyme disease. “No one’s ever grown up in the history of humanity like Justin Bieber,” his manager Scooter Braun adds.\nAt the center of this whirlwind lies Changes, his first album in four years. On it, Bieber returns to us a wiser man—the emphasis, here, strenuously, on “man.” As of 2018, he is happily married to Hailey Bieber, née Baldwin, model and daughter of Stephen. Bieber is newly sober, newly wed. Now is the time for stubbly beards stroked fondly, for wry smiles at the memories of youthful folly, for a sharp decline in public-urination incidents. But above all, now is time for sex. More precisely, for love-making, of the most grown-up and responsible variety—no giggling, constant eye contact. His fifth studio album is pitched as an invitation to bask in Bieber’s newfound domestic bliss, but while his contentment might be heaven for him and his managers, the resulting album has all the glow and eroticism of an airport terminal.\nBieber recorded Changes mostly with his main writing collaborator Poo Bear and Josh Gudwin, his trusted producer and engineer. Without the animating presence of someone like Skrillex (who helmed six songs on 2015’s Purpose), Changes settles into a middle-distance, stream-friendly murmur that is more sleepy than salacious. Its 16 songs (plus a remix) are all cold angles and frictionless surfaces, devoid of intimacy and heat. Married-sex songs can be some of the most provocative: see “Rocket” or “Partition” from Beyoncé’s self-titled album for a few minutes’ evidence. But the language here is off-putting and sanitized, and the music has none of the bright syncopation or rhythmic surprise of the Purpose singles.",
      "author": "Jayson Greene",
      "published_date": "2020-02-18",
      "word_count": 478,
      "fetch_timestamp": "2025-08-19T19:47:39.075206",
      "metadata": {
        "char_count": 2926,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:47:39.075200"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/justin-bieber-yummy/",
      "source": "pitchfork",
      "artist_name": "Justin Bieber",
      "title": "Justin Bieber: “Yummy”",
      "content": "---\ntitle: Justin Bieber: “Yummy”\nauthor: Eric Torres\nurl: https://pitchfork.com/reviews/tracks/justin-bieber-yummy/\nhostname: pitchfork.com\ndescription: His first new single since 2015 is a bloodless shell of an R&B song.\nsitename: Pitchfork\ndate: 2020-01-03\n---\nWas any other pop star’s decade in the spotlight as chaotic as Justin Bieber’s? Mop-bucket piss and police charges aside, he’s certainly the only heartthrob that the Obama administration formally dunked on when a White House petition to revoke his green card garnered over 273,000 signatures in 2014. Through all the turmoil, Bieber’s music became a more gainful way to shed his tween image: Adopting the Y2K handbook of cribbing elements from rap and R&B hits, he cooked up his own wildly successful whitebread version, with his share of peaks and flops throughout.\nPlease toss “Yummy,” Bieber’s first single since 2015’s Purpose, in with the flops. In the trailer for a docuseries about his upcoming fifth album, Bieber and his crew speak in platitudes that suggest he’s in a healthier, more creatively fulfilling place now that he’s “found his wife,” model Hailey Baldwin. If that’s so, “Yummy” makes a compelling case for staying single: Shamelessly engineered for the truncated attention span of TikTok (he joined the service just for the occasion), it’s a bloodless shell of an R&B song crippled by asinine lyrics and a tired, syncopated backdrop. The song plateaus as soon as it starts, never inching past the toddler-like repetition of “yummy-yum” in its chorus. The problem isn’t even that a 25-year-old is employing baby talk as a squicky come-on—that’s been done better. “Yummy” is a dead-on-arrival return that even Bieber sounds bored with.",
      "author": "Eric Torres",
      "published_date": "2020-01-03",
      "word_count": 268,
      "fetch_timestamp": "2025-08-19T19:47:39.108090",
      "metadata": {
        "char_count": 1717,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:47:39.108081"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/21248-purpose/",
      "source": "pitchfork",
      "artist_name": "Justin Bieber",
      "title": "Justin Bieber: Purpose",
      "content": "---\ntitle: Justin Bieber: Purpose\nauthor: Ivy Nelson\nurl: https://pitchfork.com/reviews/albums/21248-purpose/\nhostname: pitchfork.com\ndescription: The advance singles for Justin Bieber’s Purpose showcased his best performances to date while hinting at a successful transition beyond teen pop. And yet, the full record too often comes off like a redemptive PowerPoint presentation while suggesting that the singer’s idea of \"adulthood\" involves the ability to convey pettiness without emotional intelligence.\nsitename: Pitchfork\ndate: 2015-11-17\n---\nPurpose is less an album than a deliberate act of repositioning. As much as 2012's Believe was intended as Justin Bieber's micro-adjustment into adulthood, the advance singles for Purpose, \"What Do You Mean?\" and \"Sorry\", are his first hits without any traces of teen-pop. They're designed much in the spirit of \"Where Are Ü Now\", his single with Skrillex and Diplo from earlier this year, where Bieber's voice fluctuated through animated throbs. Produced, respectively, by MdL and Skrillex (who contributes six productions to the record), \"What Do You Mean?\" and \"Sorry\" are vivid tropical house tracks that sound like sunlight drifting down through palm fronds. Bieber's voice often resembles a breath contorted inexpressively through notes; here, he lets it weightlessly fall through textures. They are his best performances to date, allowing him to flex a rhythmic playfulness without communicating an iota of legible emotion.\nPurpose doesn't particularly follow up on the advances suggested by his previous release, the 2013 R&B experiment Journals. That record was Bieber's first attempt at casting himself as an adult, but its efforts, alternately curious and anonymous, went largely unnoticed. For its part, Purpose mostly suggests that Bieber's idea of \"adulthood\" is the ability to convey pettiness without emotional intelligence. On new single \"Love Yourself\", an Ed Sheeran co-write that also functions as a gentle kiss-off, Bieber sings \"If you like the way you look that much/ Baby, you should go and love yourself.\" Lyrically it's needlessly mean, neither funny nor clever, and it doesn't do much to justify the severity of its perspective.\nThe songs on Purpose have a similarly inanimate feeling; they seem to radiate more than they move. \"No Sense\" feels oddly hookless and almost willfully ugly, and when Travis Scott surfaces toward the end of the track, he registers as just another cold texture. Nothing here has the captivating, lopsided construction of Journals' \"Confident\". \"No Pressure\", featuring Big Sean, comes close with its shimmering, processed acoustic guitars—though the song might have appeared lighter and more nimble in the hands of someone like Usher.\nIn general, vagueness, indecision, and faint befuddlement suit Bieber best. \"The Feeling\", produced by Skrillex, describes a liminal, unstable state (\"Am I in love or am I in love with the feeling?\"), and the track fittingly seems to slip in and out of focus. Halsey, who released one of the worst singles of the year with \"New Americana\", proves an ideal counterweight to Bieber, and together the two effortlessly convey the gentle intensity of a crush. At these moments, when Bieber is allowed to remain a lithe and fluttery element zippering in and out of a canvas, he sounds most comfortable.",
      "author": "Ivy Nelson",
      "published_date": "2015-11-17",
      "word_count": 513,
      "fetch_timestamp": "2025-08-19T19:47:39.176896",
      "metadata": {
        "char_count": 3335,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T19:47:39.176890"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/",
      "source": "pitchfork",
      "artist_name": "Justin Bieber",
      "title": "The Pitchfork Review: All of the Latest Episodes",
      "content": "---\ntitle: The Pitchfork Review: All of the Latest Episodes\nauthor: Condé Nast\nurl: https://pitchfork.com/podcast/the-pitchfork-review/\nhostname: pitchfork.com\ndescription: Listen to every episode of Pitchfork’s podcast for music fans and obsessives.\nsitename: Pitchfork\ndate: 2024-01-11\ntags: ['web']\n---\nBrought to you by the music critics at Pitchfork, The Pitchfork Review is a show for music fans and obsessives who can’t wait to talk about the latest releases. Co-hosted by Pitchfork editor-in-chief Puja Patel and Reviews Editor Jeremy D. Larson, this podcast pulls back the curtain on our reviews and scores, dives deep into new music, and gives an expert guide to what’s exciting, what’s great, and what’s just plain terrible.\nListen to every episode of Pitchfork’s podcast for music fans and obsessives.\nRelated Articles\nThe Origins and Influence of Brian Eno’s Pioneering Album Ambient 1: Music for Airports\nIn the latest episode of Pitchfork’s podcast, our critics revisit the legendary producer’s classic 1978 LP, which was recently featured in our Sunday Review series.\nBy Pitchfork\nJeff Tweedy on Rock Criticism, the Pitfalls of Music Snobbery, and His New Book\nThe musician and author discusses World Within a Song, in which he writes about 50 songs that rearranged his brain, Wilco’s new album, and more.\nBy Pitchfork\nThe 2023 Music Grab Bag: Trends, Scandals, and Theories\nIn this episode of the Pitchfork Review podcast, our critics talk about the rise of the musical theater girlie, the fall of the 1975’s Matty Healy, and more. Plus: Alvvays’ Molly Rankin reveals the song she wishes she wrote.\nBy Pitchfork\nThe Best, Worst, and Most Surprising Albums of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about some of their faves from our 50 Best Albums of 2023 list and lament a few of the year’s biggest disappointments.\nBy Pitchfork\nWhy the Replacements’ Tim Is the Best Reissue of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about the revelatory new version of the beloved rock band’s 1985 LP. Plus, Replacements bassist Tommy Stinson reveals his perfect-10 album.\nBy Pitchfork\nBreaking Down Bad Bunny’s New Album and the Future of Puerto Rican Rap and Reggaeton\nIn this episode of The Pitchfork Review podcast, our critics dissect Bad Bunny’s latest and highlight a few new queer artists from Puerto Rico who are taking the island’s music to exciting new places.\nBy Pitchfork\nDebating the Best Songs of 2023, Part Two\nIn this episode of the Pitchfork Review podcast, our critics battle it out over some of their favorite songs of the year, by artists including Troye Sivan, Kendrick Lamar, Big Thief and more. Plus: Devendra Banhart tells us all about his dream collaboration.\nBy Pitchfork\nDebating the Best Songs of 2023, Part One\nIn this episode of the Pitchfork Review podcast, our critics take sides and discuss which tracks by some of 2023’s most exciting artists deserve a spot on our upcoming year-end lists.\nBy Pitchfork\nThe Good, the Bad, and the Swiftie of Taylor’s Eras Tour Concert Film\nIn this episode of The Pitchfork Review podcast, our critics wade through the ups and downs of the pop superstar’s new record-breaking live movie.\nBy Pitchfork\nWhat Drake Is Doing Wrong—and How He Can Fix It\nIn this episode of the Pitchfork Review podcast, our critics talk about what made them care about Drake in the first place, why his new album For All the Dogs is so frustratingly mid, and what he should do next.\nBy Pitchfork",
      "author": "Condé Nast",
      "published_date": "2024-01-11",
      "word_count": 579,
      "fetch_timestamp": "2025-08-19T19:47:39.332469",
      "metadata": {
        "char_count": 3506,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-19T19:47:39.332463"
      }
    },
    {
      "url": "https://pitchfork.com/features/",
      "source": "pitchfork",
      "artist_name": "Justin Bieber",
      "title": "Music Articles & Features",
      "content": "---\ntitle: Music Articles & Features\nauthor: Condé Nast\nurl: https://pitchfork.com/features/\nhostname: pitchfork.com\ndescription: Longform and in-depth analysis about the most exciting and important music being released today\nsitename: Pitchfork\ndate: 2025-08-14\ntags: ['web']\n---\nDekmantel Is a Dance Festival Shedding Light on the Underground\nWe touched down in Amsterdam for the 2025 edition of the left-of-center electronic festival and came back with some thoughts about live sets, drum heads, speaker cabinets, bass fiends, techno lords, and the simple power of naming some club-ready bangers.\nBy Jeremy D. Larson\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nNight Out 2025: Pitchfork and Them’s Showcase for the Future of Queer Music\nBy Olivier LafontantPhotography by Dillon Edlin\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nWhat Happened at Pitchfork’s Bladee Zine Launch\nBy PitchforkPhotography by Caroline Friedman\nA Rare Interview With Bladee, the Mystic Oracle of Internet Rap\nBy Meaghan GarveyPhotography by Jason Nocito\nHighlights From Pitchfork’s 2024 Year in Music Club Night\nBy PitchforkPhotography by Sam Wachs\nHighlights From Pitchfork and Thought Enthusiast’s Year in Music Panel\nBy PitchforkPhotography by Sam Wachs\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 18 Best Moments From Pitchfork Music Festival 2024\nBy Boutayna Chokrane, Nina Corcoran, and Heven Haile\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nHow Waxahatchee Made the Album of Her (Second) Life\nBy Andy CushPhotography by Bobby Doherty\nChasing the Goblin With Mabe Fratti, the Guatemalan Cellist at the Heart of Mexico City’s Avant-Rock Scene\nBy Philip SherburnePhotography by Filip Preis",
      "author": "Condé Nast",
      "published_date": "2025-08-14",
      "word_count": 347,
      "fetch_timestamp": "2025-08-19T19:47:39.614870",
      "metadata": {
        "char_count": 2280,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-19T19:47:39.614858"
      }
    }
  ],
  "total_articles": 8,
  "total_words": 3344,
  "extracted_at": "2025-08-19T19:47:39.615275",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/justin-bieber-swag/",
    "https://pitchfork.com/reviews/albums/justin-bieber-justice/",
    "https://pitchfork.com/reviews/tracks/justin-bieber-ariana-grande-stuck-with-u/",
    "https://pitchfork.com/reviews/albums/justin-bieber-changes/",
    "https://pitchfork.com/reviews/tracks/justin-bieber-yummy/",
    "https://pitchfork.com/reviews/albums/21248-purpose/",
    "https://pitchfork.com/features/podcast/",
    "https://pitchfork.com/features/"
  ]
}