{
  "artist_name": "Aerosmith",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/music/music-news/aerosmith-joe-perry-steven-tyler-doesnt-want-tour-1236043824/",
      "source": "billboard",
      "artist_name": "Aerosmith",
      "title": "Aerosmith’s Future Unclear as Joe Perry Claims Steven Tyler ‘Doesn’t Want to Tour’",
      "content": "---\ntitle: Aerosmith’s Future Unclear as Joe Perry Claims Steven Tyler ‘Doesn’t Want to Tour’\nauthor: Tyler Jenke\nurl: https://www.billboard.com/music/music-news/aerosmith-joe-perry-steven-tyler-doesnt-want-tour-1236043824/\nhostname: billboard.com\ndescription: Aerosmith's Joe Perry claims he's unsure of what the future holds for the band, noting Steven Tyler lacks the desire and ability to head out on tour.\nsitename: Billboard\ndate: 2025-08-14\ncategories: ['Music News']\ntags: ['aerosmith, genre rock, Joe Perry, steven tyler']\n---\nAerosmith‘s Joe Perry claims he’s unsure of what the future holds for the band, noting Steven Tyler lacks the desire and ability to head out on tour.\nThe co-founding guitarist made his comments while speaking to Boston’s WBUR, affirming his belief that the veteran rockers may take to the stage once more.\n“I would bet that there’s an Aerosmith show left,” Perry explained.\nQuestions about the band’s future have swirled since the announcement of their 2023 farewell tour. While performing in Elmont, NY on Sept. 9 of that year, Tyler fractured his larynx, necessitating the postponement of shows on their Peace Out tour.\nTrending on Billboard\nUltimately, these shows were canceled entirely when the band announced their retirement from touring in Aug. 2024. That same month, bassist Tom Hamilton refuted claims the band were over completely, noting Aerosmith were “still alive” despite the recent retirement news.\nIn his recent discussion with WBUR, Perry revealed that he and Tyler had recently spent time together to discuss the band’s plans, including a possible documentary at some point. However, fans may need to temper their expectations on the topic of full-scale touring.\n“He just doesn’t want to tour and he can’t tour. It’s tough,” Perry explained. “I’m not sure I would want to go out and book another 40-city tour. It’s a long way to the top and staying there takes it out of you, especially an Aerosmith tour.”\nPerry didn’t entirely rule out the notion of a less strenuous live undertaking, such a Las Vegas residency in the same vein as their Deuces are Wild concert series which took place throughout 2019, 2020 and 2022.\n“I’ll never say never, but I wouldn’t bet on it — no pun intended,” Perry said. “You really have to want to be out there and we’re all at that point of: How do you want to live? How do you want to spend the next however long you’ve got?”\nSince Aerosmith’s retirement from touring, Tyler has only performed live a handful of times. The first of these was at his annual Jam for Janie Grammy Awards Viewing Party in February, with his most recent appearance taking place as part of July’s Back to the Beginning benefit concert in England.",
      "author": "Tyler Jenke",
      "published_date": "2025-08-14",
      "word_count": 439,
      "fetch_timestamp": "2025-08-20T15:57:18.599009",
      "metadata": {
        "char_count": 2710,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T15:57:18.598972"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/steven-tyler-returns-stage-first-performance-aerosmith-retirement-1235891774/",
      "source": "billboard",
      "artist_name": "Aerosmith",
      "title": "Steven Tyler Returns to the Stage for First Performance Since Aerosmith’s Retirement from Touring",
      "content": "---\ntitle: Steven Tyler Returns to the Stage for First Performance Since Aerosmith’s Retirement from Touring\nauthor: Tyler Jenke\nurl: https://www.billboard.com/music/music-news/steven-tyler-returns-stage-first-performance-aerosmith-retirement-1235891774/\nhostname: billboard.com\ndescription: While a reported Aerosmith reunion didn't occur, Steven Tyler performed with some famous friends at his annual Jam for Janie event.\nsitename: Billboard\ndate: 2025-02-04\ncategories: ['Music News']\ntags: ['aerosmith, Black Crowes, Lainey Wilson, mick fleetwood, Nuno Bettencourt, steven tyler']\n---\nWhile the music world didn’t receive its highly-anticipated Aerosmith reunion over the weekend, the reality wasn’t far off, with frontman Steven Tyler making his long-awaited return to the stage.\nIn January, reports emerged that Tyler’s sixth annual Jam for Janie Grammy Awards Viewing Party would be taking place on Sunday (Feb. 2) at the Hollywood Palladium in Los Angeles, with Aerosmith set to make a return performance.\nAlongside appearances from Billy Idol, Joan Jett, Lainey Wilson, Tom Hamilton, Linda Perry, Matt Sorum, and Nuno Bettencourt, the reported Aerosmith reunion would have been the group’s first live show since Sept. 2023.\nTrending on Billboard\nWhile performing in Elmont, NY on Sept. 9 of that year, Tyler fractured his larynx, necessitating the postponement of shows on their Peace Out tour. Ultimately, these shows were canceled entirely when the band announced their retirement from touring in August 2024.\nThough excitement for a reunion from Aerosmith members was high in the lead up to the Jam for Janie event on Sunday, the result was equally appreciated when Tyler took to the stage for a rare live appearance. Aerosmith guitarist Joe Perry wasn’t on hand for the night, though bassist Tom Hamilton was.\nPerforming with Extreme’s Nuno Bettencourt, Tyler’s six-song set featured a rendition of Aerosmith’s “Toys in the Attic”, Extreme’s “More Than Words” with Mick Fleetwood, and “Dream On” with Lainey Wilson. Joined by Hamilton and the Black Crowes’ Chris Robinson for performances of “Sweet Emotion”, and “Walk This Way” (which also featured English singer Jessie J), the high-profile set closed out with a cover of Led Zeppelin’s “Heartbreaker”.\nSunday’s performance was only Tyler’s second time appearing on stage since his vocal injury. In May 2024 – months before Aerosmith announced their retirement from touring – Tyler performed “Mama Kin” with the Black Crowes in London. At the time, the Black Crowes were planning to resume their role as the opening act for Aerosmith’s then-postponed Peace Out tour later in the year.\nIt’s currently unclear whether Tyler’s return to the live stage could result in anything more in the future, though Hamilton did speak to Boston’s WBUR in January to give an update on the possibility of one-off Aerosmith appearances down the line.\n“Steven’s healing process is going really, really well, but it goes at its own pace,” Hamilton told the station. “Maybe Aerosmith will do something in the future, but it’s a big if and the last thing I want to be doing is to try and push Steven in that direction.\n“If we do anything in the future, it would come from him,” he added.",
      "author": "Tyler Jenke",
      "published_date": "2025-02-04",
      "word_count": 498,
      "fetch_timestamp": "2025-08-20T15:57:18.689679",
      "metadata": {
        "char_count": 3230,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T15:57:18.689669"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/billy-idol-joan-jett-steven-tyler-grammy-awards-1235881450/",
      "source": "billboard",
      "artist_name": "Aerosmith",
      "title": "Aerosmith, Lainey Wilson, Joan Jett & More to Perform at Steven Tyler’s ‘Jam for Janie’",
      "content": "---\ntitle: Aerosmith, Lainey Wilson, Joan Jett & More to Perform at Steven Tyler’s ‘Jam for Janie’\nauthor: Jessica Lynch; Paul Grein\nurl: https://www.billboard.com/music/music-news/billy-idol-joan-jett-steven-tyler-grammy-awards-1235881450/\nhostname: billboard.com\ndescription: Aerosmith, Lainey Wilson, Joan Jett, Billy Idol and more will perform at Steven Tyler’s 2025 Jam for Janie GRAMMY Awards Viewing Party\nsitename: Billboard\ndate: 2025-01-28\ncategories: ['Music News']\ntags: ['classic rock, Grammys, Music News, rock']\n---\nUPDATE (Jan. 27): Country star Lainey Wilson has been added to the line-up for Steven Tyler’s sixth annual Jam for Janie Grammy Awards Viewing Party. She is set to join Billy Idol, Joan Jett, Tom Hamilton, Linda Perry, Matt Sorum, Nuno Bettencourt and Aerosmith, which is reuniting for a special performance at the Live Nation-sponsored event. “Having an amazing artist like Lainey Wilson stop in and join us is going to make this year’s Jam rock like something I could have never dreamed of,” Tyler said in a statement. Wilson is a 2025 Grammy nominee. Another 2025 Grammy nominee is still to be announced for this bill.\nPREVIOUSLY (Jan. 23): Steven Tyler’s sixth annual Jam for Janie Grammy Awards Viewing Party has been announced, with the charity event to be held on Feb. 2 at the Hollywood Palladium in Los Angeles (the site of the first live Grammy telecast in 1971).\nTrending on Billboard\nHosted by Grammy-winning comedian Tiffany Haddish, the evening features a lineup of performers including Billy Idol, Joan Jett, Tom Hamilton, Linda Perry, Matt Sorum, and Nuno Bettencourt. A special highlight will be a reunion performance by members of Aerosmith.\nThe event supports Janie’s Fund, the rocker’s nonprofit aiding young women and girls who have survived abuse, and expands its philanthropic reach this year to benefit the Los Angeles Fire Department Foundation and the Widows, Orphans, and Disabled Firefighter’s Fund. The event will welcome more than 100 firefighters who have been at the forefront of combating the California wildfires.\n“What the Los Angeles community has endured with these wildfires is unthinkable,” Tyler said in a statement. “Music has healing powers and we hope to bring a moment of joy and levity to our first-responder firefighters and those most affected by the fires. The trauma experienced by the girls we work with is also unthinkable and we will continue to shed light and support the amazing work of Janie’s Fund.”\nThe night will include a red carpet, cocktail reception, dinner, live auction, and an after-party benefitting Janie’s Fund, as well as support both the Widows, Orphans and Disabled Firefighters Fund and Los Angeles Fire Department Foundation by raising critical funds to help meet the immediate needs for lifesaving equipment and resources.\nEvent chairs include Ace & Matt Sorum, Aerosmith, Alice Cooper, Andrea Bocelli, Ashlee Simpson & Evan Ross, Bill Maher, Bo Derek, Chris & Rich Robinson, Dolly Parton, Flavor Flav, Jane Lynch, Kayte & Kelsey Grammer, Lionel Richie, Melissa Joan Hart, Miley Cyrus, Nuno Bettencourt, Paula Abdul, Randy Jackson, Sammy Hagar, Scarlett Johansson, and Shep Gordon.\nNamed after Aerosmith’s 1989 hit “Janie’s Got a Gun,” which peaked at No. 4 on the Billboard Hot 100 and earned the band their first of four Grammys for best rock performance, Janie’s Fund has been a lifeline for vulnerable girls. With its expanded mission this year, the event promises to raise vital funds for lifesaving equipment and resources.\nTickets and sponsorship details are available at JaniesFund.org.",
      "author": "Jessica Lynch; Paul Grein",
      "published_date": "2025-01-28",
      "word_count": 559,
      "fetch_timestamp": "2025-08-20T15:57:18.776733",
      "metadata": {
        "char_count": 3599,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T15:57:18.776723"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/aerosmiths-joey-kramer-announces-closure-rockin-and-roastin-coffee-line-1235841612/",
      "source": "billboard",
      "artist_name": "Aerosmith",
      "title": "Aerosmith’s Joey Kramer Announces Closure of Rockin’ & Roastin’ Coffee Line",
      "content": "---\ntitle: Aerosmith’s Joey Kramer Announces Closure of Rockin’ & Roastin’ Coffee Line\nauthor: Tyler Jenke\nurl: https://www.billboard.com/music/music-news/aerosmiths-joey-kramer-announces-closure-rockin-and-roastin-coffee-line-1235841612/\nhostname: billboard.com\ndescription: \"There just is no realistic alternative but to close our proverbial doors,\" Kramer wrote on the Rockin' & Roastin' Coffee's website.\nsitename: Billboard\ndate: 2024-12-02\ncategories: ['Music News']\ntags: ['aerosmith']\n---\nMore than a decade since it first launched, Aerosmith drummer Joey Kramer has announced the closure of his Rockin’ & Roastin’ Coffee line.\nKramer announced the news via a message shared to the coffee brand’s website on Friday (Nov. 29), citing “no realistic alternative” to its impending closure.\n“To all of Rockin’ & Roastin”s loyal subscribers and my coffee loving fans along the way – It is with deep deep sadness that we have had to make the decision to close the business of Rockin & Roastin’ Coffee,” the message read.\nAfter the years of working to recover from the devastation to our business from the impact of Covid, significant increases in the cost of doing business and the tragic, painful loss of my wife, Linda, there just is no realistic alternative but to close our proverbial doors.“\nKramer closed the post by noting that all orders received trough Saturday, Nov. 30 would be filled, but no orders will be taken thereafter.\nTrending on Billboard\nRockin’ & Roastin’ Coffee was first launched by Kramer in 2012 after years spent on the road as a touring musician and being subjected to copious cups of bad coffee.\n“I set out to streamline my experiences and become a coffee expert,” he said. “I knew I had to come up with something that would satiate even the most discerning java enthusiast.\n“After countless amounts of research (I might be an honorary chemist by now), sampling endless batches and hitting the presses in nearly every continent, my Rockin’ & Roastin’ Coffee dream was born. The result? Some of the finest, purest kick-ass coffee on the planet, sure to please the palate of any ‘coffee-sseur.'”\nIn 2013, Rockin’ & Roastin’ Coffee landed a hotel partnership deal, and in 2016, Joey Kramer‘s Rockin’ & Roastin’ Cafe opened its doors in North Attleboro, Mass., about 40 miles outside Aerosmith‘s birthplace of Boston.\nThe news comes just months after Aerosmith announced their retirement from touring amid Steven Tyler‘s ongoing vocal cord injury.\n“We’ve seen him struggling despite having the best medical team by his side,” the group wrote in a message on social media in early August. “Sadly, it is clear, that a full recovery from his vocal injury is not possible. We have made a heartbreaking and difficult, but necessary, decision – as a band of brothers – to retire from the touring stage.”\nAerosmith thanked their crew and team before concluding with a message to their fans. “A final thank you to you – the best fans on planet Earth. Play our music loud, now and always. Dream On. You’ve made our dreams come true,” they wrote.",
      "author": "Tyler Jenke",
      "published_date": "2024-12-02",
      "word_count": 492,
      "fetch_timestamp": "2025-08-20T15:57:18.880433",
      "metadata": {
        "char_count": 3062,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T15:57:18.880418"
      }
    },
    {
      "url": "https://www.billboard.com/music/rock/sammy-hagar-props-aerosmith-steven-tyler-retirement-1235746677/",
      "source": "billboard",
      "artist_name": "Aerosmith",
      "title": "Sammy Hagar Gives Aerosmith’s Steven Tyler Props After Retirement Announcement: ‘That’s Honorable’",
      "content": "---\ntitle: Sammy Hagar Gives Aerosmith’s Steven Tyler Props After Retirement Announcement: ‘That’s Honorable’\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/rock/sammy-hagar-props-aerosmith-steven-tyler-retirement-1235746677/\nhostname: billboard.com\ndescription: Sammy Hagar gave old friend Aerosmith singer Steven Tyler props for an amazing career after band announced their road retirement over his vocal issues.\nsitename: Billboard\ndate: 2024-08-05\ncategories: ['Rock']\ntags: ['Music News, rock']\n---\nKnowing when to hang it up is a skill not every rock singer has. While some call it a day way before their time is up, others hang around way too long and end up doing damage to their reputations. That’s why the announcement last week that Aerosmith will permanently retire from touring due to 76-year-old singer Steven Tyler’s ongoing vocal issues hit Sammy Hagar so hard.\nDuring the encore of a show on Hagar’s Best of All Worlds tour with drummer Jason Bonham, former Van Halen bassist Michael Anthony and guitar god Joe Satriani at Pine Knob Music Theatre in Michigan on Friday, Hagar, 76, took a moment to acknowledge the then-new information and give Aerosmith props for their longevity and spirit.\nTrending on Billboard\n“We had some crazy news today. We got here this afternoon sometime and we’re all sitting around backstage and a friend of ours that works for Aerosmith came and said, ‘Yeah, Aerosmith called retirement today. They quit. They stopped.’ God bless ’em,” Hagar said according to fan video of the moment. “It’s a horrible thing. What a great f–king loss.”\nHagar recalled the time in 1973 when his band Montrose was opening a gig for Aerosmith at Detroit’s Cobo Hall (now called Huntington Place) during a period when the red rocker had no idea who the “Dream On” Boston band were. “They sold out Cobo, and I’m going, ‘Who the f–k are these guys?,'” Hagar remembered saying. ” So, we did our show, we did an encore, and we played ‘Helter Skelter’ for our encore. And Aerosmith comes on and they opened with ‘Helter Skelter.’ Steven and I have been friends ever since.”\nLong story short, Hagar added, “we love those guys. We all grew up with those guys. You grew up with them, we grew up with them, Mike and I. They’ve been our competitors to Van Halen for f–king 10 years. You know what I’m saying? ‘F–k those guys.’ No, no, no, but we really do like them. It’s just that we’re mad at them. But anyway, what a shame.”\nThree months after rescheduling the remaining dates on their Peace Out farewell tour, Aerosmith announced their official retirement from touring on Friday due to singer Steven Tyler’s ongoing vocal cord injury. “It was 1970 when a spark of inspiration became Aerosmith. Thanks to you, our Blue Army, that spark caught flame and has been burning for over five decades. Some of you have been with us since the beginning and all of you are the reason we made rock ‘n’ roll history,” the statement began. “It has been the honor of our lives to have our music become part of yours. In every club, on every massive tour and at moments grand and private you have given us a place in the soundtrack of your lives.”\nThe “Walk This Way” group said that Tyler has spent “months tirelessly working on getting his voice to where it was before his injury,” but said it became clear that a full recovery was not going to happen. “We have made a heartbreaking and difficult, but necessary, decision — as a and of brothers — to retire from the touring stage,” they wrote.\nHagar said the tough call to press permanent pause on the road was honorable, and rare. “It’s a sad thing, but honest to God, my hat goes off to one of the greatest rock and roll singers of all time, Mister Steven Tyler, for saying, ‘I can’t sing anymore. I quit,'” Hagar said before taking a veiled swing at other, unnamed, aging rockers who have continued to tour past their prime while making a bold prediction about himself.\n“F–k yes! Listen, that’s honorable – that’s f–king honorable. The day I can’t sing anymore, I will f–king do the same thing. And that’s what a lot of other motherf–kers should have did a long time ago,” Hagar said. Sammy and the band then, naturally, broke into the Beatles’ “Helter Skelter,” which Hagar howled with his signature raspy vigor.\nAerosmith only got three shows into their swan song outing last year before having to reschedule the tour due to an injury to Tyler’s larynx.\nWatch video of Hagar’s comments below.",
      "author": "Gil Kaufman",
      "published_date": "2024-08-05",
      "word_count": 762,
      "fetch_timestamp": "2025-08-20T15:57:18.968985",
      "metadata": {
        "char_count": 4461,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:57:18.968976"
      }
    },
    {
      "url": "https://www.billboard.com/pro/steven-tyler-child-sexual-assault-trial-accuser-argument/",
      "source": "billboard",
      "artist_name": "Aerosmith",
      "title": "Steven Tyler Accuser Says Age-of-Consent Argument Won’t Save Him From Child Sexual Assault Trial",
      "content": "---\ntitle: Steven Tyler Accuser Says Age-of-Consent Argument Won’t Save Him From Child Sexual Assault Trial\nauthor: Bill Donahue\nurl: https://www.billboard.com/pro/steven-tyler-child-sexual-assault-trial-accuser-argument/\nhostname: billboard.com\ndescription: Aerosmith singer Steven Tyler's sexual assault accuser asked a judge to deny his motion to dismiss the lawsuit before trial under the age of consent.\nsitename: Billboard\ndate: 2025-08-08\ncategories: ['Legal News']\ntags: ['genre rock, Legal, nsfs, sexual assault, Trial']\n---\nSteven Tyler Accuser Says Age-of-Consent Argument Won’t Save Him From Child Sexual Assault Trial\nJulia Misley, who claims she's the \"teen bride\" Tyler described in his memoir, says the rock star cannot hide behind another state's age of consent.\nA woman suing Aerosmith singer Steven Tyler over accusations that she was almost his “child bride” in the 1970s is urging a judge to deny the star’s efforts to dismiss her sexual assault lawsuit.\nIn court papers filed Wednesday in Los Angeles court, attorneys for Julia Misley argue that Tyler — whom they claim “groomed” and “manipulated” her as a teenager — cannot rely on the laws of Massachusetts to escape a case she filed in California.\n“Defendant, as plaintiff’s guardian, used his wealth and celebrity status to sexually assault plaintiff as a child for multiple years in multiple states, including California,” Misley’s lawyers said. “Thus, it was defendant who chose California law to apply, not plaintiff.”\nMisley (formerly Holcomb) sued Tyler in 2022, claiming she was the unnamed person he referred to in his memoir as a “teen bride” he almost married. They claim he abused his fame to win control over her — including signing an agreement with her parents to take legal guardianship — and sexually assault her for three years starting in 1973, when she was just 16 years old.\nWith a trial looming in October, Tyler has argued that the case must be dismissed. His lawyers say the pair lived together in Boston, where the legal age of consent is 16; he also says the statute of limitations in Massachusetts has long since expired.\nBut in this week’s response, Misley’s lawyers say that argument is clearly procedurally flawed — and that he cannot hide behind laws in other states when he lives in California and some of the alleged misconduct took place in that jurisdiction.\n“Now, as a California resident, defendant believes that he should not be liable despite never raising the defenses he relies upon,” her lawyers write in Wednesday’s filing. “This failure is fatal to his attempts to escape liability [and] plaintiff respectfully requests the court deny defendant’s motion in its entirety and allow this case to be decided by a jury.”\nIn a statement to Billboard on Friday, Tyler’s attorney David Long-Daniels rejected the arguments raised by Misley’s lawyers, saying the defenses had, in fact, been properly raised in earlier court filings: “We have a very strong belief in the merits of our defense.”\nMisley’s allegations against Tyler were not new. She made similar accusations in a 2011 article published by the anti-abortion website LifesiteNews, and she made the same claims in 2020 during an appearance on Fox News.\nBut in 2022, she took her allegations to court — accusing Tyler of using his “power as a well-known musician and rock star” in order to “gain access to, groom, manipulate, exploit” her.\nThe lawsuit repeatedly cited Tyler’s own memoir (Does the Noise in My Head Bother You?), in which he explicitly referenced a relationship with an underage girl. “She was 16, she knew how to nasty, and there wasn’t a hair on it,” Tyler wrote in the book passage that’s quoted in the lawsuit. “I was so in love I almost took a teen bride.”\nThe lawsuit alleged that Tyler convinced Misley’s parents to grant him guardianship over her — an accusation that also came with quotes from his memoir: “I went and slept at her parents’ house for a couple of nights and her parents fell in love with me, signed paper over for me to have custody, so I wouldn’t get arrested if I took her out of state.”\nIn Tyler’s motion to dismiss the case, filed in June, he didn’t deny the basic facts. But his lawyers characterized the pairing as a consensual “romantic relationship” between a man “in his mid-twenties at the time” and a woman “between the ages of 16 and 19.”\n“Plaintiff and Tyler lived together in Boston, Massachusetts, where the legal age of consent was (and remains) 16. Plaintiff has never lived in California,” Tyler’s lawyers wrote. “However, five decades after the fact, plaintiff sued in California claiming that her relationship with Tyler, part of which occurred prior to her turning 18, constitutes ‘childhood sexual assault.’”\n“Under Massachusetts law at the time, the age of consent was 16, and as such, plaintiff and Tyler’s relationship was legal,” they wrote.\nIf Tyler’s motion is denied, the case is currently scheduled to go to trial on Oct. 1. His attorney, Long-Daniels, said his team was ready: “This case was filed over a half century after the events,” he said. “The defenses are very strong. We feel prepared for trial and think we’ll prevail, God willing.”",
      "author": "Bill Donahue",
      "published_date": "2025-08-08",
      "word_count": 852,
      "fetch_timestamp": "2025-08-20T15:57:20.188237",
      "metadata": {
        "char_count": 5181,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:57:20.188227"
      }
    }
  ],
  "total_articles": 6,
  "total_words": 3602,
  "extracted_at": "2025-08-20T15:57:20.188736",
  "urls_processed": [
    "https://www.billboard.com/music/music-news/aerosmith-joe-perry-steven-tyler-doesnt-want-tour-1236043824/",
    "https://www.billboard.com/music/music-news/steven-tyler-returns-stage-first-performance-aerosmith-retirement-1235891774/",
    "https://www.billboard.com/music/music-news/billy-idol-joan-jett-steven-tyler-grammy-awards-1235881450/",
    "https://www.billboard.com/music/music-news/aerosmiths-joey-kramer-announces-closure-rockin-and-roastin-coffee-line-1235841612/",
    "https://www.billboard.com/music/rock/sammy-hagar-props-aerosmith-steven-tyler-retirement-1235746677/",
    "https://www.billboard.com/pro/steven-tyler-child-sexual-assault-trial-accuser-argument/"
  ]
}