{
  "artist_name": "Joni Mitchell",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/features/lists-and-guides/best-music-books-of-2024/",
      "source": "pitchfork",
      "artist_name": "Joni Mitchell",
      "title": "The Best Music Books of 2024",
      "content": "---\ntitle: The Best Music Books of 2024\nauthor: Nina Corcoran; Walden Green; Kieran Press-Reynolds\nurl: https://pitchfork.com/features/lists-and-guides/best-music-books-of-2024/\nhostname: pitchfork.com\ndescription: Our favorites include Kathleen Hanna’s riot grrrl memoir, a lively document of musicians’ snacking habits, and an essential Joni Mitchell biography.\nsitename: Pitchfork\ndate: 2024-11-21\ncategories: ['features']\ntags: ['best of 2024']\n---\nThere are enough great books about music each year to fill a library. It can be a lot to get through, so we selected a handful that we really love, including memoirs, history tomes, and more. Below, find a list of personal favorites from this year, as picked by Pitchfork staffers and contributors. Happy reading!\nCheck out all of Pitchfork’s 2024 wrap-up coverage here.\nTaste in Music: Eating on Tour with Indie Musicians\nWhen summarized, Taste in Music: Eating on Tour With Indie Musicians sounds pretty straightforward: a document of musicians’ snacking habits on the road. Across its essays, though, some of the biggest artists in the indie world (Talking Heads’ Chris Frantz, Pavement’s Mark Ibold, Fleet Foxes’ Robin Pecknold) and beloved acts on the smaller circuit (Frankie Cosmos’ Greta Kline, the Beths, Sen Morimoto) use food as the entry point to tell some of the most entertaining and moving essays of the year.\nCompiled by Real Estate bassist Alex Bleeker and former Krill and Frankie Cosmos drummer Luke Pyenson, Taste in Music pulls back the curtain on the cooking challenges of Phoebe Bridgers’ private chef, Lily Chait; Animal Collective’s Geologist and his complicated relationship with car meals; and Bob Mould eating “econo” in the 1980s with Hüsker Dü and pining for the avocado trees in Greg Ginn’s mother’s backyard. Be prepared for stories that get raw, too, like Dawn Richard on how eating well impacts body image, Weyes Blood’s Natalie Mering on solo meals as a yardstick for self-perception, and PUP’s Steve Sladkowski on mourning his grandmother over pierogies in Poland. Taste in Music expands upon the best part of indie music: seeing ourselves in how these artists view the world.\n–Nina Corcoran\nAll products featured on Pitchfork are independently selected by our editors. However, when you buy something through our retail links, we may earn an affiliate commission.\nMy Black Country: A Journey Through Country Music’s Black Past, Present, and Future\nBefore Nashville singer-songwriter Alice Randall touched a pen to paper to outline a memoir, she knew her book would represent more than just herself. Throughout My Black Country: A Journey Through Country Music’s Black Past, Present, and Future, Randall recounts her difficult ascent across the gendered and racial barriers of the music industry while drawing connections to Black artists who came before her, rose alongside her, and followed afterward to shape the genre’s landscape, with or without wider recognition.\nGrowing up in Detroit and Washington, D.C., Randall kept her ear to the ground for generational stories and read between the lines of recognized folklore. Mother Maybelle Carter is credited with changing the role of guitar in country music with her thumb brush technique, but what about Eslie Riddle, the Black guitarist from whom, documents suggest, Carter learned it? Later, Randall rhapsodizes about eccentrics Swamp Dogg and Stoney Edwards, who refused to adhere to cultural codes, and Rhiannon Giddens and Lil Nas X, whose work challenges the modern cannon in opposite ways. “My checklist is not a litmus test. It’s a likeness test,” Randall explains. As one chapter bleeds into the next, there’s a thrill to seeing her correct and expand this timeline of music history.\n–Nina Corcoran\nTraveling: On the Path of Joni Mitchell\nThose in search of a standard-issue Joni Mitchell biography had best look elsewhere. Traveling: On the Path of Joni Mitchell is a document of obsession, written for obsessives; a book whose first pages are dedicated to figuring out whether to call its subject “Joni” or “Mitchell,” eventually settling on a blend of the two. And author Ann Powers demonstrates how Mitchell and her music can embed themselves in our lives by weaving her own personal story into Traveling’s narrative.\nIndulging in her passion for Mitchell, Powers actually manages to restore some mystery to the legendary artist, whose story and rough edges have been sanitized over time, especially by men, such as Robert Plant, Graham Nash, James Taylor, who wrote songs about her. Powers pointedly chose not to interview her central subject, but it ends up bringing Traveling closer to Mitchell and her “chords of inquiry”: free to contradict itself, free to ask questions and not answer them, free to follow its authors ramblings, whims, and fascinations, wherever they may go.\n–Walden Green\nHealth and Safety: A Breakdown\nHealth and Safety: A Breakdown, journalist Emily Witt’s memoir of Brooklyn nightlife, boasts an archive’s worth of underground DJs and extinct rave nights, drug-addled epiphanies and forest overdoses, charming local bodegas and sensations of fleeting bliss. The book begins slowly—Witt recaps a 2016 presentation she gave about “altered consciousness” and walks us through an ayahuasca session—before ramping up as the author meets a younger man named Andrew, at a bar after the presentation, and fully flings herself into the sweaty vortex of Bushwick’s club scene.\nThe narrative refracts through three lenses: Witt’s delirious rave odysseys, her day job as a New Yorker writer traveling to Trump rallies and towns plagued by school shooter crises, and her relationship with Andrew. The latter thread is the most compelling, as Witt brings the reader through her destructive love affair, from joyous optimism to something far worse than a breakup: a partner becoming warped, deranged, and totally unrecognizable.\nLike a comedown sunrise set after a night of feverish debauchery, Health and Safety is an elegy, both for the halcyon days of Witt’s youth and a musical ecosystem that has changed rapidly and dramatically. Even in my own short time in Brooklyn, I’ve observed how much has already shifted since Witt began her book—whether it’s clubs shuttering, new ones spawning, or an arson attack. Reading Health and Safety, I’m glum at what I’ve missed, yet amped for the nights to come.\n–Kieran Press-Reynolds\nRebel Girl: My Life as a Feminist Punk\nThe key talking points of Kathleen Hanna’s career—Bikini Kill frontwoman, pivotal figure in the riot grrrl movement, the liberating “Girls to the front!” call—that turned her into a household name are also guilty of boiling her down into a 2D pulp of third-wave feminist music. Although zines and documentaries like The Punk Singer have tried to capture Hanna’s influence and contextualize it in the modern day, it wasn’t until this year, with her engrossing memoir, Rebel Girl: My Life as a Feminist Punk, that Hanna fully set the record straight firsthand with candor and clarity.\nAn addictive read, Rebel Girl is filled with behind-the-scenes tour stories from Hanna’s time in Bikini Kill, Le Tigre, and the Julie Ruin, and still examines broader topics like the lingering consequences of sellout culture, the debilitating side-effects of autoimmune diseases, and the lack of intersectionality in her early feminist efforts. “If you don’t process your own traumas,” she warns, “you may dump them onto others.” The stories Hanna dislodges from the recesses of her brain are raw enough to be plucked from a diary, and that frankness, once again, renders Hanna’s life story in its full three dimensions.\n–Nina Corcoran\nA Chance to Harmonize: How FDR’s Hidden Music Unit Sought to Save America from the Great Depression—One Song at a Time\nThe New Deal, President Franklin D. Roosevelt’s heralded series of projects to revive the United States after the Great Depression, is well-documented and still lauded nearly a century on from its creation. One program, however, has gone overlooked, and music scholar Sheryl Kaskowitz with her new book A Chance to Harmonize: How FDR’s Hidden Music Unit Sought to Save America from the Great Depression—One Song at a Time, aims to re-educate Americans. A vivid and thoroughly researched breakdown of the Federal Music Project, the book recounts the origin story of the Resettlement Administration’s Special Skills Division, which developed art activities on American homesteads, in remarkable detail through a focus on its music unit and attempt to shift the country’s ideology from “rugged individualism to a new sense of collective purpose.”\nWith three federal workers—musicologist Charles Seeger (father of Pete Seeger), composer and instructor Margaret Valiant, and folk-music collector Sidney Robertson—as its primary players, A Chance to Harmonize is a nonfiction historical story that unfolds like a gripping thriller, complete with secret goals, compelling missions, and a years-long operation that believed music can build a progressive, cooperative society.\n–Nina Corcoran\nFashion Killa: How Hip-Hop Revolutionized High Fashion\nIn her book Fashion Killa: How Hip-Hop Revolutionized High Fashion—a late 2023 release recently made available on paperback—music journalist Sowmya Krishnamurthy taps into her network of designers, stylists, and rappers for a densely reported look at rap and luxury clothing’s coevolution. She examines a rich history that includes Dapper Dan, Missy Elliott, Kanye West and Louis Vuitton, Nicki Minaj “really sitting with Anna,” A$AP Mob, Young Thug and his Jeffery dress, and plenty more. It’s impressive how much information Krishnamurthy packs into her prose while still feeling evocative: You can practically smell the spray paint and taste the Barneys New York salads, and it all may as well be set to the sounds of “Merry-Go-Round” breaks at a DJ Kool Herc block party.\n–Walden Green",
      "author": "Nina Corcoran; Walden Green; Kieran Press-Reynolds",
      "published_date": "2024-11-21",
      "word_count": 1550,
      "fetch_timestamp": "2025-08-19T10:32:34.694529",
      "metadata": {
        "char_count": 9898,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-19T10:32:34.694520"
      }
    },
    {
      "url": "https://pitchfork.com/features/5-10-15-20/",
      "source": "pitchfork",
      "artist_name": "Joni Mitchell",
      "title": "5-10-15-20",
      "content": "---\ntitle: 5-10-15-20\nauthor: Condé Nast\nurl: https://pitchfork.com/features/5-10-15-20/\nhostname: pitchfork.com\ndescription: Talking to our favorites artists about the music of their lives, five years at a time\nsitename: Pitchfork\ndate: 2025-08-01\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\n5-10-15-20\nTalking to our favorite artists about the music of their lives, five years at a time\nAll\nLists & Guides\n5-10-15-20\nInterview\nLongform\nCover Story\nRising\nInteractives\nPodcast\n5-10-15-20\nCardo Got Wings on the Music That Made Him\nBy\nSerge Selenou\nAugust 1, 2025\n5-10-15-20\nHaruomi Hosono on the Music That Made Him\nBy\nJoshua Minsoo Kim\nJune 18, 2025\n5-10-15-20\nDJ Koze on the Music That Made Him\nBy\nLaura Snapes\nApril 8, 2025\n5-10-15-20\nAdam Scott on the Music That Made Him\nBy\nJeremy D. Larson\nMarch 21, 2025\n5-10-15-20\nMax Richter on the Music That Made Him\nBy\nJazz Monroe\nSeptember 4, 2024\n5-10-15-20\nLiz Phair on the Music That Made Her\nBy\nJill Mapes\nNovember 20, 2023\n5-10-15-20\nJohn Mulaney on the Music That Made Him\nBy\nEvan Minsker\nOctober 19, 2023\n5-10-15-20\nBlonde Redhead’s Kazu Makino on the Music That Made Her\nBy\nNina Corcoran\nOctober 2, 2023\n5-10-15-20\nBlack Thought on the Music That Made Him\nBy\nRyan Leas\nAugust 22, 2023\n5-10-15-20\nThe Music That Made Cosmic Bluesman Lonnie Holley\nBy\nMadison Bloom\nMarch 27, 2023\n5-10-15-20\nDJ Premier on the Music That Made Him\nBy\nDylan Green\nDecember 12, 2022\n5-10-15-20\nFreddie Gibbs on the Music That Made Him\nBy\nDylan Green\nNovember 17, 2022\n5-10-15-20\nBabyface on the Music That Made Him\nBy\nClover Hope\nOctober 3, 2022\n5-10-15-20\nBeth Orton on the Music That Made Her\nBy\nAllison Hussey\nSeptember 8, 2022\n5-10-15-20\nJazz Innovator Vijay Iyer on the Music That Made Him\nBy\nNate Chinen\nJune 28, 2022\n5-10-15-20\nThe Neptunes’ Chad Hugo on the Music That Made Him\nBy\nAlphonse Pierre\nJune 14, 2022\n5-10-15-20\nThe Music That Made Cyndi Lauper\nBy\nJill Mapes\nJune 8, 2022\n5-10-15-20\nThe Music That Made R&B Rebel Swamp Dogg\nBy\nMadison Bloom\nApril 26, 2022\n5-10-15-20\nLavender Country’s Patrick Haggerty on the Music That Made Him\nBy\nAllison Hussey\nMarch 15, 2022\n5-10-15-20\nJuliette Lewis on the Music That Made Her\nBy\nQuinn Moreland\nFebruary 15, 2022\n5-10-15-20\nMichael Stipe on the Music That Made Him\nBy\nRyan Dombal\nNovember 10, 2021\n5-10-15-20\nTori Amos on the Music That Shaped Her Life\nBy\nEric Torres\nNovember 1, 2021\n5-10-15-20\nElvis Costello on the Music of His Life\nBy\nMadison Bloom\nNovember 30, 2020\n5-10-15-20\nAimee Mann on the Music That Made Her\nBy\nEric Torres\nNovember 24, 2020\n5-10-15-20\nThe Music That Made Beverly Glenn-Copeland\nBy\nJesse Dorris\nNovember 5, 2020\n5-10-15-20\nThrowing Muses’ Kristin Hersh on the Music That Made Her\nBy\nPhilip Sherburne\nOctober 28, 2020\n5-10-15-20\nThe Music That Made Miranda July\nBy\nQuinn Moreland\nOctober 20, 2020\n5-10-15-20\nTom Morello on the Music of His Life\nBy\nMatthew Ismael Ruiz\nSeptember 10, 2020\n5-10-15-20\nThe Music That Made Conor Oberst\nBy\nSam Sodomsky\nAugust 21, 2020\n5-10-15-20\nThe Music That Made Laraaji\nBy\nIsabelia Herrera\nAugust 5, 2020\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-01",
      "word_count": 545,
      "fetch_timestamp": "2025-08-19T10:32:37.114061",
      "metadata": {
        "char_count": 3216,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-19T10:32:37.114050"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "Joni Mitchell",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-19\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nRap\nLet God Sort Em Out\nClipse\nBy\nAlphonse Pierre\nJuly 11, 2025\nElectronic\n/\nRap\nO Que as Mulheres Querem\nd.silvestre\nBy\nBenny Sun\nJuly 11, 2025\nRap\nEM0THUG\nMikeBrokeasf\nBy\nOlivier Lafontant\nJuly 11, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-19",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-19T10:32:39.357907",
      "metadata": {
        "char_count": 7685,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T10:32:39.357897"
      }
    },
    {
      "url": "https://pitchfork.com/features/lists-and-guides/9937-the-25-best-music-videos-of-the-1970s/",
      "source": "pitchfork",
      "artist_name": "Joni Mitchell",
      "title": "The 25 Best Music Videos of the 1970s",
      "content": "---\ntitle: The 25 Best Music Videos of the 1970s\nauthor: Eric Harvey\nurl: https://pitchfork.com/features/lists-and-guides/9937-the-25-best-music-videos-of-the-1970s/\nhostname: pitchfork.com\ndescription: From Grace Jones’ erotic castle to Kraftwerk’s singing automatons to Kate Bush’s otherworldly hall of mirrors, these pre-MTV clips helped define what music videos could be.\nsitename: Pitchfork\ndate: 2016-08-23\ncategories: ['features']\n---\nby\nPhoto by: Illustration by Nicole Ginelli\nEven though only a handful of viewers actually saw MTV’s technologically challenged first moments on August 1, 1981, that date has been etched into history as the birth of the music video. But by then, the idea of linking popular music with motion pictures was nothing new.\nPatrons of nightclubs in the 1940s could view Soundies of Fats Waller and Duke Ellington, and the rise of television in the 1950s made pop music a permanently multimedia form: Between “The Ed Sullivan Show” and programs like “Top of the Pops,” “American Bandstand,” and “Soul Train,” musicians have long developed visual styles to accompany their songs.\nThough the phrase “music video” didn’t take hold until the late 1970s, the prototype for the form and its promotional possibilities came with the Beatles’ simple short films for “Paperback Writer” and “Rain,” songs they were loath to recreate live (the video package sent to “Ed Sullivan” in 1966 came with an apologetic intro from the band explaining that the clips were substituting for an in-person appearance). A handful of well-funded and/or forward-thinking musicians started making short promotional films in the early ’70s, and as video technology continued to advance through the decade, many directors fell for its speed, creative possibilities, and easy duplicability—not only expanding the practice, but creating a unique visual aesthetic as well.\nAs the ’70s went on, distribution networks for music videos (throughout this piece, I use “music video” as shorthand, even though it doesn’t directly apply in many cases) started emerging. Local television stations would often air the clips between programs, and discos started streaming them on loop via closed-circuit TV. Actual music video programs started taking shape as well: Australian television had two such shows, and ex-Monkee Mike Nesmith started a program called “Pop Clips” that briefly aired on Nickelodeon a year before MTV’s launch.\nThe music video format proliferated and matured during the 1980s and 1990s, but musicians and filmmakers developed its basic shape and first explored its creative limits during the ’70s, a time of tumult and innovation in the record business, from the rise of arena rock and prog through the emergence of disco, electronic dance music, punk, and new wave. Out of the hundreds of videos created during that heady decade, we’ve selected the 25 that best represent the format’s possibilities, eccentricities, and influence, and added a few dozen runners-up to cover all the bases.\nThe Rolling Stones: “It’s Only Rock ‘N’ Roll (But I Like It)____” (1974)\nBy opening two of their tours to documentary crews—resulting in the iconic Gimme Shelter and the long-unreleased (and thoroughly NSFW) Cocksucker Blues—the Rolling Stones were visual pioneers of rock’s darkest moments and crass excesses. With 1974’s Top 20 single “It’s Only Rock ‘N’ Roll (But I Like It),” however, the band effectively announced it was done blowing minds and would double-down on the basics—a stance that defines the Stones to this day.\nFor the video, Michael Lindsay-Hogg (who filmed ahead-of-their-time clips for the Stones’ “2000 Light Years from Home” and “Jumpin’ Jack Flash” as well as the Beatles’ dissolution documentary Let It Be) had the band mime to the camera, shooting them from below with a wide-angle lens while a gaudy tent inflated around them and soap bubbles gradually infiltrated the set. The song might signify the Stones admitting that innovation was overrated, but Hogg’s simple style would, purposefully or not, reappear to define a significant segment of ’90s MTV: think Hype Williams and the Beastie Boys.\nSee also: The Rolling Stones: “Angie” (1973) and “Miss You” (1978)\nX-Ray Spex: “Identity__” (1978)__\nX-Ray Spex were among the most stylish and musically innovative of the first wave of British punk bands thanks to Marianne Joan Elliott-Said, aka Poly Styrene, the rootless Somali-British 21-year-old who was still wearing braces when her band’s debut album, Germfree Adolescents, was released in 1978.\nStyrene’s political ambit was broadly aimed and sharply delivered, and “Identity” twists the New York Dolls’ gender-bending proto-punk classic into a forceful treatise on women’s representation. “Identity/Is the crisis/Can’t you see?” she wails in the song’s promotional clip, dressed like a ’50s bobby soxer and performing with her band in an old warehouse littered with retired department store mannequins. It’s been said that “Identity” is the one song on Adolescents that doesn’t explicitly deal with anti-consumerist themes, yet Styrene’s own lyrics in the song—“Do you see yourself/On the TV screen/Do you see yourself in the magazine/When you see yourself/Does it make you scream?”—underscore that the perils of consumerism don’t end at getting lost in the supermarket, but extend to the imagery that surrounds young women. In this light, Styrene’s mere presence in this video clip is a political act, offering a new aspirational model.\nSee also: The Jam: “In the City” (1977); The Clash: “London Calling” (1979)\nYellow Magic Orchestra: “Tong Poo__” (1979)__\nYellow Magic Orchestra initially formed in 1978 as a conceptual lark, a group of crate-digging Japanese musicians tweaking the Orientalism of “exotica” pioneer Martin Denny’s music, but they quickly established a significant precedent for electro-pop in Japan and beyond. At a time when Japanese imports were threatening American industrial dominance, YMO’s techno-funk flip of Denny’s 1959 single “Firecracker” became an ultra-rare Japanese-U.S. pop crossover hit—so funky they played it on “Soul Train.”\nThe 8-bit disco of “Tong Poo” had a similarly interesting origin myth—band member Ryuichi Sakamoto based its synth hook on records he found of Cultural Revolution-era Chinese musicians playing American instruments—but its video eschews the political past for a glimpse into the technological future: Three men in tuxes, stoically coaxing grooves from cutting-edge instruments, spliced with lengthy full-screen shots of early video games. The group’s only musical contemporary was Kraftwerk, and while the German quartet were portraying themselves as Soviet constructivist robots, YMO turned themselves into demonstration models in a high-end technological showroom.\nBee Gees: “Lonely Days__” (1970)__\nFew bands of the late ’60s and early ’70s were more melancholy than the Bee Gees, from “I Started a Joke” to “I Lay Down and Die,” “How Do You Mend a Broken Heart,” and “Don’t Wanna Live Inside Myself.” Sad! Despite its title, “Lonely Days” is not totally despondent, but it has a blurry emotional core, moving from a weepy, string-laden ballad into a brassy chorus while never revealing exactly where that loneliness came from. The short film produced to promote the song—the first single released after the band reunited with Robin after his temporary split—offers little explanation other than compelling evidence that the Bee Gees are very successful and incredibly rich. Neither Maurice’s butterfly collection nor his gold records can cheer him up, so he goes for a drive in his black Jaguar; Barry’s home also makes him inconsolably depressed, so he walks his big furry dog on a crowded downtown street before taking off in a Rolls Royce. And poor Robin, the saddest of all the Gibbs, who resorts to pathetically stroking a trophy before driving away from his posh country villa in a new Mercedes. In the end, the three men meet in a field, perform a ritualistic hand gesture, and then drive off in separate cars. So, yeah: Who needs girlfriends?\nSee also: The Bee Gees: “Jive Talkin’” and “Stayin’ Alive” (1977)\nBlondie: “Heart of Glass__” (1978)__\nBeyoncé may have forever taken ownership of the “visual album” concept thanks to her pathbreaking recent releases, but the original idea for such a promotional novelty dates back to 1979, when Blondie worked with director David Mallet to produce videos for each track of their fourth LP, Eat to the Beat. Despite being far ahead of their time, though, none of Eat’s videos are as iconic as the one Mallett produced for “Heart of Glass,” from the band’s 1978 classic, Parallel Lines.\nThe clip for the tune that famously broke Blondie to a mainstream audience (and alienated the puritanical wing of its Lower East Side punk base) highlights Debbie Harry, clad in a single-strap, gray Stephen Sprouse dress and clear plastic heels, and her piercing soprano. Yes, there are plenty of shots of the band jumping around in what for them was the novel space of a disco floor, but the most striking imagery is of Harry herself, stoic in the opening close-up and shoulder-shrugging medium shot, resisting any display of emotion while the radiant track unfolds around her—perhaps shading the CBGB purists a bit in the process.\nSee also: Blondie: “Dreaming” and “Union City Blue” (1979)\nGrace Jones: “Do or Die__” (1978)__\nFor a few months in late 1978, the Italian TV network Rai 2 aired an odd live program called “Stryx,” which featured a variety of short performance pieces with creepy medieval themes. The performances were tightly choreographed and the sets were, for the time, lavishly decorated, a strange visual artifact that hinted at the soon-to-come MTV era. Disco icons like Amanda Lear and Asha Puthli shot their own episodes, as did Brazilian singer Gal Costa, but Grace Jones’ clips supporting her second album Fame are the best.\nSure, the “Stryx” performance doesn’t actually qualify as a music video in the strictest sense of the term, but Jones’ promenading in a frock and bustier through a stagy castle with human hand candle sconces, barnyard fowl, and a nearly naked prince has the power to broaden most rubrics (see also: her clips for “Anema e Core” and “Fame” from the same episode). “Stryx” was quickly canceled after the network received complaints about the show’s racy content; televisual genius often goes unrecognized until long after it is gone.\nSee also: Amanda Lear: “Gold” (1978); Asha Puthli: “Mister Moonlight” (1978)\nPrince: “I Wanna Be Your Lover__” (1979)__\nPrince’s famously coy, taciturn interview with Dick Clark after performing “I Wanna Be Your Lover” on “American Bandstand” is one of pop’s most subtle jabs at the promotional necessity of lip-syncing a single on television. Music videos were gradually easing this burden, and Warner Bros. ended up funding two for “Lover.” The one featuring Prince performing the song with his band (mute the audio on this clip) was scrapped for unclear reasons—many suspected it was too salacious—but the incredibly cheap video that circulated showed Prince at the midpoint between his fledgling early years and Dirty Mind’s new wave breakthrough.\nShot with a backlight-provided halo, the 21-year-old androgyne with the 1,000-yard-stare is front-and-center in the clip. His combination of visual signifiers were sui generis in 1979: the feathered hair, hoop earring, and skin-tight unitard were much more the stuff of a dancer at the time, not an axe-wielding frontman dancing with the swagger of James Brown and Mick Jagger. Prince would of course go on to dominate music video culture for the next decade, but “Lover” stands apart as a simple showcase of a virtuoso on the verge.\nSee also: Sparks: “This Town Ain’t Big Enough for the Both of Us” (1974); Bob Marley & the Wailers: “Is This Love?” (1978)\nGloria Gaynor: “I Will Survive__” (1979)__\nArguably the definitive disco single, “I Will Survive” was written as a defiant kiss-off to an ex-lover (“I should have changed that stupid lock/I should have made you leave your key” is one of the most wonderfully specific breakup laments ever), though its chorus was later embraced by the LGBT community in the wake of the AIDS epidemic. Driven by a slick arrangement and Gloria Gaynor’s powerhouse vocal turn to the top of the Hot 100, “Survive” spawned an iconic video as well, shown on television monitors in discos around the world.\nShot at the New York disco Xenon, Gaynor’s only visual accompaniment in the clip is a skater from the group The Village Wizards, a nod to the deep connections between discotheques and roller rinks. What’s most striking about the video, however, is Gaynor’s solitude, photographed in isolation against a stark black backdrop. Late ’70s disco culture is often understood to be a tribal space, a utopian dream of community. As Gaynor’s video represents, though, discos could complement that ideal by also serving as a milieu for self-empowerment, enhanced by the glorious feeling of solitude amid an electric crowd of strangers.\nSee also: Dr. Buzzard’s Original Savannah Band: “Cherchez La Femme” (1976); Sister Sledge: “We Are Family” (1979)\nThe Alan Parsons Project: “I Wouldn’t Want to Be Like You__” (1977)__\nThe Alan Parsons Project was never known for intellectual understatement—the band’s first LP, 1976’s Tales of Mystery and Imagination, was an Edgar Allan Poe-themed concept album with Orson Welles providing occasional narration. For the 1977 follow-up, the inspiration was Isaac Asimov’s I Robot trilogy, and, though the interpretation was loose, the idea bore fruit: The disco-tinged “I Wouldn’t Want to Be Like You” cracked the Top 40.\nIn the song’s video, produced by the Rock Flicks group that also helmed Queen’s “We Will Rock You,” Parsons unsheathes a creepy mummified cyborg while digging through an archive. He then monitors the creature as it scampers through a UNIVAC tape room (a precursor to the modern server farm) and a Brutalist cityscape, propelled mostly by jump-cuts that sync with the song. At one point, the clip, otherwise a quaint parable for artificial intelligence, borders on slapstick when the strange being uproots a flower that the harried Parsons takes pains to re-plant. Spoiler alert: Once Parsons touches its face, the robot immediately melts into a pile of wires, and the closing credits—a dot-matrix printout of “I Robot”—roll.\nSee also: Pink Floyd: “Money” (1973); Kansas: “Dust in the Wind” (1977); Queen: “We Will Rock You” (1977)\nThe Boomtown Rats: “I Don’t Like Mondays__” (1979)__\nThe morbid origin story of the Boomtown Rats’ second UK #1 single is as wretched now as then: While on tour in the United States in January 1979, frontman Bob Geldof read about a San Diego school shooting that killed two and injured nine. When asked for her rationale, shooter Brenda Ann Spencer claimed: “I don’t like Mondays.” Geldof’s song turned the story into a macabre ditty delivered with stone-faced irony—what he called “the perfect senseless song to illustrate” Spencer’s “perfect senseless act.”\nDavid Mallet’s video treatment predicts the future of the form, mixing hyper-stylized, new-wavy performance footage with loosely narrativized set pieces: a schoolhouse packed with zombie-like schoolchildren slickly transitions through a TV set into a mundane living room scene suggesting British soap “Coronation Street.” “Mondays” would earn significant airplay on MTV a couple of years later, and Mallet became one of music video’s most sought-after directors, all of which Geldof predicted, sort of, in a 1981 “Merv Griffin Show” interview, smack-talking skittish FM radio programmers and predicting that the video format would take rock into the future.\nSee also: The Police: “Message in a Bottle” (1979); Cheap Trick: “Dream Police” (1979)\nABBA: “Take a Chance on Me__” (1977)__\nABBA were the first music video pop stars. In the mid-’70s, when only a few groups were making videos at all, the Swedish quartet made lots of them: a total of 18 between 1974 and 1979 alone, a pace that aligned them closer to the biggest MTV stars of the ’80s and ’90s. It all makes sense, given that ABBA’s career started on TV, with their “Waterloo” victory in the 1974 Eurovision competition.\n“Take a Chance on Me” came after “Dancing Queen” propelled them to global superstardom, though don’t expect any crane shots or special effects past the softcore closeups of Agnetha and Frida, or the Brady Bunch-style quad-screen that accompanies the song’s a capella cold open. The joy in ABBA videos, as in their music, involves the unabashed embrace of heart-on-sleeve dorkiness and a masterful deployment of simple ideas. So in the “Chance” video, we get Frida and Benny jamming tunes in a mod Stockholm pad, Frida and Agnetha mom-dancing, and Benny and Bjorn striking seated poses in a stark white sound studio. With a song this good, there’s no need for much else.\nSee also: ABBA: “Waterloo” (1974), “SOS” (1975), “Dancing Queen” (1976), and “Fernando” (1976)\nJoni Mitchell: “Big Yellow Taxi__” (1971)__\nLadies of the Canyon was Joni Mitchell’s creative and commercial watershed, thanks in part to “Big Yellow Taxi,” her only honest-to-goodness pop song. The single’s environmentalist message is simple and timeless, but its animated music video is much more rooted in its era. Produced by legendary animator John Wilson (Lady and the Tramp, Peter Pan) for a series that ran on “The Sonny & Cher Comedy Hour” in the early ’70s, the “Taxi” short feels born from the colorful antics of late ’60s Hanna-Barbera productions and predicts the manic grooviness of toons to come, like “Schoolhouse Rock” and “Fat Albert.” The clip, like Wilson’s others for the variety show, were less about promoting the songs themselves and more a creative presentation of his own visual auteurism. Narratively, Wilson portrays the song’s lyrics as a story about humanity’s original fall from grace, with Adam and Eve constantly “exposed” thanks to various industrial activities, from mass deforestation to urbanization. Be sure to stick around for the surprise ending.\nSee also: Coven: “One Tin Soldier” (1972); Cher: “Dark Lady” (1974)\nGiorgio Moroder: “From Here to Eternity__” (1977)__\nGiorgio Moroder is not a natural-born pop star. This much is plain in the video for “From Here to Eternity,” during which the Italian innovator bounces genially while miming the song. He does get the importance of imagery, though. In 2016, it’s easy to see Moroder as a collection of kitschy ’70s Euro signifiers—the ‘stache, the white satin jogging suit, the shades—but 39 years earlier, it was a getup that was not only a bit hipper, but practical, allowing a reticent studio rat to negotiate a solo career in the spotlight.\nMoroder’s significant musical legacy is as the direct sonic bridge between ’70s European electronic music and African-American dance music—disco and house, specifically—and the “Eternity” clip positions him where he’s most comfortable: surrounded by racks of glittering, oscillating analog gear. At one point, there’s a closeup on a “voltage control oscillator” readout—the electronic equivalent of a rock video showing a guitarist plugging into an amp. In the long march to authenticate synthesizers and rack-mounted electronics in pop music performance, videos like “Eternity” were perfect propaganda.\nSee also: Donna Summer: “Last Dance” (1978)\nSylvester: “You Make Me Feel (Mighty Real__)” (1979)__\nAfter touring as a drag performer and recording two R&B albums as Sylvester and the Hot Band, Sylvester James switched to disco. Not because he loved the music (he didn’t), but because he knew his theatrical approach would thrive in that format. It did.\nHis hit 1979 single “You Make Me Feel (Mighty Real)” is a significant part of American popular culture not only for its Top 40 crossover success or its formative influence on Hi-NRG disco (and later, Bernard Sumner claimed, “Blue Monday”), but its embrace of black homosexuality as an authentic identity on par with R&B or rock performers’ heterosexuality. In the video, Sylvester moves through a disco with verve and purpose, donning a different guise for each section of the song. He enters by descending a garish staircase in all black leather, adds a touch of executive realness in a white suit, and for the big reveal on the second chorus, unveils a sparkling drag ensemble—one of several on display in the video. Costuming aside, the clip’s most compelling aspect is Sylvester’s gaze. He might not be completely at ease in the music video format, but he compensates by staring straight through the camera, as if daring the viewer to question his legitimacy.\nSee also: The Village People: “YMCA” (1978); Chic: “Le Freak” (1978)\nDavid Bowie: “Life on Mars?____” (1973)\nGiven different circumstances, it’s easy to imagine a parallel universe where David Bowie invented the visual language of music videos in the ’70s. He was much more a stage performer, though, and the clips he made were all very simple up until David Mallet’s 1980 classic for “Ashes to Ashes.” Some may argue that the sci-fi drama of “‘Heroes’” or the Berlin drag-club debauchery of “Boys Keep Swinging” are Bowie’s best of the decade, but give me the gaudy simplicity of “Life on Mars?”\nIn the wake of Ziggy Stardust, RCA rushed to issue earlier material, including “Mars,” originally an album track from 1971’s Hunky Dory, and it shot up the British charts. The clip was shot backstage at the Earl’s Court rock venue in London by famed photographer Mick Rock on the afternoon of the Ziggy concert that devolved into a riot. Because “Mars” predated Ziggy, there’s a bit of historical slipperiness in the costuming: Bowie’s performing a song from the end of his folk period in full glam-rock regalia. And he looked phenomenal, by the way: the ice-blue suit designed by Bowie’s designer/protégé/lover Freddie Burretti balanced by the shocking eye shadow—shown in lingering close-ups that emphasize his alien gaze—and contrasted with his shocking red hair, all washed out by a stark white background. It’s simple but incredibly effective, an important element in Bowie’s extensive, ever-shifting catalog of self-iconography.\nSee also: David Bowie: “Heroes” (1975), “Be My Wife” (1977), and “Boys Keep Swinging” (1979)\nThe Residents: “Third Reich & Roll” (1976)\nIf there is a Mount Rushmore of music video progenitors, San Francisco avant-garde collective the Residents are on it. Before they’d even released their first album in 1974, they undertook one of the weirdest experiments in music history, which doubled as one of the form’s first feature-length works: Vileness Fats. The project, shot from 1972 to 1976 on the relatively new medium of ½\" magnetic tape and intended to be more than 10 hours long, was ultimately scrapped, though a shorter version exists. One of the sets constructed for Vileness was repurposed for a film accompanying the group’s second album, Third Reich ‘n’ Roll, a conceptual work reimagining rock history via Joseph Goebbels; the album cover featured Dick Clark in full Nazi regalia and Side A opened with Chubby Checker’s “The Twist” sung in German. The MoMA-approved video mixes stop-motion animation, German Expressionist aesthetics, and a “band” interpreting “Land of 1,000 Dances” in what appears to be Klan garb made of newspaper. Later, two pork chops introduce a “Wipeout” dance sequence that ends with the Fuhrer himself appearing on a balcony. MTV wouldn’t launch for another five years, but the medium of music video had already reached an early, weird peak.\nSee also: Captain Beefheart: “Lick My Decals Off, Baby” TV ad (1970); Suicide: “Frankie Teardrop” (1977)\nHall & Oates: “She’s Gone__” (1973)__\nThis is the first-ever music video that openly mocked the form. The stranger thing: Hall & Oates did it long before videos were even really a thing. John Oates has said that the band was asked to lip-sync “She’s Gone” for an “American Bandstand”*-*style show shot in New Jersey, and because “they didn’t want to pretend to sing” a breakup song on a teen dance show, they holed up with their own furniture and a bunch of weed in a Philly studio and emerged with this bong-rip promo clip. It never aired. (Oates claimed he leaked to YouTube at some point.)\nIt sure looks like something that stoned 20-somethings would make in the ’70s: a corpselike, Bowie-haired, wooden-wedge-wearing Daryl Hall mimes his singing parts on a talkshow-looking stage set with Oates, wearing a sleeveless tux. Occasionally, there are walkthrough cameos from Hall’s girlfriend Sara Allen (of “Sara Smile”), and a man in a devil suit (their road manager). The climactic action features Oates putting on his tux jacket and playing a solo through fake penguin flippers. Hall & Oates’ legacy is assured, but this clip adds a footnote: Any future video that makes fun of the very concept of pre-recorded promotion—like the Replacements’ “Bastards of Young,” the Roots’ “What They Do,” and Yo La Tengo’s “Sugarcube”—are, to varying degrees, made of this clip’s stardust.\nSee also: Elton John: “Your Song” (1970); Gerry Rafferty: “Baker Street” (1977)\nGeorge Harrison: “This Song__” (1976)__\nOn September 8, 1976, George Harrison was found guilty of “subconsciously plagiarizing” the melody from the Chiffons’ 1962 hit “He’s So Fine” for his own 1970 single “My Sweet Lord,” costing him half a million dollars. Harrison—not above responding to legal headaches in song—expressed his feelings in the cheekiest way possible.\n“This Song,” the brassy first single from Harrison’s 1976 LP Thirty-Three and 1/3, is self-reflexive and satirical, sending up the idea of a pop tune as legal object. The video turns a packed courtroom into a faux concert, featuring a judge/drummer, a bass-soloing bailiff, a stenographer/pianist, and Ronnie Wood in drag as a backup singing juror. Harrison lost the lawsuit, but at least he had the last word: “This Song” debuted during the November 1976 episode of “Saturday Night Live” on which he was the musical guest.\nSee also: John Lennon: “Imagine” (1971); Wings: “Silly Love Songs” (1976)\nXTC: “Making Plans for Nigel__” (1979)__\nAustralia was far ahead of the U.S. and UK in the development of TV programming built around music videos. By the mid-’70s, there were two video shows airing down under: the ABC’s “Countdown” and Channel Seven’s “Sounds Unlimited,” featuring clips made for local bands, including AC/DC. When “Unlimited” was running low on content, a young producer named Russell Mulcahy was asked to shoot some footage. Mulcahy went on to become the medium’s first bona fide auteur, shooting the first video MTV ever aired, along with Duran Duran’s “Rio” and “Hungry Like the Wolf,” Kim Carnes’ “Bette Davis Eyes,” Spandau Ballet’s “True,” and Bonnie Tyler’s “Total Eclipse of the Heart.”\nIn this playful 1979 clip promoting the first single from XTC’s breakthrough album Drums and Wires, it’s easy to see Mulcahy tracing the contours of pop video’s visual style for the first half of the ’80s: non-stop camera movement, canted angles, zooms, gaudy overacting. Narratively, Mulcahy twists a song about a young man’s inexorable march toward a boring adulthood into a mental patient being relegated to a rubber room for a *Clockwork Orange-*meets-Cuckoo’s Nest style re-education. Nigel’s Nurse Ratched is a psychotic clown, played by a constantly mugging-to-camera Andy Partridge while a video screen playing XTC hangs on the wall. It’s clever, super-meta, and incredibly hyperactive—the driving forces not only of MTV’s first decade, but the wide swath of ’80s pop culture that Mulcahy’s work helped inspire.\nSee also: AC/DC: “Jailbreak” (1976); The Buggles: “Video Killed the Radio Star” (1979)\nMichael Jackson: “Rock With You__” (1979)__\nAchieving autonomy from his famed family was a several-year process for Michael Jackson that included shooting The Wiz in 1977, a time when he met Quincy Jones and started frequenting the exclusive Manhattan nightclub Studio 54. The sounds he heard there inspired his solo breakthrough, Off the Wall, and Jackson has cited the thrill of escapism in the decadent club’s celebrity-laden crowd, comparing it to science-fiction films where “you pay $2 and you’re on another planet. You’re not in reality anymore.”\nThe video for “Rock With You,” shot by veteran TV producer Bruce Gowers on a skimpy $3000 budget, transforms Jackson into a lonely alien alighting on earth. The wide collars, polyester jumpsuits, afro hairstyle, and four brothers surrounding him gave way to a new image: Jackson dancing with seeming abandon in a gleaming, silver-sequined suit, with a halo provided by a laser backlight. These moves were among the first glimpses of the astonishing kinesthetic performance art Michael would develop through his subsequent visual work. Eight years before he made a video begging the press to “Leave Me Alone,” here he is, dancing all by himself, like no one’s watching.\nSee also: Michael Jackson: “Don’t Stop Til You Get Enough” (1979)\nKraftwerk: “The Robots__” (1978)__\nThree years after a three-minute edit of “Autobahn” hit the U.S. Top 30, 1978’s The Man-Machine was Kraftwerk’s first deliberate attempt to present themselves as something like a “band,” with a fully designed image and actual pop-structured songs. This is Kraftwerk, of course, and so “The Robots” has hooks, but it also plays with the very notion of public performance: In the video, humans play automatons performing human labor. On a deeper level, the idea for the “Robots” aesthetic merges a cyborg ideology—“We are playing the machines, the machines play us,” Ralf Hütter claimed as the group’s M.O.— with a hyper-modernist aesthetic.\nThe iconic style on display in the video mirrors Karl Klefisch’s legendary cover design, with the band’s red shirts and black ties embracing the starkness of 1920s Soviet constructivism, which celebrated the worker amid rapid industrialization. Though Kraftwerk would move firmly into the information age with its next release, the “man-machine” trope born from the quartet’s fascination with a freshly industrialized eastern Europe would remain the group’s defining image well into the 21st century, inspiring a few other synth-pop innovators along the way.\nSee also: Kraftwerk: “Autobahn” (1975)\nElvis Costello: “Accidents Will Happen__” (1979)__\nElvis Costello & the Attractions recorded a few good-to-great videos for This Year’s Model and Armed Forces, but “Accidents Will Happen” stands apart. A ridiculously cutting-edge clip from video pioneers Annabel Jankel and Rocky Morton of the UK’s Cucumber Studios, its pop-art aesthetic recalls Barney Bubbles’ designs for Stiff Records, and its deployment of shape and color suggests a love of the Italian postmodernism that was flourishing in fashion and design in the late ’70s. It’s a shame that MTV wasn’t around to canonize it, but “Accidents Will Happen” clearly belongs in the category of animated game-changers with Steve Barron’s rotoscoped “Take on Me” clip, the computer-animated “Money for Nothing,” Stephen R. Johnson’s manic “Sledgehammer” video, Michel Gondry’s Lego-tastic “Fell in Love With a Girl,” and the Gorillaz and Jamie Hewlett’s “Feel Good, Inc.” For the first time, a music video not only made an artistic statement that both complemented and stood apart from its song, but invented its own visual argot along the way.\nSee Also: Elvis Costello: “Radio Radio” (1978) and “Oliver’s Army” (1979)\nKate Bush: “Wuthering Heights__” (1979)__\nFittingly for a song with two striking videos—one each for the British and American markets—Kate Bush wrote “Wuthering Heights” not from Emily Bronte’s novel, but after catching the end of a BBC adaptation on TV. The first single from Bush’s debut album got a chart boost from a performance on the UK chart show “Top of the Pops” (that Bush later described as “watching myself die”), which sent it to #1.\nThe British video directed by Keith MacMillan, however, does an infinitely better job of representing what made Bush and her breakthrough song so great. Having studied with English actor and mime Lindsay Kemp (who worked with David Bowie as well), her training is reflected in the video’s stunningly expressive choreography, a combination of ballet, mime, and theater. MacMillan dials back the urge to layer on visual effects too heavily, and when he does, it’s only to multiply Bush (always a good idea), or emphasize her movements. Otherwise, she’s just performing for a video camera on a soundstage drenched in dry ice, but Bush plays to the rafters: Her fluid movements and facial expressions are as exaggerated as her vocal performance. Bush would go on to make several more great videos, but “Wuthering Heights” remains unique for its pre-MTV simplicity and grand unveiling of a peerless musical talent.\nSee also: Brian Eno: “China My China” (1974); Bryan Ferry: “You Go To My Head” (1975)\nDevo: “The Truth About De-Evolution__” (1976)__\nThe same year Ohio National Guard members gunned down four protesters on the Kent State campus, musician Mark Mothersbaugh met art student Gerry Casale and formed a band—more of an art movement set to jittery, minimalist guitar rock, really—and wrote a song called “Jocko Homo.” The track’s title was derived from an old pamphlet Mothersbaugh discovered, distributed by a 1920s Ohio preacher who argued for appending a “d” to the front of the word “evolution.” A few years later, “Jocko” was the centerpiece of a short film called In the Beginning Was the End: The Truth About De-Evolution.\nShot by fellow Kent State student Chuck Statler, Truth opens with the masked Devo members leaving their “factory” job (shot at Akron’s Goodyear museum) to mutilate Johnny Rivers’ 1966 hit “Secret Agent Man” in what looks like a hostage film. This is intercut with—among other things—two men in monkey masks spanking a woman in a short robe with ping-pong paddles bearing the faces of Chairman Mao and Nixon. Then Booji Boy, Mothersbaugh’s simpering child character and the band’s mascot, frantically runs to bring the “news” of de-evolution to his father, General Boy (played by Mothersbaugh’s father), who delivers an address to the medical profession, complete with spastic dancing that predicted David Byrne’s moves from Stop Making Sense. As for poor Booji Boy, the Paul Revere of de-evolution, he wouldn’t make it out alive. In all, Truth was part manifesto, part origin myth, and one of the most compelling introductions a band has ever created. Statler’s film won the top prize at the 1977 Ann Arbor Film Festival, earning Devo the admiration of Brian Eno, who’d produce their debut LP the following year.\nSee also: Suicide Commandos: “Burn it Down” (Chuck Statler, 1977); Devo: “Satisfaction” (Chuck Statler, 1978); Nick Lowe: “Cruel to be Kind” (Chuck Statler, 1979)\nQueen: “Bohemian Rhapsody__” (1975)__\nThis is it—the tipping point of the pre-MTV era of music videos as a promotional tool and extension of a visual aesthetic. The story behind it has turned into music business lore: Queen had to battle with EMI to even get “Rhapsody” released in the first place, with the label worried about the commercial potential of a six-minute suite with no chorus. When it showed immediate signs of popularity, though, the band and label quickly realized they had to figure out a way to perform it on “Top of the Pops”—a promotional necessity that Queen despised. So they hired producer Bruce Gowers and spent an evening creating a piece that could air. There were music videos made before “Rhapsody,” but having one substitute for the live promotion of a single reported to be the most expensive ever produced was the definition of “risky.”\nIt paid off. The song ruled the UK charts for months. And, for the first time, the video defined the public memory of the song. The opening seconds of Gowers’ “Rhapsody” clip alone—a slow fade in to the band singing a capella, arranged in the diamond shape of Mick Rock’s Queen II cover photograph (itself inspired by Marlene Dietrich in Shanghai Express) provided an infinitely more iconic image than any stagey TV performance would. For a viewing audience unfamiliar with pre-filmed pop dramatizations, the effect of an album cover coming to life and singing must have been thrilling, capped by the “Galileo” section call-and-response and Gowers punctuating dramatic changes with video feedback and a kaleidoscope effect created by holding a prism in front of the lens. The performance footage—dominated by Mercury chewing scenery in a white satin jumpsuit—only looks run-of-the-mill because it’s the earliest iteration of a visual style that would dominate the first decade of MTV.\nWhen “Rhapsody” resurfaced in the opening scene of Wayne’s World in early 1992, the video gained an unexpected second life. To meet its resurgent popularity, Queen re-released the single with a new video that re-cut Gowers’ original with clips from the film. MTV was just over 10 years old at that point, but the network’s impact on pop’s iconography was deeply entrenched. And here was the “Rhapsody” video once again, being seen for the first time by a generation of new fans, contextualized as the network’s own genesis.\nSee also: Queen: “You’re My Best Friend” (Bruce Gowers, 1976) and “Somebody to Love” (Bruce Gowers, 1976)",
      "author": "Eric Harvey",
      "published_date": "2016-08-23",
      "word_count": 5968,
      "fetch_timestamp": "2025-08-19T10:32:41.118990",
      "metadata": {
        "char_count": 37290,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-19T10:32:41.118983"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/sam-gendel-sam-wilkes-the-doober/",
      "source": "pitchfork",
      "artist_name": "Joni Mitchell",
      "title": "Sam Gendel / Sam Wilkes: The Doober",
      "content": "---\ntitle: Sam Gendel / Sam Wilkes: The Doober\nauthor: Dash Lewis\nurl: https://pitchfork.com/reviews/albums/sam-gendel-sam-wilkes-the-doober/\nhostname: pitchfork.com\ndescription: Read Dash Lewis’ review of the album.\nsitename: Pitchfork\ndate: 2024-05-07\n---\nAbout a quarter of the way into “Sweet Fire,” Sam Gendel interrupts himself with a raspy, scraping yelp. Moments before, he’d been skronking away on his C-melody saxophone, lobbing a torrent of notes into the spaces around Sam Wilkes’ bouncing bassline. Suddenly, his voice erupts, as though he’s been stung by a hornet or grabbed hold of a searing hot pan. It’s not a howl of pain, but a fleeting exorcism, the power of the jam compelling him to release the spirit. In true call-and-response jazz tradition, he puts the sax back to his lips and conjures a couple of equally coarse honks from the instrument before resuming his dexterous cascade.\nThat flash of primal joy succinctly conveys the feeling of discovery permeating The Doober, the third album in the Los Angeles experimental jazz duo’s Music for Saxofone and Bass Guitar series. As on their first two records, the pair culled these songs from live performances, editing out the audience but keeping the crackling energy intact. Studios allow artists to shape, overdub, and edit their way into an idea, but playing live is inherently raw; feeling the vibe of a room, communicating without speaking, and leaving space for chance are more immediate paths to transcendence. The Doober is another document of these musicians’ innate chemistry and trust, finding magic in the journey with no real destination in mind.\nMany of these songs are covers—or at least they start that way. There’s nothing especially faithful about these versions; Gendel and Wilkes are more interested in spacious textural exploration. On “Rugged Road,” they extract the chorus melody from Judee Sill’s yearning psych-folk classic “There’s a Rugged Road” and turn it into a wriggling, cartoonish mass. As the intensity builds, Gendel and Wilkes somersault over each other, layers of sax and bass swirling into a Tasmanian Devil cloud before collapsing, grinning and exhausted. In their hands, Joni Mitchell’s “The Circle Game” becomes a modal study, shifting around itself like a deconstructed Rubik’s Cube. As the minimal drum machine pattern gets more motorik, Wilkes locks his Fender P-Bass into a repetitive groove while Gendel builds a tower of looped drones. Each track on The Doober is a framed photo of outer space, presenting the infinite in a digestible container.\nThey’re not innovators of form here—jazz musicians have long treated entries in the canonical songbook as blueprints rather than maps. Gendel and Wilkes do it with a cheeky sense of abandon. Their choice of interpolations is sometimes absurd—who knew there was such an aching, rain-streaked jazz number at the heart of Sheryl Crow’s “Tomorrow Never Dies,” the opening theme for perhaps the worst James Bond movie? In the final minute and a half of “Ben Hur,” one of the album’s finest moments, the duo’s cover of Miklós Rózsa’s “Love Theme (From Ben Hur)” melts deliciously into Chris Isaak’s “Wicked Game,” Gendel’s sax pooling around a bizarre clip-clop percussion loop. There’s a palpable glee to the album, an almost mischievous acknowledgment that any piece of music can become an invitation to greater freedom.",
      "author": "Dash Lewis",
      "published_date": "2024-05-07",
      "word_count": 536,
      "fetch_timestamp": "2025-08-19T10:32:43.289063",
      "metadata": {
        "char_count": 3381,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T10:32:43.289056"
      }
    }
  ],
  "total_articles": 5,
  "total_words": 9918,
  "extracted_at": "2025-08-19T10:32:43.289393",
  "urls_processed": [
    "https://pitchfork.com/features/lists-and-guides/best-music-books-of-2024/",
    "https://pitchfork.com/features/5-10-15-20/",
    "https://pitchfork.com/reviews/albums/",
    "https://pitchfork.com/features/lists-and-guides/9937-the-25-best-music-videos-of-the-1970s/",
    "https://pitchfork.com/reviews/albums/sam-gendel-sam-wilkes-the-doober/"
  ]
}