{
  "artist_name": "Kim Gordon",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/kim-gordon-the-collective/",
      "source": "pitchfork",
      "artist_name": "Kim Gordon",
      "title": "Kim Gordon: The Collective",
      "content": "---\ntitle: Kim Gordon: The Collective\nauthor: Shaad D’Souza\nurl: https://pitchfork.com/reviews/albums/kim-gordon-the-collective/\nhostname: pitchfork.com\ndescription: Read Shaad D’Souza’s review of the album.\nsitename: Pitchfork\ndate: 2024-03-08\n---\nKim Gordon, like everyone, is addicted to her phone. Her vicious and brilliant second solo album, The Collective, shares its name with a painting she exhibited at New York’s 303 Gallery last year; 27 iPhone-sized holes had been punched out the canvas, each gap a cute little reminder of every synapse you’ve fried watching parkour clips or chasing the infinite scroll. The album itself is even less subtle: Powered by ear-splitting trap beats and churning industrial guitar, anchored by lyrics in which Gordon recites packing lists or mutters about driving in Los Angeles, The Collective is a maelstrom of mundane thoughts and funny asides and flashes of pure rage whipped into a heavy, unnerving fog. It sounds how TikTok brain feels.\nIt’s a provocative but fitting new mode for Gordon, who, for over 40 years, has intermingled caustic experimental art with a mordant curiosity about mainstream culture. For every obtusely confrontational side project like Free Kitten, there is a Ciccone Youth, the Sonic Youth alter-ego dedicated to reinterpreting radio confections like “Into the Groove” and “Addicted to Love.” She holds down Body/Head, an elliptical guitar drone project with Bill Nace, yet also serenaded Rufus Humphrey and Lily van der Woodsen at their wedding on Gossip Girl. On The Collective, she lays her trademark breathy sprechgesang over what can only be described as Ken Carson-type beats, diving fully into the trap experiments she first tried on 2019’s No Home Record; sometimes, as on opening track “BYE BYE,” she genuinely sounds like a SoundCloud rapper, nonchalantly distending the names of luxury clothing brands: “Bella Freud, Y-S-L, Eck-haus-Lat-ta.”\nNo Home Record, Gordon’s first solo album after making music in bands for 38 years, was thematically oblique, but on songs like “Earthquake” and “Murdered Out,” her stoic visage slipped, revealing lyrics that sounded like stinging, unapologetic rebukes to a persona non grata in Gordon’s life. The Collective, made once again with alt-pop producer Justin Raisen (Sky Ferreira, Charli XCX), puts aside the score-settling in favor of fractured, stream-of-consciousness lyrics that mostly eschew poetry or diarism. The unrelentingly noisy vibe is appealingly impulsive and lizard-brained, like you’re hearing someone remind themself to form thoughts: She mumbles about buying overpriced potatoes and leaving out money for the cleaner, stretches the phrase “bowling trophies” into the album’s closest approximation of a melody, and wails something that sounds like a religious prophecy on “The Believers.” While recording, Raisen encouraged Gordon to bring her “abstract poetry shit,” and the resulting album feels simultaneously dense and invigorating; on “I Don’t Miss My Mind,” asides about home furnishings brush up against a goblin-voiced call to “suck it up/fuck it up” and a hazy memory of “crying in the subway.” There’s no lyric sheet, and many songs feel like Rorschach tests asking whether you hear resilience or brokenness, sex or violence, mundanity or surrealism. Often, it’s hard to tell the difference.",
      "author": "Shaad D’Souza",
      "published_date": "2024-03-08",
      "word_count": 505,
      "fetch_timestamp": "2025-08-20T08:36:24.246510",
      "metadata": {
        "char_count": 3339,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:36:24.246443"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/words-of-wisdom-from-kim-gordon-and-laurie-anderson/",
      "source": "pitchfork",
      "artist_name": "Kim Gordon",
      "title": "Words of Wisdom From Laurie Anderson and Kim Gordon",
      "content": "---\ntitle: Words of Wisdom From Laurie Anderson and Kim Gordon\nauthor: Pitchfork\nurl: https://pitchfork.com/features/podcast/words-of-wisdom-from-kim-gordon-and-laurie-anderson/\nhostname: pitchfork.com\ndescription: This episode of the Pitchfork Review podcast features an interview with the two music legends about maintaining your sanity as an artist, the fight for reproductive rights, and the essay collection This Woman’s Work.\nsitename: Pitchfork\ndate: 2023-05-11\ncategories: ['features']\n---\nOur weekly podcast includes in-depth analysis of the music we find extraordinary, exciting, and just plain terrible, along with interviews with some of our favorite artists. This week, Editor-in-Chief Puja Patel talks to boundary-breaking icons Laurie Anderson and Kim Gordon, as well as writer and editor Sinéad Gleeson, to discuss the essay anthology This Woman’s Work, which was edited by Gordon and Gleeson, and features a piece about Anderson. The interview took place in May 2022 as part of the Chicago Humanities Festival.\nListen to this week’s episode below, and follow The Pitchfork Review here. You can also check out an excerpt of the podcast’s transcript below.\nPuja Patel: Laurie, how have you navigated the act of work and creating art for so long while also trying to maintain your sanity?\nLaurie Anderson: I have not, at all. [laughs] It’s really hard to do. But I also don’t particularly think of this as a work. I never really did when I was starting out as a visual artist. Not one artist I knew ever thought we would make a living doing this stuff. It was not at all like the kind of professionalism that’s going on now. I was really starting out close to the ’60s with that idea of: We’re gonna dance down the road and just see what happens, and the people who are going to get jobs were idiots. [laughs] We felt sorry for them. They were just sad. So I never thought of it as work.\nI also never knew who I was working for, which is a big issue when you’re thinking of work. I remember a headline from a British newspaper, something like, “Britain Loses Millions of Man Hours Due to Sickness.” And I was like, “Britain loses? You owe Britain your man hours?” So “Who are you working for?” has become more of a question for me than it used to be, because I used to just do it because I liked it. I still do it because I like it.\nMore recently, I’ve been thinking about work as part of our hyper-mediated culture, where every single thing you do you have to comment on: Did you like that? How much did you like it? How much do you like yourself today? You’re constantly assessing yourself in this self-made surveillance culture that we’re in. It’s exhausting. That to me is work, to be constantly reporting how well you’re doing and how well that taxi ride went. The assessment and putting things in ranks has become really out of control.\nPatel: So you’re talking to the editor of Pitchfork. [laughs]\nAnderson: I know. Well, I have to say one thing about press: I appreciate when I read it for other people, and I like to read about what’s going on, but my life improved one thousand percent about 10 years ago when I stopped reading absolutely anything about myself. I try to stay out of the heavily mediated world that is always grinding out opinion, even though I really appreciate good writing; the worst review I ever got, which was about around the time I stopped reading these books, was the best-written one. So I wrote to this journalist. I said, “You are wasting your time doing this stuff. Write a novel.” Five years later, I got a novel in the mail from this guy—and it was really, really good.",
      "author": "Pitchfork",
      "published_date": "2023-05-11",
      "word_count": 625,
      "fetch_timestamp": "2025-08-20T08:36:24.268482",
      "metadata": {
        "char_count": 3624,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:36:24.268475"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/18521-kim-gordon-murdered-out/",
      "source": "pitchfork",
      "artist_name": "Kim Gordon",
      "title": "Kim Gordon: “Murdered Out”",
      "content": "---\ntitle: Kim Gordon: “Murdered Out”\nauthor: Seth Colter Walls\nurl: https://pitchfork.com/reviews/tracks/18521-kim-gordon-murdered-out/\nhostname: pitchfork.com\ndescription: The single was produced by Justin Raisen\nsitename: Pitchfork\ndate: 2016-09-12\n---\nKim Gordon’s voice is one of the great instruments in post-punk history, though she doesn’t always get credit for the variety of her technique. Some of her tricks have become so iconic, it’s easy to think Gordon’s just doing Gordon on the mic. But when you take a broader view of her career, both inside and outside Sonic Youth, the singer’s varied effects are undeniable. The teasing sexiness of “Bull in the Heather,” the near spoken-word of “Kool Thing,” the guttural anarchy of “Orange Rolls, Angel’s Spit,” and the pained questing of “Last Mistress”—none of this is the work of an artist on auto-pilot.\n“Murdered Out,” the first song she’s released under her own name, offers another vantage on the inexhaustibility of her sound. The single doesn’t just free her from old band names, it also gives Gordon new textures to work with. The song’s medium-tempo beat, sketched by producer Justin Raisen and played live by Warpaint’s Stella Mozgawa, is funkier than anything favored by Sonic Youth drummer Steve Shelley. Over a simple, repeating bass pattern, Gordon adds guitar scrapings—as well as a vocal part that sounds both celebratory and cautionary. “Turn me on,” Gordon repeats at the outset, before revealing the consequence that awaits any fulfillment of her objective: “You get lost… murdered out of my heart.”\nThe title of the song is officially a testament to the no-logo practice of blacking out identifying marks on vehicles. Though the confessional nature of Gordon’s past lyrics (and memoir) makes broader identification impossible to resist. On this track, her familiar raspy cadences and occasionally key-less intonations create a new poetic effect: one of drastic, cathartic renewal. Hers might not be the kind of vocal range they teach in the conservatory, but Gordon’s results continue to speak for themselves.",
      "author": "Seth Colter Walls",
      "published_date": "2016-09-12",
      "word_count": 324,
      "fetch_timestamp": "2025-08-20T08:36:24.336175",
      "metadata": {
        "char_count": 2087,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:36:24.336167"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/17096-yokokimthurston/",
      "source": "pitchfork",
      "artist_name": "Kim Gordon",
      "title": "Yoko Ono / Kim Gordon / Thurston Moore: YOKOKIMTHURSTON",
      "content": "---\ntitle: Yoko Ono / Kim Gordon / Thurston Moore: YOKOKIMTHURSTON\nauthor: Stuart Berman\nurl: https://pitchfork.com/reviews/albums/17096-yokokimthurston/\nhostname: pitchfork.com\ndescription: The most surprising thing about YOKOKIMTHURSTON is that it took until 2012 to happen. After all, what are Sonic Youth if not the modern manifestation of the avant/rock ideal that Yoko and her late husband John Lennon forged with Plastic Ono Band?\nsitename: Pitchfork\ndate: 2012-09-28\n---\nThe most surprising thing about YOKOKIMTHURSTON is that it took until 2012 to happen. Thurston Moore and Kim Gordon have long been vocal cheerleaders for #TeamYoko, whether enlisting their daughter Coco to \"cover\" one of Ono's earliest scream experiments (\"Voice Piece for Soprano\") on 1999's SYR 4: Goodbye 20th Century, or penning fan-letters-as-song (\"Ono Soul\", from Moore's 1995 solo effort, Psychic Hearts), even though they don't seem to be big fans of Double Fantasy. Ono, for her part, has welcomed interaction with her various alt-rock progeny-- most notably on 2007's indie star-studded remix collection Yes I'm a Witch-- but the fact that an artist who averages a couple of new albums per decade has devoted a full-length collaboration to Kim and Thurston suggests that indie rock's perennial power couple must hold a special place in her heart. After all, what are Sonic Youth if not the modern manifestation of the avant/rock ideal that Yoko and her late husband John Lennon forged with Plastic Ono Band-- a symbolic, spiritual kinship reinforced by the fact that Sonic Youth played their first gig, in the East Village, mere months after Lennon's murder uptown.\nBut if a collaboration between these three was inevitable, its timing is uncanny: It represents Moore and Gordon's first musical release together since announcing their separation after 27 years of marriage. While it would be overly presumptuous to believe that Moore and Gordon's union here has any bearing on the future of their relationship, it's heartening that they've chosen to spend this moment of their lives with Ono, a woman who understands all too well the difficult dance between creativity and matrimony. As such, YOKOKIMTHURSTON is not so much a decibel-bursting showcase for the Queen of Noise and her unruly understudies as a conversation between intimates speaking in tongues and tangles-- a voyeuristic glimpse into a private, discomfiting exchange.\nTo underscore the clandestine nature of this meeting and instantly ward off casual onlookers, Ono spends the first two minutes of opener \"I Missed You Listening\" demonstrating the entire emotional range of her voice-- from baby-cute cooing to demon-possessed laughter to orgasmic ecstasy to the panic-attack terror of someone whose anesthetic has worn off mid-surgery. It's a move that immediately establishes the album's lawless environment. But, as the song jabbers past the nine-minute mark without introducing any significant changes, you realize the philosophy here is one of understated anarchy.\nComposed mainly of Ono's instinctual reactions to Gordon and Moore's spidery guitar scrapes, and of Ono's hushed, spoken-word interactions with Gordon-- YOKOKIMTHURSTON feels both exhaustively sprawling and claustrophobically hermetic. Its six tracks average 10 minutes each, but don't so much chart an evolutionary course as stubbornly linger on a sensation of creeping unease. Even as the album turns considerably noisier and gnarlier in its final two pieces (the tortured mantra \"Let's Get There\" and the 14-minute apocalypse \"Early in the Morning\"), there's little in the way of release or resolution; it's the same sense of stasis projected on a louder, uglier scale. That said, the latter track acquires something resembling a dramatic arc if you interpret Gordon's repeated gnashed-teeth grunts of \"my townhouse!\"-- and Ono's horrified reactions to them-- as a comment on the price of an Upper West Side brownstone.",
      "author": "Stuart Berman",
      "published_date": "2012-09-28",
      "word_count": 605,
      "fetch_timestamp": "2025-08-20T08:36:24.376741",
      "metadata": {
        "char_count": 3948,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:36:24.376733"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "Kim Gordon",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-20\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nRap\nStar Line\nChance the Rapper\nBy\nAlphonse Pierre\nAugust 20, 2025\nRock\nLove Is Like\nMaroon 5\nBy\nLinnie Greene\nAugust 20, 2025\nExperimental\nKhadim\nMark Ernestus’ Ndagga Rhythm Force\nBy\nRae-Aila Crumble\nAugust 20, 2025\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-20",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-20T08:36:24.909976",
      "metadata": {
        "char_count": 7698,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:36:24.909961"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/bodydillowayhead-bodydillowayhead/",
      "source": "pitchfork",
      "artist_name": "Kim Gordon",
      "title": "Body/Dilloway/Head: Body/Dilloway/Head",
      "content": "---\ntitle: Body/Dilloway/Head: Body/Dilloway/Head\nauthor: Jonathan Williger\nurl: https://pitchfork.com/reviews/albums/bodydillowayhead-bodydillowayhead/\nhostname: pitchfork.com\ndescription: Read Jonathan Williger’s review of the album.\nsitename: Pitchfork\ndate: 2021-11-29\n---\nOpen the gatefold of Aaron Dilloway’s 2012 album Modern Jester and the phrase “SHATTER ALL ORGANIZED ACTIVITIES'' is unmissable, its bold letters splayed in stark monochrome. Dilloway’s music abides by this chaotic imperative, ranging from warbled abstractions and barely-there tape hiss to crushing loops of found sound mangled beyond recognition. But he also acts as the fulcrum of a dynamic community of experimental musicians from the Midwest and beyond. His label Hanson has provided a platform for countless noisers, and he has released dozens of collaborative albums over the past two decades. Despite the hermetic impulse that drives his solo tape music, Dilloway is always drawing others into his surreal mirror world, where his collaborators’ artistic visions are splintered and reassembled in bewildering ways.\nThis is especially true of Body/Dilloway/Head, his first collaboration with Kim Gordon and Bill Nace’s guitar duo. The union makes a great degree of sense. All three musicians are some of the most accomplished improvisers in the American underground, and in the decade since Sonic Youth split, Body/Head’s three albums have masterfully deconstructed rock music by saturating it with negative space, much the way Dilloway has reimagined noise. But few could have predicted the way this collaboration seems to unravel their respective styles into a miasmic swirl with a black hole tugging at its center.\nIt’s unclear exactly how this music was made, but all clues (including a statement by Gordon insinuating as much) point to Dilloway being handed a grip of unreleased Body/Head tapes and feeding them through his various apparatuses and effects. Looped snippets of distorted guitar sputter alive and recede just as quickly, and the queasy sound of tape speeding up and slowing down is a dominant feature from the album’s opening to its final minutes. Still, it would be reductive to describe this as a Dilloway album with Gordon and Nace’s music as the source material. Their singular guitar tones, open chords ringing behind sheaths of distortion and delay, remain intact and are pushed dramatically to the fore at various points. And then there’s Gordon’s voice, its oracular drawl made even more mysterious as it is sliced up and reassembled into an inscrutable mosaic.\nMusic made primarily with magnetic tape has an inherent sense of time-shifting, which Dilloway tinkers with repeatedly. The more he lets entire sections of entwined guitar drift play out, allowing the listener to momentarily forget there’s an extra layer of manipulation at play, the more shocking are the moments of disruption. Are we listening to Body/Head ruminate on this strange riff, or is that one of Dilloway’s loops, generated long after their amps shut off? That ambiguity, as well as the startling passages where time seems to fold in on itself—or stop completely as the tape cuts out—is central to the disorienting nature of the album. We’re left constantly wondering if our ears are playing tricks on us or if, perhaps, our own playback device is malfunctioning.\nThe bleak negative space that extends across Dilloway’s and Body/Head’s discographies often manifests as quietness. Quietness is one of those magical qualities in music that draws you closer, inviting more attentive listening. The first five minutes of “Body/Erase,” which stretches over Body/Dilloway/Head’s entire A-side, consists of a low, droning hum that spits up soft crackles of noise, almost inaudible if you’re hearing it on speakers without much bass response. Each time I listen it pushes me to the edge of my seat, straining to hear every muted slip of magnetic tape against the head; only once it has my undivided attention does it coalesce into a cathartic mass of sound. This music is demanding—of your patience, of your attention, of your tolerance for cacophony—but the reward is a fascinatingly confounding journey through the fragmented mirror world.\nBuy: Rough Trade\n(Pitchfork earns a commission from purchases made through affiliate links on our site.)\nCatch up every Saturday with 10 of our best-reviewed albums of the week. Sign up for the 10 to Hear newsletter here.",
      "author": "Jonathan Williger",
      "published_date": "2021-11-29",
      "word_count": 687,
      "fetch_timestamp": "2025-08-20T08:36:24.941972",
      "metadata": {
        "char_count": 4439,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:36:24.941962"
      }
    },
    {
      "url": "https://pitchfork.com/features/",
      "source": "pitchfork",
      "artist_name": "Kim Gordon",
      "title": "Music Articles & Features",
      "content": "---\ntitle: Music Articles & Features\nauthor: Condé Nast\nurl: https://pitchfork.com/features/\nhostname: pitchfork.com\ndescription: Longform and in-depth analysis about the most exciting and important music being released today\nsitename: Pitchfork\ndate: 2025-08-14\ntags: ['web']\n---\nDekmantel Is a Dance Festival Shedding Light on the Underground\nWe touched down in Amsterdam for the 2025 edition of the left-of-center electronic festival and came back with some thoughts about live sets, drum heads, speaker cabinets, bass fiends, techno lords, and the simple power of naming some club-ready bangers.\nBy Jeremy D. Larson\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nNight Out 2025: Pitchfork and Them’s Showcase for the Future of Queer Music\nBy Olivier LafontantPhotography by Dillon Edlin\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nWhat Happened at Pitchfork’s Bladee Zine Launch\nBy PitchforkPhotography by Caroline Friedman\nA Rare Interview With Bladee, the Mystic Oracle of Internet Rap\nBy Meaghan GarveyPhotography by Jason Nocito\nHighlights From Pitchfork’s 2024 Year in Music Club Night\nBy PitchforkPhotography by Sam Wachs\nHighlights From Pitchfork and Thought Enthusiast’s Year in Music Panel\nBy PitchforkPhotography by Sam Wachs\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 18 Best Moments From Pitchfork Music Festival 2024\nBy Boutayna Chokrane, Nina Corcoran, and Heven Haile\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nHow Waxahatchee Made the Album of Her (Second) Life\nBy Andy CushPhotography by Bobby Doherty\nChasing the Goblin With Mabe Fratti, the Guatemalan Cellist at the Heart of Mexico City’s Avant-Rock Scene\nBy Philip SherburnePhotography by Filip Preis",
      "author": "Condé Nast",
      "published_date": "2025-08-14",
      "word_count": 347,
      "fetch_timestamp": "2025-08-20T08:36:25.251125",
      "metadata": {
        "char_count": 2280,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:36:25.251110"
      }
    },
    {
      "url": "https://pitchfork.com/features/lists-and-guides/",
      "source": "pitchfork",
      "artist_name": "Kim Gordon",
      "title": "Lists & Guides",
      "content": "---\ntitle: Lists & Guides\nauthor: Condé Nast\nurl: https://pitchfork.com/features/lists-and-guides/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2025-08-06\ntags: ['web']\n---\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nThe 62 Best Albums of 2023 So Far\nBy Dylan Green, Anna Gaca, Jeremy D. Larson, Sam Sodomsky, and Cat Zhang\nThe 48 Most Anticipated Albums of Fall 2023\nBy Madison Bloom, Nina Corcoran, Allison Hussey, Hattie Lindert, Evan Minsker, Jazz Monroe, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres\n17 Artists on Their All-Time Favorite Rap Songs\nBy Andy Cush, Jayson Greene, Clover Hope, and Alphonse Pierre\nThese Queens Can Sing: The 15 Best Songs by Today’s Drag Performers\nBy Julianne Escobedo Shepherd\nThe 30 Best Queer Music Movies\nBy Eric Torres, Nadine Smith, Tatiana Lee Rodriguez, Michelle Hyun Kim, and Emma Madden\nThe 46 Most Anticipated Albums of Summer 2023\nBy Alphonse Pierre, Madison Bloom, Evan Minsker, Eric Torres, Allison Hussey, Nina Corcoran, Jazz Monroe, Marc Hogan, and Matthew Ismael Ruiz\nThe 30 Best Music Festivals of 2023\nBy Evan Minsker, Jazz Monroe, Allison Hussey, Madison Bloom, Nina Corcoran, Eric Torres, and Matthew Strauss\nThe 43 Most Anticipated Albums of Spring 2023\nBy Jazz Monroe, Evan Minsker, Allison Hussey, Eric Torres, Nina Corcoran, Madison Bloom, and Matthew Strauss\nThe 34 Most Anticipated Albums of 2023\nBy Jazz Monroe, Rob Arcand, Marc Hogan, Eric Torres, Allison Hussey, Nina Corcoran, and Matthew Strauss\nThe 34 Most Anticipated Albums of Fall 2022\nBy Rob Arcand, Madison Bloom, Jane Bua, Nina Corcoran, Heven Haile, Allison Hussey, Evan Minsker, Jazz Monroe, Quinn Moreland, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres\nThe 37 Most Anticipated Albums of Summer 2022\nBy Madison Bloom, Nina Corcoran, Allison Hussey, Evan Minsker, Quinn Moreland, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres",
      "author": "Condé Nast",
      "published_date": "2025-08-06",
      "word_count": 410,
      "fetch_timestamp": "2025-08-20T08:36:25.559823",
      "metadata": {
        "char_count": 2614,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:36:25.559809"
      }
    },
    {
      "url": "https://pitchfork.com/features/lists-and-guides/best-electronic-music-2024/",
      "source": "pitchfork",
      "artist_name": "Kim Gordon",
      "title": "The Best Electronic Music of 2024",
      "content": "---\ntitle: The Best Electronic Music of 2024\nauthor: Pitchfork\nurl: https://pitchfork.com/features/lists-and-guides/best-electronic-music-2024/\nhostname: pitchfork.com\ndescription: Featuring Burial, Djrum, Eris Drew, Floating Points, Four Tet, Heavee, Joy Orbison, Kim Gordon, Seefeel, Skee Mask, Yaeji, and more.\nsitename: Pitchfork\ndate: 2024-12-05\ncategories: ['features']\ntags: ['best of 2024']\n---\nThe definition of electronic music has never been broader. It might mean hyperpop or drum’n’bass, Balearic or footwork, Colombian club or Brazilian funk, post-everything ambient or good old Chicago house. This year’s best electronic releases tick all those boxes and more, touching on Egyptian street styles, the Afro-Portuguese diaspora, and a 71-year-old former punk along the way. In alphabetical order, these are our 35 favorite electronic releases of the year.\nCheck out all of Pitchfork’s 2024 wrap-up coverage here.\n(All releases featured here are independently selected by our editors. When you buy something through our retail links, however, Pitchfork may earn an affiliate commission.)\nA. G. Cook: “Silver Thread Golden Needle”\nMaybe A. G. Cook is crazy for testing the attention span of his chronically online audience with a 10-minute album intro. Or maybe “Silver Thread Golden Needle,” the bionic opener to Cook’s Britpop, is scintillating enough to stay fixated on. The song refracts like a prism at high noon, filled with stuttering blips that shapeshift at each turn. And the merry-go-round of yelps and vocal chops at its core gleam like Christmas morning. A. G. Cook’s electronic epic is everything popular music has become: digital, synthetic, amorphous—ultimately just a WAV file in some sticker-laden Macbook. Well, it’s everything but concise. But there’s no trouble sitting through this one. –Olivier Lafontant\nListen: A. G. Cook, “Silver Thread Golden Needle”\nActress: Statik\nEach new Actress release invites a new way of thinking about the artist, as fans ponder what’s different this time about the way Darren Cunningham approaches his usual fare (cryptic pranks, nostalgia, nostalgic pranks). Statik is one of his simpler, and, thus, more beguiling, case studies: What if he turned the structural trickery down a notch, and turned up the ambience? You may be unsettled by how similar Statik can sound, at times, to any number of previous slow-burn atmospheric thinkers in electronic music—from the ’90s ambient-techno greats through to earlier Actress tunes to today. But the nagging uncertainty that makes Actress fun is still here, jockeying for position under layers of cozy, Actress-ian haze. Cunningham makes anxiety feel unusually comfortable. –H.D. Angel\nListen/Buy: Rough Trade | Amazon | Apple Music | Bandcamp | Spotify | Tidal\nBurial: “Dreamfear”\nOf the dozens and dozens of vocal samples Burial has used throughout his nearly two-decade career, the repeated squelch of the juvenile taunt “Back from the dead, fucked up in the head” on his track “Dreamfear” is probably the funniest. It includes some signature Burial sounds—the threatening synth stabs, the pitched-up vocals, the rainy crinkles for texture—but raises the intensity while lowering the introspection. Instead of feeling like a comment on rave music, “Dreamfear” is rave music, a hardcore take on the sounds Burial was so influenced by but which his productions ultimately inverted. Running a dozen minutes, the track operates like a mini-mix, with various movements taking their turn walloping you with amen breaks. It’s a real puttanesca of hardcore. “I am the lord of ecstasy,” goes one of the other lighthearted vocal samples. Maybe it’s about a drug dealer, maybe not. If Burial is talking about himself, it’s a well-deserved humblebrag. –Matthew Schnipper\nListen: Burial, “Dreamfear”\nCarrier: In Spectra EP\nAntwerp producer Carrier’s In Spectra plays like a bout of musical pins and needles. Pointed drum’n’bass and techno exercises, recalling everything from Monolake to Instra:mental, search for rhythmic relief through stressed, dubby static. Nothing quite resolves the unease. Unfamiliar drum surfaces press where they shouldn’t—or maybe where they should. The three tracks are exactly as functional as you believe they are. A pinched nerve can be a lesson: Listen to how Guy Brewer renders his influences as a cascade of throbbing, elemental pangs, and you’ll appreciate the weights and contours of sounds you may have taken for granted. –H.D. Angel\nListen/Buy: Amazon | Apple Music | Bandcamp | Spotify | Tidal\nd.silvestre: “Taka Fogo em Kiksilver”\nAs a young teenager, Brazil’s Douglas Silvestre would hole up in his bedroom and record cozy, Alex G-inspired song sketches to his phone. That all changed when he attended his first bailes as a 16-year-old, realizing that the blown-out, DIY aggression of funk was “more rock than the rock [he] was making.” Since then, he’s developed a distinctly noisy, brutalist production style, exemplified by “Taka Fogo em Kiksilver.” The track’s instrumental consists of little more than kicks and congas, boosted, then layered until they form an infernal wall of sound. MC MTOODIO, MC LELE 011, and MC DENADAI match its energy, conjuring images of psychosexual anxiety and Quiksilver jackets set ablaze. –Jude Noel\nListen: d.silvestre, “Taka Fogo em Kiksilver”\nDJ Anderson do Paraiso: Queridão\nBrazilian journalist GG Albuquerque invented the term “ambient space funk” to describe the woozy electronic style endemic to Belo Horizonte. Local producer DJ Anderson do Paraiso’s Queridão is spacey in the extreme; in fact, it feels predicated specifically upon the fact that the universe is expanding. The most grudging sort of minimalist, Anderson places most of his emphasis on the yawning void between skeletal drum hits and moody streaks of synth. Floating around his beats is a steady stream of gruff, monotone rapping, interspersed with looped vocal samples and abstracted grunts and coos—porous and shadowy, it feels like the dark matter binding together his bleakly sensuous galaxy. –Philip Sherburne\nListen/Buy: Amazon | Apple Music | Bandcamp | Spotify | Tidal\nDJ Lycox: Guetto Star\nDJ Lycox’s batida is defined by its inertia. No matter how many instrumental loops are knotted on top of each other, or how tuneful they act as a unit, each one moves with consistent, scraping effort. There’s a sly sense of disorientation that comes with using such weighty tools for agile dancefloor bangers; the drill-ish bass glides on opener “YAAAHH” almost feel slight compared to the real drums zooming around them. Clipped-out empty space on the jittery “Pedale Ku El” implies a peak of exertion that’s just out of reach. Even the album’s more sentimental moments, like the conversational music-box sway of “Guetto Love” or the drowsy plucked melodies of “Staring at the Moon,” are steeled by an inner resolve. –H.D. Angel\nListen/Buy: Amazon | Apple Music | Bandcamp | Spotify | Tidal\nDjrum: Meaning’s Edge EP\nDjrum’s own music rarely reaches the batshit velocity of his DJing. When the Oxford artist is throwing records around his three-deck setup, he cuts wildly between beats and breakdowns, making tempo jumps that would make most DJs recoil in fear. But Meaning’s Edge almost captures that energy, following his muse down a hedge maze through genres—drum & bass, techno, downtempo—at breakneck speed. Always one for a little drama, Djrum embellishes these zig-zagging tracks with wind instruments from around the world, sounding jaunty at one moment (the 14-minute, two-part “Freakm” suite) and eerie and foreboding (“Codex,” which sounds like if Jon Hassell got into breakcore through TikTok). The best is the centerpiece \"Crawl,\" assembled from tiny percussive sounds that range from wooden to metallic. It’s like a muscular microhouse at warp speed, cycling through styles until it ends up somewhere close to dub techno and then just ends, leaving you warm and fuzzy but also wondering what just happened. –Andrew Ryce\nListen/Buy: Rough Trade | Amazon | Apple Music | Bandcamp | Spotify | Tidal\nEris Drew: Raving Disco Breaks Vol. II\nIt’s hard to beat that feeling of walking onto a dancefloor and knowing right away: It is popping off in here. That’s the vibe Eris Drew brings in the rave and recreates so well on Raving Disco Breaks Vol. II. Her method goes something like this: Take a crate of bargain-bin gems—like, say, this one (1999, vinyl-only, $2.40 on Discogs) and mix them together with flawless technique and old-school tricks. The result is a god-tier party mix that makes the DJ seem like a musician, the rave a place of unhinged musical possibility, and Drew the perfect vessel for a cosmic energy she has long called the Motherbeat. –Will Lynch\nListen/Buy: Bandcamp\nFloating Points: “Key103”\nSam Shepherd spent the past few years working with and celebrating the life of Pharoah Sanders. It’s both an honor and a burden to carry on the late jazz master’s legacy, and Shepherd has found solace through an old, reliable love: EDM. “Key103,” a highlight on his Floating Points album Cascade, is at once a celebration of dance and life. It begins with a bass drum that resembles a heartbeat. From there, the groove thickens, as does the atmosphere—dashing, dancing, jittering. Shepherd delights in stacking his arrangement with more and more elements—a pinging metallic riff, coin-operated arcade game sounds—before paring it all back, pulling his listener around like they’re on a string. “Key103” is equally suitable for a subterranean dancefloor or post-club comedown, as Shepherd knows that both are where life is often most sharply felt. –Dean Van Nguyen\nListen: Floating Points, “Key103”\nFour Tet: “Loved”\nLike homemade phở or a Mondrian painting, downtempo music sounds like one of those things that seems easy but requires time and touch to make it work. Kieran Hebden has both, and he takes a break from making club hits in 15 minutes lying on his bed and returns to his sampledelic Rounds days with a textured, threnodic song that’s less “these are the breaks” and more “them’s the breaks.” The beat is humble, groovy, and mysterious, and it’s elevated by a silvery melody played on Soma TERRA, a “highly conceptual” microtonal polyphonic synthesizer encased in wood. You could say that’s beside the point, but that’s literally the Four Tet touch. –Jeremy D. Larson\nListen: Four Tet, “Loved”\nHeavee: Unleash\nHeavee was already one of the most creative producers in footwork, a mad scientist holed up somewhere in Chicago adding bright lashings of color and bubbling concoctions of outside influences to the genre’s trademark juddering beats. But Unleash, his first album for avant-club juggernaut Hyperdub, is something else entirely. Accompanied by a whole video game, the LP takes inspiration from RPGs and Saturday morning cartoons; with garish pads, lush instrumentation, and bright hooks, it dresses up footwork’s rhythmic chassis into a regal sedan chair. Finished off with a hip-hop swagger—and streaks of pop and R&B, thanks to guests like BABii and HomeSick—the record squeezes several squares into one larger circle, yielding one of the most idiosyncratic footwork records ever. –Andrew Ryce\nListen/Buy: Rough Trade | Amazon | Apple Music | Bandcamp | Spotify | Tidal\nJ. Albert: I want to be good so bad\nLike shoegaze, dub techno is so capably imitated—enough, at least, that it sounds perfectly satisfying for a semi-distracted listen or three—that it can be a shock to hear something that ticks all the usual boxes while actually doing something different with the form. New York producer J. Albert’s stealthily excellent I want to be good so bad is like that. All the familiar hallmarks are here: the cavernous thump, the dead-channel static, the stone-faced facade betraying the merest suggestion of melancholy. But woven within those well-worn sounds are ephemeral textures and unexpected accents and, best of all, elusive melodic details that might simply be accidents of colliding frequencies, perceptual illusions caught on tape. Immersing yourself in the album is like wandering a district you know inside out and discovering a whole succession of hidden doors and alleyways that you’d swear were never there before. –Philip Sherburne\nListen/Buy: Amazon | Apple Music | Bandcamp | Spotify | Tidal\nJane Paknia / Hagop Tchaparian: “Alice in Orchidverse”\nWelcome to Club Orchid, trippiest of the flowers. Hagop Tchaparian and Jane Paknia roll the deep-dark psychedelic sea over Paknia’s original song “Orchid Underneath,” transforming it into a four-on-the-floor blacklight banger full of hothouse steam, swirling Pucci patterns, and mutant, exposed sensuality. “What does the future smell like?” Funk as in sex and obsession. –Anna Gaca\nListen: Jane Paknia / Hagop Tchaparian, “Alice in Orchidverse”\nJlin: Akoma\nIn the seven years between Jlin’s last proper album, Black Origami, and this year’s Akoma, the Indiana post-footwork producer vastly expanded the reach of her craft, earning a Pulitzer nod for her 2022 EP Perspective and winning famous fans like the Kronos Quartet and Philip Glass. Both of those luminaries appear on Akoma, along with a wisp of Björk’s voice salvaged from an unrealized collaboration. Akoma’s fusion of Midwestern club sounds and modern classical music is striking, but ultimately reinforces how sharp Jlin has always been, a great American composer with or without the validation of the classical-music cognoscenti. –Daniel Bromfield\nListen/Buy: Rough Trade | Amazon | Apple Music | Bandcamp | Spotify | Tidal\nJoy Orbison: “Flight FM”\nInspiration can strike like lightning, especially when all it takes to make a track is a laptop and some headphones. Joy Orbison made “Flight FM”—a floaty UK garage beat and bassline that repeats deliriously, more deranged with each new pass—while waiting for a ride to Lost Village, and then he played it during his set. It was clearly designed for a festival, all audio pyrotechnics and gratuitous edging, and, honestly, it also sounds like it was made quickly—first thought, best thought. “Flight FM” doesn’t even have a drop, but it doesn’t need one. Here, the anticipation comes with waiting for the next pass of the roller coaster loop-de-loop, a pleasure that repeats infinitely. After making so many club anthems—“Ellpisis,” “Hyph Mngo”—Joy Orbison knows a thing or two about dance-music fundamentals, and “Flight FM” is nothing more than the bare bones of a banger. It’s so perfect in its simplicity that even big-tent stars can’t make it more massive. –Andrew Ryce\nListen: Joy Orbison, “Flight FM”\nKassie Krut: “Reckless”\nWho said all the fun dies once you’re married? Recently betrothed couple Kasra Kurt and Eve Alpert, plus their friend Matt Anderegg, made one of the most thrilling, addictive, sugary, scary, seductive singles of the year in “Reckless,” a schoolyard chant that feels like M.I.A. getting in a cage fight with Sleigh Bells. While Alpert’s sweetly taunting vocals are what draw you in at first listen, it’s really Kassie Krut's ingenious clash of strange live percussion and digital noise that makes “Reckless” feel so vital—a match made in heaven (or, more likely, hell). –Shaad D’Souza\nListen: Kassie Krut, “Reckless”\nKim Gordon: The Collective\nLike Kim Gordon’s 2019 album, No Home Record, The Collective is colossal and abrasive like a debris storm. Justin Raisen made a bunch of trap beats for Playboi Carti, then realized that what he just made weren’t “rage beats” but abrasive, seething, actual rage. Kim Gordon added her “abstract poetry shit,” improvised in her decades-long style. The result is a maelstrom of loops crashing into one another, lyrics shattered and left as shards, and of clutter: sonic, mental, and physical. “Bye Bye” is a song about packing stuff for a vacation that sounds like feeding a junkyard car crusher. That same deluge of stuff turns “Shelf Warmer”—a would-be intimate slow jam and relative reprieve from the noise—into trinket after trinket but never a touch.\nGordon, ambivalent about the idea of making music let alone “political music,” resists obvious polemic throughout. The man of “I’m a Man” is a Proud Boy astride a fuck-off monster truck of a beat, but also a pathetic schlub muttering petty fixations as that beat goes limp; a fake-earnest troll hitting all the “lost generation of men” talking points, but also just a person who wants to wear a dress. The record also resists simplistic takes: It’s not her TikTok album or her trap album. It sounds like spending days inside a Big Data server room, pummeled by the light and noise pollution that powers the machines, and excavating what it’s done to your mind. –Katherine St. Asaph\nListen/Buy: Rough Trade | Amazon | Apple Music | Bandcamp | Spotify | Tidal\nLoidis: One Day\nWhen he wants to be, Brian Leeds is one of electronic music’s great sentimentalists. He’s described his swooning ambient work as Huerco S. as a “celebration of love”; as Loidis, he makes what he has called “minimal emo tech”—presumably jokingly, though the project’s debut full-length One Day lives up to the descriptor. On one hand, One Day is truly minimal. Leeds draws on dub techno’s grayscale palette, and it’s rare that any of the record’s eight tracks consists of more than a few repeated, interlocking loops. But he manages to conjure pathos and humanity from these simple components. “Love’s Lineaments,” a 10-minute track at the record’s center, slowly morphs into a delicate drumless interlude. It’s as intimate and heartwarming as a conversation with a loved one in a corner far from the dancefloor amid a long night out. –Colin Joyce\nListen/Buy: Rough Trade | Amazon | Apple Music | Bandcamp | Spotify | Tidal\nMica Levi: “slob air”\nMica Levi is almost perversely unpredictable. Who would attribute the claustrophobic Zone of Interest soundtrack to the producer of Tirzah’s lovelorn R&B, or the avant-rock of Good Sad Happy Bad to the lo-fi stylist behind Ruff Dog? With “slob air,” Levi subverts any expectations we may still have harbored. A dream pop epic, their first single for Hyperdub glides like a skater on a long downhill slant, propelled only by an unchanging drum figure across its 12 minutes. Layers of strings hover and dive, and a chorus of voices chants just beyond the limits of intelligibility. That’s all there is to the track, yet slight variations make “slob air” endlessly, joyfully repeatable. This is a sound that Levi could coast on for as long as they want—until, inevitably, they decide to change lanes once again. –Matthew Blackwell\nListen: Mica Levi, “slob air”\nNaemi: Dust Devil\nDust Devil, the debut album from the Kansas-born, Berlin-based electronic shape-shifter Naemi, doubles as a majestic survey of an international, terminally online underground music scene that prizes earnestness as much as irony. The double LP features an array of guests, like Erika de Casier, Perila, and power couple Shy and Ben Bondy, stretching its slacker-ambient aesthetic across a canvas that includes pillowy downtempo soundscapes, cheesecloth-textured shoegaze, and stoned indie -rock. Sometimes it moves with the focus of someone fully locked in at 3 a.m. in their bedroom, and other moments with the “I can feel everything” interconnectedness of that moment right after you said, “This edible ain’t shit.” Like the ’90s touchstones it references, Dust Devil is ambitious, emotive, and unabashedly sprawling, capturing the artist—and a community—at the inspired peak of their powers. –Andrew Ryce\nListen/Buy: Bandcamp\nNick León / Erika de Casier: “Bikini”\nListening to “Bikini” feels like sipping a frothy French 95 while taking in a gorgeous last-day-of-vacation sunset. The slinky collaboration between Miami dance producer Nick León and Danish R&B experimentalist Erika de Casier conjures up its sun-dappled scene through walloping bass, hyaline synth melodies, and a sprightly pace to match the song’s sunkissed lyrics, complete with a deliciously memorable invitation of a hook: “Meet me at the beach/It’s me in the bikini/The one I always wear/Find me daydreaming,” de Casier coos, just before León pitch-shifts her words down into a frantic, intoxicating demand. Who could possibly say no? –Eric Torres\nListen: Nick León / Erika de Casier, “Bikini”\nNídia & Valentina: Estradas\nThough Estradas was ostensibly built for the dancefloor, it’s easy to get lost in the record’s lush sonic details. The breathy, flute-like arpeggio that loops throughout “Rapido”; the sizzling shakers that buzz around “Nasty” like flies; the globular marimbas that bounce off the title track’s synths as if they were lava lamp bubbles. But above all, there’s the rumble of the drums, intricately recorded by Italian British percussionist Valentina Magaletti and spun to kuduro heaven by Príncipe Discos all-star Nídia Borges. Together, their inversion of Afro-Portuguese rhythms fill the mind with images of sweltering deserts, humid forests, and of course, the vibrating walls of the club, morphing and expanding ever outward into something new. –Sam Goldner\nListen/Buy: Rough Trade | Amazon | Apple Music | Bandcamp | Spotify | Tidal\nObjekt: “Ganzfeld (Djrum Remix)”\nWhen Objekt created his 2014 track “Ganzfeld,” the Berlin-based producer flouted many of the era’s dancefloor conventions, from the song’s tempo (far faster than normal) to its structure (nominally linear but sneakily antic) to its bassline (squirrelly as hell). Ten years later, Djrum’s remix takes a similarly maverick spirit to even more unpredictable extremes. More than 10 minutes long, the remix flips Objekt’s idiosyncratic anthem into a miniature suite: It begins with a contemplative ambient sketch, moves into flickering atmospheric jungle, then slips backward into a half-speed electro stomp with industrial-dub leanings—and that’s all before so much as reaching the halfway mark. (Still to come: woozy jazz-funk, jittery techstep, Amen-smashing jungle; no two bars are alike.) For all the liberties Djrum takes, though, he keeps the original’s unforgettable bass riff intact, underscoring Objekt’s vision in making the whole thing possible. It’s a remarkable homage to a song that predicted club music’s iconoclastic future. –Philip Sherburne\nListen: Objekt, “Ganzfeld (Djrum Remix)”\nOlof Dreijer: “Coral”\nOlof Dreijer’s signatures are unmistakable on “Coral.” The single takes Dreijer’s fascinations with roving melodies and Global South percussive textures and lets them drift toward a more ambient destination. A piano—left in Dreijer’s apartment by a previous tenant, then muted with felt and duct tape—provides the watercolor lead melody, which battles with a pitch-bending synth figure that surges overhead. Against this panoramic wash of sound, Dreijer’s needling, bric-a-brac beat, inspired by the playful lilt of Angolan kuduro, feels refreshingly affectionate: It’s a bit like someone coaxing you off the sand into the ocean, dunking you under the surf, and ruffling your hair. The track’s ebb-and-flow engages all your senses until you want to just float away. –H.D. Angel\nListen: Olof Dreijer, “Coral”\nPeverelist: Pulse Echo EP\nBristol bass-music pacesetter Peverelist broke a five-year hiatus with last year’s Pulse EP, and over the next 13 months dropped two more EPs rendering classic UK club styles in exquisitely detailed fashion—bleepy, brittle, heads down in mood but also sneakily playful. Then, this November, what looked like a trilogy spawned yet another installment, and arguably the best of the bunch. Spanning darkside garage, insouciant grime, and multiple shades of stargazing techno, Pulse Echo is just the latest reminder that as much as Peverelist’s Livity Sound label may have formalized a particular strain of UK club music, he seems determined to stretch his own elastic style with every release. –Philip Sherburne\nListen/Buy: Amazon | Apple Music | Bandcamp | Spotify | Tidal\nSeefeel: Everything Squared\nThere’s always been something eerie about Seefeel’s music, in which dub and ambient flit like furtive ghosts. On Everything Squared, the uncanniness becomes exponential: The British group’s first new material in 14 years sounds like it could have originated from the same mid-’90s sessions that produced its greatest work. The lurching drums, Windex-streak guitars, and despondent sighs all extend directly from 1995’s Succour and 1996’s (Ch-Vox), albums that reimagined what was possible in electronica’s airless outer limits. Yet none of the new material feels the least bit retro. Quite the opposite: Mark Clifford and Sarah Peacock’s crumbling soundscapes seem so thoroughly freed from any kind of historical progression, you begin to wonder if all the band’s albums are really time capsules deposited in our timeline from the band’s own parallel dimension. –Philip Sherburne\nListen/Buy: Rough Trade | Amazon | Apple Music | Bandcamp | Spotify | Tidal\nSkee Mask: Resort\nSkee Mask is so consistently brilliant you might make the mistake of taking him for granted (a quality he shares with his label, Ilian Tape). He’s churned out seven more albums and over a dozen EPs since Shred, his debut LP, dropped in 2016. Defying the laws of creative longevity, all have been more or less excellent. Resort is yet another case of the German artist continuing to meet his own lofty standards. All feathery breakbeats, soothing chords, and the occasional 4/4 thump, it is elegantly fluid and warmly soothing, rooted in rave but suited to cozy solitude. Still, right time, right place—like, say, 7 a.m. at the kind of event this tracklist cheekily calls “the rodeo”—most of these tunes crush a dance floor. Or, more likely, mesmerize one. –Will Lynch\nListen/Buy: Apple Music | Bandcamp | Tidal\nSyclops: Black Eye\nUnder an impish welter of aliases—Eddie & the Eggs, Sticky People, Ladyvipb, Boof—Maurice Fulton has spent the past three-plus decades making the most uncompromisingly funky, unabashedly weird house music ever to make a dancefloor buckle. (See: Exhibit A.) Black Eye broke a six-year hiatus for Syclops, the alias that’s long been home to some of his most muscular productions. Fulton’s grooves are squirrelly as ever, a haywire riot of laser zaps and giggling güiros, ’60s funk and samba schools, bumblebee Moogs and tumbling congas. The energy is uniformly banging, but there’s a wry sense of humor encoded into every errant squelch. Plenty of producers can do one or the other, but no one brings them together more audaciously. –Philip Sherburne\nListen/Buy: Amazon | Apple Music | Bandcamp | Spotify | Tidal\nTotal Blue: Total Blue\nIt’s 1983. You take your martini from the sofa to the window of your oceanside penthouse to gaze upon swaying palms and surf crashing the dark. Or maybe it’s 2024, and you’re looking out the rain-soaked window of a night bus with something on your mind. Either way—retro daydream or real-world introspection—Total Blue’s self-titled debut album suits the mood just right. Mallet rhythms burble and sway. Saxophones, synths, and fretless bass drift in weightless formation. Delicate, immersive, and as smooth as it is bittersweet, this is modern new age at its best, performed by three L.A. musicians who, after a decade of playing together, hit new heights with an engrossing LP. –Will Lynch\nListen/Buy: Amazon | Apple Music | Bandcamp | Spotify | Tidal\nTwo Shell: “Round” [ft. Sugababes]\nTwo Shell pushed it this year—to some extent in their music, but more so with their antics. One moment, they were making AI-generated deepfakes; the next, they were selling “boring rocks” containing hidden USBs with corrupted music files. For many fans outside of their die-hard base, their constant trolling got old, and people were leaving the proverbial chat. Enter: “Round.” With a beat as serious as its makers are not, “Round” finds the duo chopping up British girl group Sugababes’ 2002 hit “Round Round,” reworking it into a UK garage club banger with hyperpop inflections. Unlike its past unofficial versions, the official release scales back the hi-hats, juices up the bass, and features re-recorded vocals from the original Sugababes. The track goes—and so do we, ’round and ’round, on Two Shell’s carousel of hijinks and hits. –Minna Zhou\nListen: Two Shell, “Round” [ft. Sugababes]\nupsammy: Strange Meridians\nWe’re in a golden age of ambient music. The genre has never been more popular, more accessible, or more varied. But with success comes familiarity; it’s harder than ever to make something that sounds genuinely new. On the surface, upsammy’s Strange Meridians, the Dutch musician’s first real foray outside the world of beats, may not appear all that novel: The chimes, the pads, the hints of rushing water and chirping birds—all are perfectly conventional sounds, however exquisitely she’s rendered them. But something in the way she’s put it all together feels unusual. Empty space threatens to overwhelm her lattice of pinpricks and sparkles; her granular timbres often seem on the verge of dissolving into nothingness. It can seem like you’re hearing only a fraction of a completed album, as though she’d muted half the channels before sending the file off for mastering. But that very absence, paired with the squiggly contours of the sounds she does include, turns out to have almost psychedelic properties. Instead of feeling lacking, Strange Meridians overflows with open-ended possibility. –Philip Sherburne\nListen/Buy: Amazon | Apple Music | Bandcamp | Spotify | Tidal\nVerraco: “Godspeed >”\nVerraco’s “Escándaloo” bored a hole through 2023’s club landscape, fueled by a powerhouse bassline that ranked among the year’s most electrifyingly audacious sounds. The Medellín producer extended his iconoclastic run with this year’s aggressively unconventional Breathe... Godspeed EP. In the record’s peak-time centerpiece, “Godspeed >,” a lurching dembow groove pocks the ground while cowbells clatter, spectral voices cackle, and midrange synths are smeared willy-nilly across the stereo field. A bit like Alien’s corrosive xenomorph mouth goo, the noxious bass patch from “Escándaloo” is back and still burning through steel. Yet rather than suggesting that he’s repeating himself, the return of that all-devouring bassline sounds like he’s driving his point home. Every one of his releases is part of a master plan: to develop tools that lay waste to every last hoary shred of club convention. –Philip Sherburne\nListen: Verraco, “Godspeed >”\nYaeji: “booboo”\nMuch is said of dancefloor liberation, but less is said of dancefloor introspection. “Booboo” captures the rare moment when the two coalesce. Where Yaeji’s debut full-length With a Hammer confronted years of suppressed rage, and “easy breezy” was its meditative epilogue, “booboo” feels like the turn-up to a new beginning. After an extended break from clubbing, Yaeji is back outside with her boos, pogo-sticking under strobe lights. On the track, as in the club, past mingles with present, and she duets with her younger self, interpolating snippets from her 2017 breakthrough, “raingurl.” The truth starts in her body before it reaches her head: Against all odds, here she is, happy. –Minna Zhou\nListen: Yaeji, “booboo”\nZULI: Lambda\nIt might be Cairo-born, Berlin-based producer ZULI’s calmest album, but Lambda was born of frustration—frustration from all his unreleased music being stolen, and especially frustration from being pigeonholed and exoticized by a global audience and music press. Where 2021’s blinding All Caps EP sounded like catharsis, Lambda is meditation, at least on the surface. It starts out with roiling breakbeats that eventually dissipate into a choking smog, as vocalists fade in and out of focus—pained laments from Abdullah Miniawy, pointed questions and resignation from MICHAELBRAILEY—until the silt settles and the album fades out with a calmer, reversed version of its opening tempest. ZULI has put out some of the finest high-octane club music from any country in the past decade, but Lambda shows he’s just as captivating when he steps on the brakes, too. –Andrew Ryce\nListen/Buy: Amazon | Apple Music | Bandcamp | Spotify | Tidal\nListen to the Best Electronic Music of 2024 on our Spotify and Apple Music playlists.",
      "author": "Pitchfork",
      "published_date": "2024-12-05",
      "word_count": 5086,
      "fetch_timestamp": "2025-08-20T08:36:25.682025",
      "metadata": {
        "char_count": 32169,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:36:25.682015"
      }
    }
  ],
  "total_articles": 9,
  "total_words": 9908,
  "extracted_at": "2025-08-20T08:36:25.682542",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/kim-gordon-the-collective/",
    "https://pitchfork.com/features/podcast/words-of-wisdom-from-kim-gordon-and-laurie-anderson/",
    "https://pitchfork.com/reviews/tracks/18521-kim-gordon-murdered-out/",
    "https://pitchfork.com/reviews/albums/17096-yokokimthurston/",
    "https://pitchfork.com/reviews/albums/",
    "https://pitchfork.com/reviews/albums/bodydillowayhead-bodydillowayhead/",
    "https://pitchfork.com/features/",
    "https://pitchfork.com/features/lists-and-guides/",
    "https://pitchfork.com/features/lists-and-guides/best-electronic-music-2024/"
  ]
}