{
  "artist_name": "Blink-182",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/blink-182-one-more-time/",
      "source": "pitchfork",
      "artist_name": "Blink-182",
      "title": "Blink-182: One More Time...",
      "content": "---\ntitle: Blink-182: One More Time...\nauthor: Arielle Gordon\nurl: https://pitchfork.com/reviews/albums/blink-182-one-more-time/\nhostname: pitchfork.com\ndescription: Read Arielle Gordon’s review of the album.\nsitename: Pitchfork\ndate: 2023-10-24\n---\nBlink-182 have always been living on borrowed time. “I wish that Earth clock/Could often just be stopped,” Tom DeLonge sang on the 1993 demo Flyswatter. To trace the band’s obsession with aging through their discography—“Lemmings,” “What’s My Age Again?,” “Good Old Days,” “Blame It on My Youth”—is to trace the journey from arrested development to desperate self-delusion. Their Peter Pan syndrome is an act of self-preservation: The absurdity and vanity of youth are the generative forces of pop-punk, a genre built on dick jokes and being mad at your parents. For a band like Blink-182, aging—or acknowledging it—would be tantamount to admitting defeat. And so, night after night, fans participate in a collective fantasy that Mark Hopppus is still 29 years old and thinks it’s funny to sing about elderly incontinence (admittedly, it slaps live). Disbelief became harder to suspend in 2021 when Hoppus was treated for stage 4 lymphoma. With the threat of oblivion breathing down their necks, Hoppus, DeLonge, and drummer Travis Barker—who had not recorded together since 2012’s surprisingly affecting Dogs Eating Dogs EP—returned to the studio to cement their legacy. The resulting album, ONE MORE TIME…, clamors with the frustrated energy of a band too engrossed in its own mythology to innovate on the form it helped create.\nBlink-182’s inward collapse had already begun on 2019’s NINE, their last record with Alkaline Trio guitarist Matt Skiba, where they quoted their own hits on songs like “Blame It on My Youth.” On ONE MORE TIME…, they don’t even try to couch nostalgia with in-jokes. Take album opener “Anthem Part 3,” the capstone to the trilogy of 2001’s “Anthem Part Two” and 1999’s “Anthem.” It starts with a guitar and drum pattern nearly identical to “Part Two,” establishing an uncanny valley of sentimentality that lingers throughout the album. It’s a lazy shorthand for the time lost between releases, a suggestion that if you close your eyes, you too can be transported back to the Mark, Tom, and Travis of 2001. “Work sucks/I know” was transcendent in its minimalism. Here, they feel the need to spell things out explicitly: “When your job has gone to deep shit/If you’ve fallen off of that list/When you’re clenchin’ both of your fists.” Blink-182 have a lot more to say, even if they’re not saying anything.\nSince their last full album as a trio, 2011’s Neighborhoods, the most perceptible shift in the Blink-182 dynamic has been the emergence of Barker as a pop-punk svengali, paving the rap-to-rock pipeline for artists like Lil Huddy and Machine Gun Kelly. His overstuffed, cheap-thrills approach to production—starting with drum fills that occupy every inch of breathable air—has seeped into Blink-182’s empty hooks. “Dance With Me” (after Tom’s intro, which made me miss the days of old Blink) channels Machine Gun Kelly’s unrelenting onslaught of guitars and nasal screeching. Whereas previous albums were primarily written by the band members, ONE MORE TIME… adds a bevy of songwriters, including Kelly collaborator Nick Long and OneRepublic’s Ryan Tedder. It feels disjointed and bloated, not to mention heavily indebted to the band members’ existing discography. “Terrified,” originally written for Barker and DeLonge’s side project Box Car Racer, is almost identical to the sound of that band’s biggest hit, “I Feel So.” “You Don’t Know What You’ve Got” strips the haunting guitar riff from “Adam’s Song” for parts, just different enough that you might miss it at first. When they run out of their own material, they turn to their inspirations: The cloying “Fell in Love” opens with a synth line based on an interpolation of the Cure’s “Close to Me,” which could have felt inspired if it didn’t force such unflattering comparisons to the old Blink song actually featuring Robert Smith, 2003’s sparse and subtle “All of This.”",
      "author": "Arielle Gordon",
      "published_date": "2023-10-24",
      "word_count": 653,
      "fetch_timestamp": "2025-08-20T07:33:15.134571",
      "metadata": {
        "char_count": 4110,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:33:15.134551"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/blink-182-enema-of-the-state/",
      "source": "pitchfork",
      "artist_name": "Blink-182",
      "title": "Blink-182: Enema of the State",
      "content": "---\ntitle: Blink-182: Enema of the State\nauthor: Jeremy Gordon\nurl: https://pitchfork.com/reviews/albums/blink-182-enema-of-the-state/\nhostname: pitchfork.com\ndescription: Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit blink-182’s third album, a defining moment in both pop-punk and immaturity writ large.\nsitename: Pitchfork\ndate: 2020-01-12\ntags: ['sunday review']\n---\nOn the weekend of the infamously disastrous Woodstock ’99, which symbolized rock radio’s id-fueled descent into aggro dipshittery, a snottier kind of teenage angst was manifesting 200 miles to the west in Buffalo, New York. Then in its fifth year, the Vans Warped Tour had crisscrossed the country bringing affordable revelry to the green-haired masses. If Woodstock was for the shirtless jocks, Warped Tour was for the skaters, losers, and wannabes who still sometimes needed a ride from mom. No one was there for the revolution; they were just teenagers drunk on community and tongue-kissing, blissfully alive during the final summer of what had been a relatively idyllic American decade. And that summer, no act on the bill was bigger than blink-182.\nWhile the concept of pop-punk dates back to ’70s bands like the Buzzcocks and the Undertones, pop-punk didn’t become actual popular music until 1994, when Green Day’s Dookie sold more than 12 million copies and set off a never-ending debate about selling out that persists in DIY spaces today. Sure, Green Day sang more about masturbation than anarchy, but that simply did not matter to all the young kids who, apart from lapping up the music, constituted a new customer base for the record industry to serve.\nThese market conditions had lifted blink-182 to festival superstardom just five years into their recording career. In 1992, Mark Hoppus met Tom Delonge through Hoppus’ sister Anne, and they immediately connected through their obsession with punk rock and middle-school humor—two foundational elements for a new pop-punk band. But while they loved conceptual predecessors like the similarly Californian and cheeky Descendents, they were serious about owning a suburban home. “I’d like to make a lot of money and fuck credibility,” Hoppus said in 1998 to i-Zine. “People make so much out of something that’s just the band trying to get ahead and get its music to as many fans as possible.”\nThey weren’t selling out; they were buying in. Part of that was Hoppus and Delonge’s exurban SoCal upbringing, which encouraged a sunny prankishness at odds with the urban despair of the big cities. “The Californian middle-class suburbs have nothing to be that bummed about,” Delonge told music journalist John Robb in 2000. (He might have added “white,” too.) Two decades earlier, the teenaged Ramones were social outcasts in New York, but Delonge was named homecoming king his senior year of high school (he was also expelled for showing up drunk to a basketball game). What they began doing quite well and to excess was simple: record the pouty concerns of middle-class kids in a plainspoken language they could understand, set to addictive melodies and played at moshing speed.",
      "author": "Jeremy Gordon",
      "published_date": "2020-01-12",
      "word_count": 509,
      "fetch_timestamp": "2025-08-20T07:33:15.179426",
      "metadata": {
        "char_count": 3207,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:33:15.179417"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/blink-182-nine/",
      "source": "pitchfork",
      "artist_name": "Blink-182",
      "title": "Blink-182: NINE",
      "content": "---\ntitle: Blink-182: NINE\nauthor: Nadine Smith\nurl: https://pitchfork.com/reviews/albums/blink-182-nine/\nhostname: pitchfork.com\ndescription: The shiny, beat-heavy sound of nu-blink-182 works in starts and stops, but feels half as fun as the band used to be.\nsitename: Pitchfork\ndate: 2019-09-28\n---\nPop-punk’s appeal has always been the fusing of the hook-filled sentiments of pop music with the direct current of punk. They are two prongs that any band, particularly those that find something close to mainstream success, are forced to straddle. This dilemma—how to, in the misquoted words of Donnie and Marie Osmond, be a little bit pop while also being a little bit punk—is one that blink-182 has been struggling with for years now.\nThe apex of their fame revealed serious fissures in the group’s long-term stability, leading singer and guitarist Tom DeLonge to leave the group after their 2003 self-titled album, start the new band Angels & Airwaves, and get really into U.F.O. conspiracies. He’d rejoin for 2011’s Neighborhoods, but since 2015, DeLonge’s place in the band has been taken by Alkaline Trio singer Matt Skiba. Blink picked up their first Grammy nod with 2016’s California, and the band now seems singularly focused on making sure the brand endures into the future, which never really seemed like much of a priority during their most erratic years.\nWith NINE, their eighth album, blink is in search of a more sustainable kind of success. They’re aiming at a more youthful audience, maybe the kinds of kids who inadvertently came to pop-punk by way of Lil Peep, but blink-182 have long held appeal to people who didn’t cut their teeth in the punk scene. Take drummer Travis Barker, who is all over the last decade of hip-hop, from Run the Jewels to Lil Wayne to Young Dro. He tends to work with artists who aren’t exactly in vogue, usually aggressive, Generation-X rappers, like LL Cool J, Cypress Hill, and Xzibit, or the younger and critically unacclaimed, like Machine Gun Kelly and Yelawolf. But Barker has benefited tremendously from hip-hop’s du jour reverence for pop-punk, emo, and alternative rock, repositioning himself into something of a Rick Rubin-esque Svengali of a younger generation of SoundCloud rap. Over the past year, he’s shown up on songs by Lil Nas X, XXXTentacion, and Ghostemane and executive produced EPs by $uicideboy$ and 03 Greedo.\nIt’s Barker’s drum programming that shapes the sound of NINE more than anything else. His beats have always sounded a little bit like Pharrell’s, with that booming bass sound you can hear being so clearly played by a human hand on a drum machine. There are shades of Barker’s hip-hop work all over NINE, particularly on a song like “Hungover You,” which opens with an uptempo, danceable drumline and ends with a pattern of bass tones begging to be blasted out of oversized trunk speakers.",
      "author": "Nadine Smith",
      "published_date": "2019-09-28",
      "word_count": 471,
      "fetch_timestamp": "2025-08-20T07:33:15.215471",
      "metadata": {
        "char_count": 2869,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:33:15.215462"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/22080-california/",
      "source": "pitchfork",
      "artist_name": "Blink-182",
      "title": "Blink-182: California",
      "content": "---\ntitle: Blink-182: California\nauthor: Stacey Anderson\nurl: https://pitchfork.com/reviews/albums/22080-california/\nhostname: pitchfork.com\ndescription: Blink-182's seventh album wants to be a pop-punk eminence album, evidence humbly submitted that this aging pack of skater brats is still young, selectively dumb, and full of commiserating angst.\nsitename: Pitchfork\ndate: 2016-07-06\n---\nMuch like a malcontent teen at a strip mall, killing a weekend's hours while nursing the pulpy dregs of a Jamba Juice, the internet has once again met the challenge of making something from almost nothing. This time, the subject of their dedication is a 16-second track from Blink-182’s seventh album, California called “Built This Pool.” Covers have been uploaded. Annotations have been cribbed. The band themselves knotted it in a narcotizing 10-hour loop that seems to contain all the world’s traumas and solutions. All for a cavernously stupid pop-punk blip in which frontman Mark Hoppus yelps, in entirety, “Woo woo/I wanna see some naked dudes/That’s why I built this pooo-oooo-oool.”\nThese endeavors as valuable as any, to be clear; the song remains hilarious, for the virtual minutes of my life I’ve dedicated to replaying it. It’s a nice jolt back to the group’s gleeful heyday, when flapping their rude bits up and down So Cal was high art to a nation of TRL viewers, and their infectious three-chord screeds belied real, sly wisdom. (It’s also a fairly unprecedented bout of brevity; the spiritual antecedent is the Take Off Your Pants and Jacket cut “Happy Holidays You Bastard,” which clocks a robust 42 seconds.) If the entire album was stuffed similarly, with sneeze-length quips and short stabs of power chords, California would seem no less anomalous for what it’s trying to be: the pop-punk eminence album, evidence humbly submitted that an aging pack of skater brats hasn’t jumped off the hedonic treadmill just yet and is still young, selectively dumb, and full of commiserating angst.\nThe album is a much slicker petition, though. It opens with a bald-faced admission of nerves, a level stare that doubles as a keen bit of reverse psychology. “There’s a cynical feeling saying I should give up/You said everything you’ll ever say,” Hoppus sighs on “Cynical,” the reedy edge of his voice unchanged. “There’s a moment of panic when I hear the phone ring/Anxiety’s calling in my head.” The glum pall quickly dissipates into the sort of doubletime thrash that powers most garage punk, but it never entirely leaves the record; the earnest California takes plenty of time to sprawl out, from wound-licking power ballads (“Home Is Such a Lonely Place,” “Hey I’m Sorry”) to high-shine navel-gazings that hew closely to past hits. The solemn “Bored to Death” rides a rubbery guitar intro just one note inverted from “Adam’s Song,” a hit from their 1999 breakout Enema of the State, and boasts a chorus deep in conviction only (“Life is too short to last long”).",
      "author": "Stacey Anderson",
      "published_date": "2016-07-06",
      "word_count": 477,
      "fetch_timestamp": "2025-08-20T07:33:15.251719",
      "metadata": {
        "char_count": 2963,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:33:15.251710"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "Blink-182",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-20\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nRap\nStar Line\nChance the Rapper\nBy\nAlphonse Pierre\nAugust 20, 2025\nRock\nLove Is Like\nMaroon 5\nBy\nLinnie Greene\nAugust 20, 2025\nExperimental\nKhadim\nMark Ernestus’ Ndagga Rhythm Force\nBy\nRae-Aila Crumble\nAugust 20, 2025\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-20",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-20T07:33:15.759381",
      "metadata": {
        "char_count": 7698,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:33:15.759368"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/",
      "source": "pitchfork",
      "artist_name": "Blink-182",
      "title": "The Pitchfork Review: All of the Latest Episodes",
      "content": "---\ntitle: The Pitchfork Review: All of the Latest Episodes\nauthor: Condé Nast\nurl: https://pitchfork.com/podcast/the-pitchfork-review/\nhostname: pitchfork.com\ndescription: Listen to every episode of Pitchfork’s podcast for music fans and obsessives.\nsitename: Pitchfork\ndate: 2024-01-11\ntags: ['web']\n---\nBrought to you by the music critics at Pitchfork, The Pitchfork Review is a show for music fans and obsessives who can’t wait to talk about the latest releases. Co-hosted by Pitchfork editor-in-chief Puja Patel and Reviews Editor Jeremy D. Larson, this podcast pulls back the curtain on our reviews and scores, dives deep into new music, and gives an expert guide to what’s exciting, what’s great, and what’s just plain terrible.\nListen to every episode of Pitchfork’s podcast for music fans and obsessives.\nRelated Articles\nThe Origins and Influence of Brian Eno’s Pioneering Album Ambient 1: Music for Airports\nIn the latest episode of Pitchfork’s podcast, our critics revisit the legendary producer’s classic 1978 LP, which was recently featured in our Sunday Review series.\nBy Pitchfork\nJeff Tweedy on Rock Criticism, the Pitfalls of Music Snobbery, and His New Book\nThe musician and author discusses World Within a Song, in which he writes about 50 songs that rearranged his brain, Wilco’s new album, and more.\nBy Pitchfork\nThe 2023 Music Grab Bag: Trends, Scandals, and Theories\nIn this episode of the Pitchfork Review podcast, our critics talk about the rise of the musical theater girlie, the fall of the 1975’s Matty Healy, and more. Plus: Alvvays’ Molly Rankin reveals the song she wishes she wrote.\nBy Pitchfork\nThe Best, Worst, and Most Surprising Albums of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about some of their faves from our 50 Best Albums of 2023 list and lament a few of the year’s biggest disappointments.\nBy Pitchfork\nWhy the Replacements’ Tim Is the Best Reissue of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about the revelatory new version of the beloved rock band’s 1985 LP. Plus, Replacements bassist Tommy Stinson reveals his perfect-10 album.\nBy Pitchfork\nBreaking Down Bad Bunny’s New Album and the Future of Puerto Rican Rap and Reggaeton\nIn this episode of The Pitchfork Review podcast, our critics dissect Bad Bunny’s latest and highlight a few new queer artists from Puerto Rico who are taking the island’s music to exciting new places.\nBy Pitchfork\nDebating the Best Songs of 2023, Part Two\nIn this episode of the Pitchfork Review podcast, our critics battle it out over some of their favorite songs of the year, by artists including Troye Sivan, Kendrick Lamar, Big Thief and more. Plus: Devendra Banhart tells us all about his dream collaboration.\nBy Pitchfork\nDebating the Best Songs of 2023, Part One\nIn this episode of the Pitchfork Review podcast, our critics take sides and discuss which tracks by some of 2023’s most exciting artists deserve a spot on our upcoming year-end lists.\nBy Pitchfork\nThe Good, the Bad, and the Swiftie of Taylor’s Eras Tour Concert Film\nIn this episode of The Pitchfork Review podcast, our critics wade through the ups and downs of the pop superstar’s new record-breaking live movie.\nBy Pitchfork\nWhat Drake Is Doing Wrong—and How He Can Fix It\nIn this episode of the Pitchfork Review podcast, our critics talk about what made them care about Drake in the first place, why his new album For All the Dogs is so frustratingly mid, and what he should do next.\nBy Pitchfork",
      "author": "Condé Nast",
      "published_date": "2024-01-11",
      "word_count": 579,
      "fetch_timestamp": "2025-08-20T07:33:15.813924",
      "metadata": {
        "char_count": 3506,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:33:15.813914"
      }
    },
    {
      "url": "https://pitchfork.com/features/festival-report/the-best-of-coachella-2023-day-1-bad-bunny-gorillaz-blink-182-and-more/",
      "source": "pitchfork",
      "artist_name": "Blink-182",
      "title": "The Best of Coachella 2023 Day 1: Bad Bunny, Gorillaz, Blink-182, and More",
      "content": "---\ntitle: The Best of Coachella 2023 Day 1: Bad Bunny, Gorillaz, Blink-182, and More\nauthor: Anna Gaca; Jill Mapes; Paul A Thompson\nurl: https://pitchfork.com/features/festival-report/the-best-of-coachella-2023-day-1-bad-bunny-gorillaz-blink-182-and-more/\nhostname: pitchfork.com\ndescription: Muna (with Boygenius), Metro Boomin (with the Weeknd, Future, and more), Kaytranada, and lots more kicked off this year’s festival in the desert\nsitename: Pitchfork\ndate: 2023-04-15\ncategories: ['features']\ntags: ['coachella2023']\n---\nThe 2023 Coachella Valley Music and Arts Festival began its first weekend yesterday at the Empire Polo Field in Indio, California. Headliner Bad Bunny delivered a history-making set, Gorillaz and Metro Boomin brought out tons of guests, Blink-182 kicked off their reunion tour, and so, so much more. Here are the highlights and noteworthy sets caught by Pitchfork’s staffers. We’ll be on the ground for all three days of the festival, filling you in on everything you need to know.\nFor much, much more Pitchfork Coachella coverage, follow along here.\nBad Bunny Plays Teacher\nFor a brief moment during his headlining set Friday night, Bad Bunny teased a pivot to English, asking the crowd—in that language—whether they would prefer he switch to it or stick with Spanish. Fans roared for the latter. Much has been made about his being the first Coachella headlining performance to be delivered primarily in Spanish. In the past in the English-speaking world, that might have been characterized as evidence of an artist “crossing over,” but here, it simply meant that Coachella is rushing to keep up. Bad Bunny is by many measures the most popular artist on the planet—as evidenced by the mass of people who seemed impervious to the unusually late start time for a Friday headliner and to the almost unbelievable desert cold.\nAll of which could tempt those with their eyes on ticket sales or streaming numbers to describe Bad Bunny as an isolated phenomenon, an aberration. Instead, the superstar went to lengths to dispel that notion by placing his work in a long lineage of musical genres and iconic artists from across Latin America, interrupting his tremendously captivating set with two short videos detailing the stylistic splintering and reconnection of various Spanish-language genres and their political utility. This was complemented by what was essentially a surprise dance revue, and by a setlist that—while uniformly contemporary—seemed to taunt those hoping to settle into a cozy rhythm by taking hairpin turns of mood, tempo, and instrumentation. Bad Bunny was so poised and so magnetic that his two-hour bacchanal couldn’t even be tamped down by protracted technical difficulties during an attempted Post Malone duet. –Paul A. Thompson\nBlink-182: What’s Their Age Again?\nA surprise last-minute addition to the Coachella lineup, Blink-182 delivered their first performance since reuniting with guitarist/singer Tom DeLonge. A lot has changed over the last two decades since blink’s heyday—bassist/singer Mark Hoppus battling cancer, drummer Travis Barker marrying into one of the most famous families on the planet, DeLonge peddling alien conspiracy theories—but one thing is certainly intact: their, erm, sense of humor. Hoppus played a dual role of disappointed dad and impish pervert, joking about (deep breath): the number of UTIs and pregnancies about to happen; “fingers in your butt” (that’s it, that’s the whole comment); eating it from the back; balls (what are they good for?); the wetness of DeLonge’s mom’s pussy (life-giving hydration, apparently), and a whole lot more. Look, together these three sound as sharp and riffy as ever—or as DeLonge kept saying, “You can’t do what we do, fuckers”—but I wish they’d stop with the aggressively middle-school stage banter and, well, leave that to the songs. The final three tracks— “I Miss You,” “All the Small Things,” “Dammit”—at least cleansed the stage. —Jill Mapes\nGorillaz’ Family Affair\nDuring their second-to-headline set, Damon Albarn and his enormous band of collaborators both human and cartoon moved smoothly from style to style and guest to guest, adapting easily to Thundercat’s bass or Del the Funky Homosapien’s sly authority. But the most arresting collaboration came toward the end of the set, when he welcomed the surviving members of De La Soul to the main stage for “Feel Good Inc.,” the massive hit from 2005 that credits the Long Island trio but essentially features Trugoy the Dove, who passed away earlier this year. Just weeks before his death, it was announced that De La’s catalog, long absent from digital streaming platforms due to legal battles over the rights to its innumerable samples, would finally be available online. Who better than Gorillaz to underline the permeable borders between here and gone, innate and constructed, comfort and provocation? –Paul A. Thompson\nMuna Debut New Song, Bring Out Boygenius\nMuna’s early evening set was energetic like a dance party, cathartic like a country gig, and all-around exceedingly gay. Performing before a crowd heavily sprinkled with boys in chaps and glitter, frontwoman Katie Gavin and guitarist Josette Maskin relished playing their respective roles: the campy dom femme and the rock-star strutter. Gavin, looking like a long-lost Judd sister with her own line of latex gloves, pranced and twirled and line-danced to much delight; Maskin penguin-walked across the stage wearing red snakeskin flares and a shirt that said “HARD” on the front in diamonds and “ROCK” on the back. In addition to highlights off last year’s self-titled LP, like “Home by Now,” the trio played a new song, “One That Got Away,” which is “about someone fumbling the bag.” The vibe was early Gaga meets peak Paula Abdul. Introducing “I Know a Place,” Gavin gave a heartfelt speech about how it was one of the first songs they ever wrote, “just three queers in a college dorm room,” then dedicated it to their queer and trans fans. The set ended with a rousing cameo by Phoebe Bridgers, Julien Baker, and Lucy Dacus of Boygenius, essentially Muna’s rock counterpoint, for the Bridgers collab “Silk Chiffon.” “I hope everyone’s doing safe drugs,” Gavin told the crowd, “and having safe sex.” —Jill Mapes\nMetro Boomin’s Justice League\nEven the rumors didn’t prepare us for the stacked guest lineup at Metro Boomin’s Sahara stage headlining set: Future, 21 Savage, the Weeknd, Don Toliver, John Legend, and Diddy, plus Mike Dean on keys and sax. Metro scored with a creative comic book-style intro video, but lost focus in an overall production design that, like so many of those blockbuster superhero movies, felt so intensely stylized that it was sometimes hard to follow. (I somehow missed John Legend’s appearance completely.) But the highlights were undeniable: Future doing “Mask Off” (despite the weird shout out to Covid-19) and the Weeknd’s six-song finale, including a heartfelt rendition of Mario Winans’ “I Don’t Wanna Know” (aka the current hit “Creepin’”). –Anna Gaca\nKaytranada’s Got It\nKaytranada’s sunset set at the Outdoor Theatre made a strong case for the Canadian DJ/producer as one of the current moment’s most central creators of celebrated auteur pop. It featured work with Kelela, remixes of the Weeknd, Janet Jackson, and Sade, and walk-on appearances by Kali Uchis and Aminé. He even included the cheeky little Beyoncé flip he’s been spotted with recently– if that track’s not official, it should be. Kaytranada’s booth was way up high, with an open desk so you could see his feet moving even from way back, showing the crowd that he can really dance. The sole set piece: a faux marble head with laser eyes, like a brand new type of classic sculpture. –Anna Gaca\nPusha T Narrows the Lens\nPusha T has made a career as a specialist, finding variation after minor variation on the same style, verse after verse, year over year. That makes him the ideal foil for A-list producers’ most experimental beats. To this end, his last two solo efforts, last year’s It’s Almost Dry and 2018’s Daytona, have stripped away everything extraneous and deepened the grooves of Pusha’s already well-worn drug kingpin persona. However, this occasionally walks right up to the brink of caricature. See the graphics on screen before Pusha took the main stage Friday afternoon that welcomed his fans to “Cokechella,” or recall the line from “Let the Smokers Shine the Coupes,” which opened his hyperkinetic set, where he calls himself “cocaine’s Dr. Seuss.” But as on the tour supporting Dry, Pusha’s set confirmed how engaging he can be, whether threatening through gritted teeth on the muted “Just So You Remember” or exulting over “If You Know You Know” and its cacophony. –Paul A. Thompson\nMagdalena Bay Level Up\nThe last time I saw Magdalena Bay play, about 18 months ago, they didn’t have a live drummer and their stage presence felt a little hesitant. But Mica Tenenbaum and Matthew Lewin have been touring a lot, picking up panache and touring drummer Nick Villa. They’ve leveled up to become a perfect Coachella band: playful, candy-sweet, and fond of kitschy matching costumes. They commemorated this year’s festival appearance with a tape released Thursday, mini mix vol. 3, and debuted a few of its songs live on Friday night. No spoilers, but Tenenbaum has a keytar solo on “Secrets (Your Fire)” now. –Anna Gaca",
      "author": "Anna Gaca; Jill Mapes; Paul A Thompson",
      "published_date": "2023-04-15",
      "word_count": 1504,
      "fetch_timestamp": "2025-08-20T07:33:15.840662",
      "metadata": {
        "char_count": 9380,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:33:15.840655"
      }
    },
    {
      "url": "https://pitchfork.com/features/",
      "source": "pitchfork",
      "artist_name": "Blink-182",
      "title": "Music Articles & Features",
      "content": "---\ntitle: Music Articles & Features\nauthor: Condé Nast\nurl: https://pitchfork.com/features/\nhostname: pitchfork.com\ndescription: Longform and in-depth analysis about the most exciting and important music being released today\nsitename: Pitchfork\ndate: 2025-08-14\ntags: ['web']\n---\nDekmantel Is a Dance Festival Shedding Light on the Underground\nWe touched down in Amsterdam for the 2025 edition of the left-of-center electronic festival and came back with some thoughts about live sets, drum heads, speaker cabinets, bass fiends, techno lords, and the simple power of naming some club-ready bangers.\nBy Jeremy D. Larson\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nNight Out 2025: Pitchfork and Them’s Showcase for the Future of Queer Music\nBy Olivier LafontantPhotography by Dillon Edlin\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nWhat Happened at Pitchfork’s Bladee Zine Launch\nBy PitchforkPhotography by Caroline Friedman\nA Rare Interview With Bladee, the Mystic Oracle of Internet Rap\nBy Meaghan GarveyPhotography by Jason Nocito\nHighlights From Pitchfork’s 2024 Year in Music Club Night\nBy PitchforkPhotography by Sam Wachs\nHighlights From Pitchfork and Thought Enthusiast’s Year in Music Panel\nBy PitchforkPhotography by Sam Wachs\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 18 Best Moments From Pitchfork Music Festival 2024\nBy Boutayna Chokrane, Nina Corcoran, and Heven Haile\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nHow Waxahatchee Made the Album of Her (Second) Life\nBy Andy CushPhotography by Bobby Doherty\nChasing the Goblin With Mabe Fratti, the Guatemalan Cellist at the Heart of Mexico City’s Avant-Rock Scene\nBy Philip SherburnePhotography by Filip Preis",
      "author": "Condé Nast",
      "published_date": "2025-08-14",
      "word_count": 347,
      "fetch_timestamp": "2025-08-20T07:33:16.236565",
      "metadata": {
        "char_count": 2280,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:33:16.236551"
      }
    },
    {
      "url": "https://pitchfork.com/features/lists-and-guides/",
      "source": "pitchfork",
      "artist_name": "Blink-182",
      "title": "Lists & Guides",
      "content": "---\ntitle: Lists & Guides\nauthor: Condé Nast\nurl: https://pitchfork.com/features/lists-and-guides/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2025-08-06\ntags: ['web']\n---\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nThe 62 Best Albums of 2023 So Far\nBy Dylan Green, Anna Gaca, Jeremy D. Larson, Sam Sodomsky, and Cat Zhang\nThe 48 Most Anticipated Albums of Fall 2023\nBy Madison Bloom, Nina Corcoran, Allison Hussey, Hattie Lindert, Evan Minsker, Jazz Monroe, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres\n17 Artists on Their All-Time Favorite Rap Songs\nBy Andy Cush, Jayson Greene, Clover Hope, and Alphonse Pierre\nThese Queens Can Sing: The 15 Best Songs by Today’s Drag Performers\nBy Julianne Escobedo Shepherd\nThe 30 Best Queer Music Movies\nBy Eric Torres, Nadine Smith, Tatiana Lee Rodriguez, Michelle Hyun Kim, and Emma Madden\nThe 46 Most Anticipated Albums of Summer 2023\nBy Alphonse Pierre, Madison Bloom, Evan Minsker, Eric Torres, Allison Hussey, Nina Corcoran, Jazz Monroe, Marc Hogan, and Matthew Ismael Ruiz\nThe 30 Best Music Festivals of 2023\nBy Evan Minsker, Jazz Monroe, Allison Hussey, Madison Bloom, Nina Corcoran, Eric Torres, and Matthew Strauss\nThe 43 Most Anticipated Albums of Spring 2023\nBy Jazz Monroe, Evan Minsker, Allison Hussey, Eric Torres, Nina Corcoran, Madison Bloom, and Matthew Strauss\nThe 34 Most Anticipated Albums of 2023\nBy Jazz Monroe, Rob Arcand, Marc Hogan, Eric Torres, Allison Hussey, Nina Corcoran, and Matthew Strauss\nThe 34 Most Anticipated Albums of Fall 2022\nBy Rob Arcand, Madison Bloom, Jane Bua, Nina Corcoran, Heven Haile, Allison Hussey, Evan Minsker, Jazz Monroe, Quinn Moreland, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres\nThe 37 Most Anticipated Albums of Summer 2022\nBy Madison Bloom, Nina Corcoran, Allison Hussey, Evan Minsker, Quinn Moreland, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres",
      "author": "Condé Nast",
      "published_date": "2025-08-06",
      "word_count": 410,
      "fetch_timestamp": "2025-08-20T07:33:16.529560",
      "metadata": {
        "char_count": 2614,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:33:16.529546"
      }
    }
  ],
  "total_articles": 9,
  "total_words": 6269,
  "extracted_at": "2025-08-20T07:33:16.530051",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/blink-182-one-more-time/",
    "https://pitchfork.com/reviews/albums/blink-182-enema-of-the-state/",
    "https://pitchfork.com/reviews/albums/blink-182-nine/",
    "https://pitchfork.com/reviews/albums/22080-california/",
    "https://pitchfork.com/reviews/albums/",
    "https://pitchfork.com/features/podcast/",
    "https://pitchfork.com/features/festival-report/the-best-of-coachella-2023-day-1-bad-bunny-gorillaz-blink-182-and-more/",
    "https://pitchfork.com/features/",
    "https://pitchfork.com/features/lists-and-guides/"
  ]
}