{
  "artist_name": "Eminem",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/eminem-the-death-of-slim-shady-coup-de-grace/",
      "source": "pitchfork",
      "artist_name": "Eminem",
      "title": "Eminem: The Death of Slim Shady (Coup de Grâce)",
      "content": "---\ntitle: Eminem: The Death of Slim Shady (Coup de Grâce)\nauthor: Dash Lewis\nurl: https://pitchfork.com/reviews/albums/eminem-the-death-of-slim-shady-coup-de-grace/\nhostname: pitchfork.com\ndescription: Read Dash Lewis’ review of the album.\nsitename: Pitchfork\ndate: 2024-07-16\n---\nEminem used to be reckless and thrilling. In the early days, he was a cruise missile slicing through the sky with the names of his targets spray-painted on the side. He aired grievances with a bullhorn, scaffolding crude insults with dynamic turns of phrase and flashy internal rhymes. Eminem could be arrestingly clever, sometimes issuing a line as meticulously written as it was shocking, but you’d never accuse him of being subtle.\nThat was 22 years ago. A generation removed from The Eminem Show, his last great album, Eminem is a shadow of his former self. His lithe and menacing flow now feels antiseptic and strained. The high-pitched, manic tenor of his voice gave way to an ever-ratcheting growl; any East Coast groove or nervy West Coast slink in his beats was replaced by chintzy Casiotone melodrama. He became blocky and unwieldy, careening through tracks with the grace of a Cybertruck crashing into a ditch.\nHis anger and defensiveness never dissipated, though. By the time he dropped his second album, The Marshall Mathers LP, his early screeds yearning for a colorblind hip-hop meritocracy had already lost their impact—by that point, Eminem was an unavoidable cultural force. Those diatribes sound even whinier now. He remains one of the biggest-selling and most-streamed artists in the United States, but Em’s perpetually on a back foot, like a wealthy barbarian at the gates working as hard as he can to convince his critics he’s worthy of praise. His music still clearly strikes a chord for a sizable audience, but he seems to look past them, more concerned with convincing someone—anyone—that he’s the deadliest to touch a mic.\nSeldom does a blockbuster album sequel recapture that initial magic; The Marshall Mathers LP 2 often felt like trying to draw the original from memory with expensive crayons. Em honed his technical skills so sharply—the lightning-speed flow on “Rap God,” the precision syllable-matching on “Legacy”—that it rendered everything sterile. Notably, he tried to distance himself from his Slim Shady character, using several songs (including the smash hit “The Monster” with Rihanna) to destroy—or at least explain away—his trollish persona. Ten years and three middling records later, he’s back to kill off his alter ego for good. The Death of Slim Shady (Coup de Grâce) is his attempt at Jungian shadow work, opening the closet for a knock-down drag-out screaming match with the skeletons.\nIt begins with the sound of a hocked loogie. It could be Marshall Mathers trying to rid himself of the taste Slim Shady’s words leave in his mouth. Or it could just be a warning shot: This is gonna be gross. “Renaissance” functions mainly as a list of Eminem’s bona fides, comparing himself to rap legends like Big Daddy Kane and spitting lightly chuckle-worthy double entendres like, “Soon as I quit giving a fuck I started to sell a bit.” Near the end it devolves from a brash pen exercise to an attempt to shield himself from the criticism he can already feel coming. You get the distinct feeling we’ve been here before: “Premonition,” which opened Music to Be Murdered By, covered the same ground. It’s a grim harbinger that we will be exploring no new territory for the next hour.",
      "author": "Dash Lewis",
      "published_date": "2024-07-16",
      "word_count": 568,
      "fetch_timestamp": "2025-08-20T08:27:39.210921",
      "metadata": {
        "char_count": 3502,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:27:39.210910"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/eminem-music-to-be-murdered-by/",
      "source": "pitchfork",
      "artist_name": "Eminem",
      "title": "Eminem: Music to Be Murdered By",
      "content": "---\ntitle: Eminem: Music to Be Murdered By\nauthor: Paul A Thompson\nurl: https://pitchfork.com/reviews/albums/eminem-music-to-be-murdered-by/\nhostname: pitchfork.com\ndescription: It is not, strictly speaking, a good record—Eminem hasn’t made one of those in a decade—but his latest boasts enough technical command and generates just enough arresting ideas to hold your attention.\nsitename: Pitchfork\ndate: 2020-01-25\n---\nThe thing you have to remember is that Eminem was on Rawkus’ second Soundbombing compilation. Before he ever shook hands with Dr. Dre and Jimmy Iovine, Marshall Mathers battled Project Blowed members and Chicago’s future candidates for alderman. This, after all, was a nasally white rapper from Detroit with a rhyming dictionary and a taste for horrorcore. His first EP from 1997 was sort of staggering, but didn’t exactly scream “TRL.”\nIf you ran the simulation a thousand times, it would never spit out the actual results: the tens of millions of records sold, the merchandising and the Academy Award and the million little cottage industries. But that’s what happened, and so by 2000, the nasally white rapper from Detroit with a rhyming dictionary had a diamond-selling album that pissed off Bill Clinton and his former group The Outsidaz in equal measure.\nIt’s tempting to dismiss the endurance of Eminem’s career as the half-life of celebrity, and the man himself as a relic from the Clinton- and Bush-era boom years. But Music to Be Murdered By, released without warning last week, is defined by a certain kind of defiance, and even a peculiar integrity. It’s a messy, sometimes lucid example of a hyper-technical style of rap that fell out of favor and is now creeping back into vogue. It is not, strictly speaking, a good record—Eminem hasn’t made one of those in a decade—but it boasts enough technical command and generates just enough arresting ideas to hold your attention.\nIt opens with a long notebook dump called “Premonition,” in which Eminem vents his frustration with critics—he correctly notes that he’s been mocked for sounding too tame and too angry on consecutive records—and fans who want him to chase trends driven by rappers half his age. His concessions to this real or imagined pressure have, in the past, been disastrous: 2018’s Kamikaze wastes a Tay Keith beat on a middling “Bad and Boujee” riff, and his adoption of the Migos’ triplet flow on 2017’s Revival (“I conned her into/Ripping the condom in two) was ineffective, to say the least. That’s why it’s so striking when the same fixation yields radically more interesting results here. “Premonition” is followed by “Unaccommodating,” a duet with the inhumanly charismatic 27-year-old Young M.A; “Godzilla” pairs Eminem with Juice WRLD, who tragically died at 21 last month. On both songs, the younger performer sounds freer and looser than the headliner, but each ranks among the most effective cuts.",
      "author": "Paul A Thompson",
      "published_date": "2020-01-25",
      "word_count": 465,
      "fetch_timestamp": "2025-08-20T08:27:39.254495",
      "metadata": {
        "char_count": 2905,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:27:39.254490"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/eminem-kamikaze/",
      "source": "pitchfork",
      "artist_name": "Eminem",
      "title": "Eminem: Kamikaze",
      "content": "---\ntitle: Eminem: Kamikaze\nauthor: Marc Hogan\nurl: https://pitchfork.com/reviews/albums/eminem-kamikaze/\nhostname: pitchfork.com\ndescription: All across his 10th album, the more things change, the more Eminem stays the same.\nsitename: Pitchfork\ndate: 2018-09-06\n---\nReleased without prior announcement, only a tweet from the rapper saying that he “tried not 2 overthink this 1,” Kamikaze stands in one sense as a no-bullshit return to basics after the pop-minded bloat of last year’s lackluster Revival. It’s also the endlessly self-mythologizing star’s latest excoriation of journalists, perceived rivals, and just about anyone else who thinks his music sucks now. His career has become an exhausting feedback loop, and Kamikaze flies straight into that downward spiral.\nEver since his bedrock trilogy of albums—1999’s The Slim Shady LP, 2000’s The Marshall Mathers LP and 2002’s The Eminem Show—vaulted the battle-tested Detroit MC to a Grammy-winning commercial juggernaut, Eminem has alternated between gritty boom-bap reboots and slick crossover plays as his cultural impact has waned. Like 2009’s grisly Relapse after 2004’s solipsistic Encore, or 2013’s violently recidivistic The Marshall Mathers LP 2 after 2010’s clumsily motivational Recovery, Kamikaze is Eminem’s latest act of stubbornness in the face of change. Though Kamikaze might part ways with the polish and Beyoncé-grade guests of Revival, it’s yet another empty, intermittently tone-deaf onslaught of technical rap prowess and humorless juvenilia from an artist who once controlled the zeitgeist with ease.\nIf rap more closely resembled a purely athletic contest, Eminem would still be an Olympian. As a deployer of internal rhyme schemes and sly vocal deliveries, he continues to operate on a rarefied plane, whether spitting in frenetic double-time or sending up today’s sing-songy approaches. “Get this fuckin’ audio out my Audi yo, adios,” he declares on opener “The Ringer,” stringing together something textually clever but utterly meaningless. And when Eminem repeatedly insists he writes his own lyrics, well, what an accomplishment. If what happened with Jay-Z’s likewise-crotchety “D.O.A. (Death of Auto-Tune)” back in 2009 is any guide, Eminem’s hyper-articulate attacks on mumble-rap might mark not the death of a trendy style as much as its inescapable takeover. When Eminem compares himself to Muhammad Ali, on a joylessly bludgeoning track titled, yes, “Greatest,” the breathless wordplay sounds like it would be a lot of work to duplicate, but he seems to miss out on what’s remarkable about both Ali and, at its best, music. Eminem doesn’t do transcendence.\nWhile Eminem’s verbal dexterity has remained intact, his shortcomings have grown more glaring with the passage of time. When he isn’t unleashing his id, he has, at times, veered toward power-ballad treacle, and “Stepping Stone,” a maudlin tribute to his former group D12, is the prime offender here. When the demons do emerge, the songs aren’t memorable enough to overcome the latest tinges of homophobia and misogyny from a 45-year-old who either knows better or is outrage-trolling for the attention he doesn’t need. Instead of trying to evolve with the culture, he’d rather Make Rap Great Again. On the execrable “Fall,” which has already been disowned by guest vocalist Justin Vernon, Eminem carelessly lobs an anti-gay slur at Tyler, the Creator. Multiple references to domestic violence, on two separate tracks, fail to earn their jokey presence. And while Eminem has long delighted in being impish, the many times Kamikaze presents the idea of someone having a dick in their mouth as the ultimate insult is not only socially dubious but artistically bankrupt and above all: boring. No-holds-barred wordplay is part of hip-hop’s DNA, but this isn’t a reissue from another era or grassroots subcultural expression; it’s a rich and famous and not coincidentally white, straight man in 2018, asserting that he’s about to “rape the alphabet.”",
      "author": "Marc Hogan",
      "published_date": "2018-09-06",
      "word_count": 612,
      "fetch_timestamp": "2025-08-20T08:27:39.295079",
      "metadata": {
        "char_count": 3992,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:27:39.295073"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/eminem-revival/",
      "source": "pitchfork",
      "artist_name": "Eminem",
      "title": "Eminem: Revival",
      "content": "---\ntitle: Eminem: Revival\nauthor: Matthew Ismael Ruiz\nurl: https://pitchfork.com/reviews/albums/eminem-revival/\nhostname: pitchfork.com\ndescription: On his overtly political ninth studio LP, Eminem is fueled by self-doubt. But with many bland hooks and cringe-worthy punchlines, Revival is another late-career album that does little for his legacy.\nsitename: Pitchfork\ndate: 2017-12-19\n---\nFew texts in hip-hop are as bizarre as Eminem’s debut LP, Infinite. Released on a local Detroit label in 1996, it was either ignored or dismissed by those who rejected his whiteness and his borrowed aesthetic. Were it released in 2017, it might be celebrated for its scholarship of the form’s early classics, a la Joey Bada$$ or Roc Marciano. Instead, he was written off as a swagger jacker who sounded too much like Nas and AZ.\nThe criticism burned, and from that fire he formed his alter ego, Slim Shady. A manifestation of Marshall Mathers’ inner turmoil, the persona served as a vehicle for his darkest, most violent thoughts and helped him step out from the shadow of his forebears to channel the darkest parts of himself. On 1998’s The Slim Shady EP, he found his unique and disturbing voice. It caught the ear of Jimmy Iovine and Dr. Dre, who spent the next five years molding him into one of the biggest pop stars in the world.\nIn those early years, for all the controversy his lyrics caused, Slim Shady helped Mathers focus his energy, a cathartic outlet that was both messy and intensely fascinating. But after more than two decades, he’s older, well-fed, and in possession of pretty much every accolade there is to acquire. The Slim Shady suit no longer fits; once the outsider, he’s now the establishment. If Slim Shady fed on hate, what does he do now that he’s beloved? What motivates a healthy, sober, 45-year-old father with enough money for several lifetimes?\nOn Revival, his ninth studio LP, Eminem is largely fueled by his own self-doubt, a creeping fear that we might forget he was once one of the best to ever hold a mic. The only thing the battle-tested, Oscar-winning, best-selling hip-hop artist of all time has to prove is that he’s got another classic in him, the one thing that he hasn’t proven since the curtains closed on 2002’s The Eminem Show. On the records that followed—his 2004 Encore, the inevitable Relapse in 2009 into Slim Shady, and his eventual Recovery—Eminem struggled to reconcile with the aftermath of his rapid ascent to stardom. The confessional nature of his storytelling, often featuring his mother, his daughter, and her mother, laid bare his deepest insecurities and most twisted fantasies. By the time a sober Marshall Mathers dropped the sequel to his defining work, he seemed desperate to prove he still had the ability to shock, disturb, and amaze with his skills on the mic. But by then, it was already apparent that he’d run out of stories to tell. Having freed himself of substance abuse, he reconciled his toxic relationship with the mother of his child and the effects of incorporating his daughter into his art. He’d matured into a more evolved human. But the music didn’t grow with him.",
      "author": "Matthew Ismael Ruiz",
      "published_date": "2017-12-19",
      "word_count": 526,
      "fetch_timestamp": "2025-08-20T08:27:39.337077",
      "metadata": {
        "char_count": 3139,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:27:39.337072"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/eminem-untouchable/",
      "source": "pitchfork",
      "artist_name": "Eminem",
      "title": "Eminem: “Untouchable”",
      "content": "---\ntitle: Eminem: “Untouchable”\nauthor: Marc Hogan\nurl: https://pitchfork.com/reviews/tracks/eminem-untouchable/\nhostname: pitchfork.com\ndescription: His rap-rock treatise on white privilege\nsitename: Pitchfork\ndate: 2017-12-08\n---\nFor those still scratching their heads over Eminem’s epic Trump diss at the 2017 BET Awards, no, his wokeness wasn’t a one-off. He followed that virtual-watercooler moment with “Walk on Water,” a wan power ballad that fails superstar guest Beyoncé. Now, for his second track from next week’s album Revival, he reloads on leftish punditry with a song that could Make Keith Olbermann Love Rap Again.\nThe message—Em says it best here when he raps, a cappella, “Throughout history, African-Americans have been treated like shit”—is undeniable and profoundly important. But the medium for that message is hugely flawed. There’s a level of Mackling to a white celebrity rapper following the above line with, “And I admit there have been times where it’s been embarrassing to be a white boy,” as if Marshall Mathers’ mortification is of any import here. But Olbermann will no doubt be applauding again. There’s a visceral thrill to the declaration, “Fuck your Republican views/Pull ourselves up the bootstraps/Where the fuck are the boots?” But trying to engage with Slim Shady has long meant ignoring what he was saying to try to focus on how cleverly he said it—this, with its trudging guitars and didactic tone, is the opposite. It’s great that whoever wants to listen to this will be exposed to some ideas that somehow escape much of white America. If Eminem wants to embrace some other righteous causes—support any other historically marginalized groups—that’d be worth celebrating, too. But here the ultimate formalist is on point and off form.",
      "author": "Marc Hogan",
      "published_date": "2017-12-08",
      "word_count": 276,
      "fetch_timestamp": "2025-08-20T08:27:39.371126",
      "metadata": {
        "char_count": 1776,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:27:39.371122"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/eminem-walk-on-water-ft-beyonce/",
      "source": "pitchfork",
      "artist_name": "Eminem",
      "title": "Eminem: “Walk on Water” [ft. Beyoncé]",
      "content": "---\ntitle: Eminem: “Walk on Water” [ft. Beyoncé]\nauthor: Jayson Greene\nurl: https://pitchfork.com/reviews/tracks/eminem-walk-on-water-ft-beyonce/\nhostname: pitchfork.com\ndescription: Eminem spends nearly every one of this song’s 304 seconds fretting aloud about his own obsolescence.\nsitename: Pitchfork\ndate: 2017-11-10\n---\nOnce, about 6,000 years ago, Eminem sounded genuinely playful: “I’m interesting! The best thing since wrestling!” he proclaimed brightly. Today, gaunt and mean-eyed and forever so fist-clenchingly serious that he seems on the verge of squinting himself into a black hole, Marshall Mathers senses, maybe, that he’s not that interesting anymore. “Walk on Water” is his latest joyless trudge of a power ballad that pairs a softly crooned hook with fuming, escalating verses of rage-spittle—a formula he’s followed dutifully since 2010’s “Love the Way You Lie” gave him new life on the charts. Tellingly, he spends nearly every one of this song’s 304 seconds fretting aloud about his own obsolescence.\nThe big news this time around is that the crooned hook is offered by Beyoncé, a strangely regressive role for the biggest pop star on the planet. Nonetheless, she executes it with her typical feather-light touch and superhuman poise, her singing trembling expertly at the border between head and chest voice. The track, produced by Rick Rubin, sounds made for a commercial, a noncommittal gloop of grand piano and strings with no beat.\nIt’s an appropriately blank canvas for Mathers to scribble on, and he blots out every inch of white space with his chains of logorrhea. As usual, it sounds impressive on the surface, but a closer look reveals wording either leaden (“It’s the curse of the standard that the first of the Mathers discs set”) or nonsensical (“pressure increases like khakis”). Once, Eminem rhymed with such audible joy that it almost excused his puerility. Now, rapping sounds almost unendurable to him, even though he doesn’t know how to stop—in the last 10 seconds, after Beyoncé gracefully bows out, he can’t help butting back in to remind us: “Bitch, I wrote ‘Stan’!” Yeah, Marshall. We remember.",
      "author": "Jayson Greene",
      "published_date": "2017-11-10",
      "word_count": 334,
      "fetch_timestamp": "2025-08-20T08:27:39.404995",
      "metadata": {
        "char_count": 2139,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:27:39.404991"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/14380-recovery/",
      "source": "pitchfork",
      "artist_name": "Eminem",
      "title": "Eminem: Recovery",
      "content": "---\ntitle: Eminem: Recovery\nauthor: Jayson Greene\nurl: https://pitchfork.com/reviews/albums/14380-recovery/\nhostname: pitchfork.com\ndescription: The rapper's next comeback LP, this is meant to trace Em's journey out of depression and drug addiction and back into the peak of his powers.\nsitename: Pitchfork\ndate: 2010-06-18\n---\nWatching Eminem attempt to re-situate himself in the pop landscape the past year or so has been a bizarre spectacle. He roared out of his post-Encore slumber in early 2009 seeming almost puppyishly eager to rap again, spitting verses for anyone who put him in front of a mic with a desperation that suggested he was making up for lost time. Relapse, his 2009 comeback album, found him trying to scratch and claw his way back into the body of 1999-era Slim Shady, but the effect was similar to Metallica trying to revisit their thrash years with 2008's Death Magnetic: The sound was there; the fury, long gone. No matter how many starlets he tortured and killed in his lyrics, Em couldn't rewrite the intervening years and the enervating effect they've had on his spirit.\nSo now he's back again, with the follow-up to Relapse, and as its title suggests, Recovery is meant to be triumphant, tracing Em's journey out of depression and drug addiction and back into the peak of his powers. Out of all the depressing aspects of Recovery, the worst is the realization that for listeners the album takes the opposite arc-- the more he motors on about having reclaimed his passion for hip-hop and finally figured out who he is, the more draining the album becomes. Eminem has never really known who he is, which has resulted in one of the most wildly erratic discographies of any major rap artist; at this point, the number of times he's sounded rudderless on record are catching up to the times he's sounded alive. At his best, he has always made a fascinating scramble of his internal turmoil, but the guy rapping on Recovery just sounds devoid of any noticeable joy, personality, or wit.\nNot that he's not trying. As on Relapse, Em almost passes out showing us he's still got it, rapping in double and triple time, piling tricky syncopations on top of each other, constructing whole verses with end rhymes buried in the middle of phrases-- basically any kind of pyrotechnical trick he can think of to wow the kind of rap listeners who venerate technical skill above all else. And yet for all the rattling-around-inside-the-beat syllable pileups here, there is almost nothing worth quoting. He reels off an astonishing amount of cringe-worthy lines, on the order of, \"Girl, shake that ass like a donkey with Parkinson's.\" On the menopausal, Diane Warren-esque uplift anthem \"Not Afraid\", he actually strings together the excruciating lines, \"Okay, stop playin' with the scissors and shit, and cut the crap/ I shouldn't have to rhyme these words in a rhythm for you to know it's a wrap.\" Eminem spends nearly half of Recovery insisting he's the best rapper alive, but for the first time in his career, he actually sounds clumsy.",
      "author": "Jayson Greene",
      "published_date": "2010-06-18",
      "word_count": 512,
      "fetch_timestamp": "2025-08-20T08:27:39.441781",
      "metadata": {
        "char_count": 3048,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:27:39.441777"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/11472-forever-ft-kanye-west-lil-wayne-and-eminem/",
      "source": "pitchfork",
      "artist_name": "Eminem",
      "title": "Drake: \"Forever\" [ft. Kanye West, Lil Wayne, and Eminem]",
      "content": "---\ntitle: Drake: \"Forever\" [ft. Kanye West, Lil Wayne, and Eminem]\nauthor: Tom Breihan\nurl: https://pitchfork.com/reviews/tracks/11472-forever-ft-kanye-west-lil-wayne-and-eminem/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2009-09-01\n---\nSo here we have Drizzy's official coronation, the song that's supposed to make us believe the former Jimmy Brooks is a rap star to be taken seriously. And predictably enough, that coronation comes via an attempt at this fall's \"Swagga Like Us\", the event-rap posse cut where four of the game's biggest names compete to see who can seem most above the fray. Half the \"Swagga\" lineup returns, but this time Jay-Z's got his own product to promote, and T.I.'s too busy folding laundry and dodging shanks. So instead we get Eminem, whose turgid horrorcore comeback album sold well enough that we now have to consider him a commercial rapper, even if he's as uncomfortable here as he was on the \"Lean Back\" remix. And we get Drake, boring as hell when he's not cooing about the travails of fame over skeletal blip-blip beats.\nHonestly, \"Forever\" isn't terrible, but it sounds exactly like what you'd expect given everyone involved. Kanye fumes effectively about how fame is the worst thing ever, Wayne says nothing and practically falls asleep, Em does a halting double-time thing and rattles off some half-decent punchlines, and Drake does his best to sound like a big boy. Instead of Kanye's static-riddled, discordant \"Swagga\" beat, we get a generically epic stomper from \"Best I Ever Had\" producer Boi-1da. But this sort of e-mailed-around PR stunt invalidates the whole idea of the posse cut in the first place. Once upon a time, it was bracing to hear a bunch of guys trying to outdo each other on the same track, feeding off each other's energy and stepping on each other's lines. But everything about \"Forever\" feels obligatory and inevitable and lifeless and ultimately depressing. Next to this, even \"Swagga\" crackled with fury.\n[from More Than a Game OST; due 09/29/09 on Interscope]",
      "author": "Tom Breihan",
      "published_date": "2009-09-01",
      "word_count": 326,
      "fetch_timestamp": "2025-08-20T08:27:39.475648",
      "metadata": {
        "char_count": 2033,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:27:39.475640"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/13034-relapse/",
      "source": "pitchfork",
      "artist_name": "Eminem",
      "title": "Eminem: Relapse",
      "content": "---\ntitle: Eminem: Relapse\nauthor: Ian Cohen\nurl: https://pitchfork.com/reviews/albums/13034-relapse/\nhostname: pitchfork.com\ndescription: It's the return of the... Ah, wait, no way, you're kidding: Eminem's relapse is just an update of his shock tactics? It still beats most of Encore.\nsitename: Pitchfork\ndate: 2009-05-19\n---\nYou might think calling Eminem \"divisive\" in 2009 would give him too much credit. After all, nearly every piece of promotion that's led up to the release of Relapse has caused the internet to stop whatever it was doing and form a unified chorus exclaiming how washed up it made the guy look. But did you know that after \"We Made You\" hit the airwaves, major networks ran segments on whether Eminem's \"controversial\" new video went too far? Let's think big picture here: In some corners of the indie community, people quibble about whether Wavves are overhyped, even though 99% of America have absolutely no fucking clue who they are. Eminem is divisive the way BIG people are. Like A-Rod. Or George W. Bush.\nRelapse makes it abundantly clear where the line gets drawn in 2009. It's appropriate that the title character from \"Stan\" has become web argot for \"obsessive fanboy,\" because Eminem drives both Stan and stan alike crazy in the same exact way-- by completely ignoring them until it's too late to make amends. Star Trek isn't the only franchise reboot expected to do big numbers this summer-- instead of the 13-year-old who got into The Slim Shady LP and found that underground shit he did with Scam, Relapse is for that guy's little brother who's 13-years old right now, and Eminem is fully committed to upping the ante for today's desensitized sensibilities. Do a double-take when he rapped \"I just found out my mom does more dope than I do\"? This time, you get to untangle the knotty word thickets of \"My Mom\", wherein young Marshall gets bullied and tricked by you-know-who into an addiction to prescription pills. Recoil when he threatened to push a fat girl off the high dive in swim class? He's now murdering his cousin in a tub and drinking the bathwater. Cringe at Eminem advocating roofies at a kegger? Get ready for the term \"felching\" to enter the public consciousness as Eminem gets anally raped by his stepfather in a tool shed. Got all that? Congrats, you're now four songs into Relapse.\nIt's smart for Em to revert to the shock tactics of his glory days-- Encore was a Chinese Democracy/HIStory-style catastrophe of self-exile with no real exit strategy. Though saddled with a terribly awkward rhythm that Eminem thankfully ignores, \"Underground\" finds him laying waste to a murderer's row of horror movie franchises with focused, devilish glee. If Relapse were Eminem in Michael Myers mode, it would be fantastic, but instead he's gone Mike Myers or even Robin Williams, subjecting us to \"wacky\" accents and a delusional sense that he still has a grip on what's edgy.",
      "author": "Ian Cohen",
      "published_date": "2009-05-19",
      "word_count": 489,
      "fetch_timestamp": "2025-08-20T08:27:39.513582",
      "metadata": {
        "char_count": 2919,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:27:39.513577"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "Eminem",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-20\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nRap\nStar Line\nChance the Rapper\nBy\nAlphonse Pierre\nAugust 20, 2025\nRock\nLove Is Like\nMaroon 5\nBy\nLinnie Greene\nAugust 20, 2025\nExperimental\nKhadim\nMark Ernestus’ Ndagga Rhythm Force\nBy\nRae-Aila Crumble\nAugust 20, 2025\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-20",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-20T08:27:39.994501",
      "metadata": {
        "char_count": 7698,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:27:39.994490"
      }
    }
  ],
  "total_articles": 10,
  "total_words": 5427,
  "extracted_at": "2025-08-20T08:27:39.994950",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/eminem-the-death-of-slim-shady-coup-de-grace/",
    "https://pitchfork.com/reviews/albums/eminem-music-to-be-murdered-by/",
    "https://pitchfork.com/reviews/albums/eminem-kamikaze/",
    "https://pitchfork.com/reviews/albums/eminem-revival/",
    "https://pitchfork.com/reviews/tracks/eminem-untouchable/",
    "https://pitchfork.com/reviews/tracks/eminem-walk-on-water-ft-beyonce/",
    "https://pitchfork.com/reviews/albums/14380-recovery/",
    "https://pitchfork.com/reviews/tracks/11472-forever-ft-kanye-west-lil-wayne-and-eminem/",
    "https://pitchfork.com/reviews/albums/13034-relapse/",
    "https://pitchfork.com/reviews/albums/"
  ]
}