{
  "artist_name": "Bob Dylan",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/pro/bob-dylan-sexual-abuse-lawsuit-fines-lawyers/",
      "source": "billboard",
      "artist_name": "Bob Dylan",
      "title": "Bob Dylan Wins Penalties Against Attorneys Who Filed ‘Heinous’ Child Sex Abuse Lawsuit",
      "content": "---\ntitle: Bob Dylan Wins Penalties Against Attorneys Who Filed ‘Heinous’ Child Sex Abuse Lawsuit\nauthor: Bill Donahue\nurl: https://www.billboard.com/pro/bob-dylan-sexual-abuse-lawsuit-fines-lawyers/\nhostname: billboard.com\ndescription: Bob Dylan won fines over a sexual abuse lawsuit filed against him. The singer was granted legal penalties against two lawyers who filed the case.\nsitename: Billboard\ndate: 2025-08-14\ncategories: ['Legal News']\ntags: ['genre rock, lawsuit, Legal']\n---\nBob Dylan Wins Penalties Against Attorneys Who Filed ‘Heinous’ Child Sex Abuse Lawsuit\nA federal appeals court upheld legal fines against two lawyers over a case that unsuccessfully raised allegations Dylan called \"heinous and false.\"\nBob Dylan has won legal penalties against two lawyers who filed — and then quickly dropped — a lawsuit accusing the music legend of sexually abusing a child in the 1960s.\nFiled in 2021, the case featured salacious allegations about Dylan, but music historians quickly said it wasn’t even chronologically plausible — and the unnamed accuser abruptly dismissed the case after the star’s lawyers accused her of destroying key evidence.\nIn a decision issued Wednesday (Aug. 13), a federal appeals court upheld monetary penalties against the woman’s lawyers (Daniel W. Isaacs and Peter J. Gleason), whom Dylan’s attorneys have accused of making “heinous and false allegations” without sufficient vetting.\nTrending on Billboard\nDylan’s lawyers argued that they only found out the accuser had failed to turn over crucial emails after sending subpoenas — an argument that the appeals court called “particularly telling” in the new ruling against Isaacs and Gleason.\n“Had [Dylan]’s counsel not sought this third-party discovery, it is probable that responsive communications in [the accuser]’s possession might never have come to light,” wrote the U.S. Court of Appeals for the Second Circuit. “And all of this transpired despite the [judge]’s repeated, emphatic warnings.”\nThough hotly contested by both sides, the penalties against the lawyers are relatively modest: $5,000 against Isaacs and $3,000 against Gleason. In court filings, Dylan’s lawyers have called them “essentially symbolic” and a “fraction” of the money he spent defeating the case.\nIsaacs and Gleason’s client, identified in court documents only as J.C., filed her case in August 2021, claiming Dylan had abused her multiple times at Manhattan’s Chelsea Hotel in April and May 1965. The lawsuit said he provided her with drugs and alcohol and “exploited” his status as part of a plan to “sexually molest her.”\nDylan vehemently denied the allegations, and rock historians quickly cast doubt on them, saying the folk star was on tour in California and overseas during the months in question. Less than a year after the case was filed, it was dropped without a settlement.\nThat abrupt end came after months of chaos. Dylan’s lawyers first accused Isaacs and Gleason of refusing to cooperate with discovery, then charged that their client, J.C., had deleted key evidence. At one point, a judge implored the two lawyers to comply with such orders “for the love of god.”\nEven after the case was dropped, Dylan’s attorneys sought harsh sanctions, arguing that the pair of lawyers should not be allowed to simply walk away from the case after leveling such serious allegations and then refusing to properly litigate them.\nAfter the judge handed down the $8,000 combined sanction, the pair of lawyers appealed the penalty to the Second Circuit, arguing that they had “repeatedly attempted” to get their “recalcitrant” client to hand over the materials in question. They called it “manifestly unjust” to hold them responsible for the accuser’s conduct.\nBut Dylan’s lawyers pressed the court to uphold the fine, arguing that even the “most rudimentary investigation would have revealed the claims to be false” and that Isaacs and Gleason had stymied the process by which Dylan could “vindicate his innocence.”\n“Mr. Dylan was subjected to almost a year of litigation — facing the most vile allegations imaginable — during which appellants engaged in a pattern of deliberate discovery misconduct that hindered Mr. Dylan’s ability to fight this false claim,” his lawyers wrote. “Now, Appellants bring this appeal in a last-ditch effort to get away scot-free.”\nIn Wednesday’s decision, the appeals court sided firmly with Dylan, rejecting Isaacs and Gleason’s various arguments against the sanctions. The judges cited an earlier decision that says such penalties are based “not only [on] the straw that finally broke the camel’s back” but on “all the straws that the recalcitrant party piled on over the course of the lawsuit.”\n“Here, straws abound,” the appeals court wrote. “The record is replete with instances of Isaacs and Gleason failing to discharge their discovery obligations under the relevant law and district court’s orders.”\nIn a detailed statement to Billboard, Gleason said he was “deeply disappointed” with the ruling but that “this matter is not over.” He said his client had made “what we believed to be credible allegations” against Dylan; he also claimed that Dylan’s law firm, the prestigious Gibson Dunn, had previously represented him personally and had a conflict of interest in the proceedings.\n“In my humble opinion, this whole matter reeks of the courts allowing the largess of the white shoe law firms tipping the scales of justice in their favor,” Gleason said. “I fully intend to delve deep into the integrity of the court.”\nIn his own statement to Billboard, Dylan’s attorney, Brian Ascher, said the arguments regarding Gibson Dunn had already been “summarily rejected” by the judge overseeing the case when it was raised during the litigation: “This is sour grapes,” Ascher said.",
      "author": "Bill Donahue",
      "published_date": "2025-08-14",
      "word_count": 904,
      "fetch_timestamp": "2025-08-20T16:36:55.863191",
      "metadata": {
        "char_count": 5780,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:36:55.863184"
      }
    },
    {
      "url": "https://www.billboard.com/music/concerts/bob-dylan-live-aid-farm-aid-willie-nelson-mortgages-1236020528/",
      "source": "billboard",
      "artist_name": "Bob Dylan",
      "title": "How Bob Dylan’s Live Aid Remark — ‘Pay The Mortgages on Some of the Farms’ — Sparked 40 Years of Activism By Willie Nelson, Neil Young, John Mellencamp & More",
      "content": "---\ntitle: How Bob Dylan’s Live Aid Remark — ‘Pay The Mortgages on Some of the Farms’ — Sparked 40 Years of Activism By Willie Nelson, Neil Young, John Mellencamp & More\nauthor: Thom Duffy\nurl: https://www.billboard.com/music/concerts/bob-dylan-live-aid-farm-aid-willie-nelson-mortgages-1236020528/\nhostname: billboard.com\ndescription: Here's how Bob Dylan’s remarks at Live Aid about paying farm mortgages sparked the creation of Willie Nelson's Farm Aid concerts.\nsitename: Billboard\ndate: 2025-07-14\ncategories: ['Concerts']\ntags: ['bbnews, Billboard, billboard news, music, Music News']\n---\nForty years ago, at the Live Aid festival in Philadelphia on July 13, 1985, it took Bob Dylan just a few moments to set in motion the music industry’s longest-running concert for a cause — Willie Nelson’s Farm Aid.\nDylan took the stage at JFK Stadium late in the day, just past 10:30 p.m., accompanied by Ronnie Wood and Keith Richards of The Rolling Stones, each with acoustic guitars. (They were preceded by Mick Jagger and Tina Turner’s incendiary duet.)\nOpening with two seldom-performed songs from 1964, “Ballad of Hollis Brown” and “When The Ship Comes In,” Dylan then said, in an off-the-cuff manner:\nTrending on Billboard\n“I hope that some of the money that’s raised for the people in Africa, maybe they can just take a little bit of it — maybe one or two million, maybe — and use it, say, to pay the mortgages on some of the farms that the farmers here owe to the banks.”\n“The question hit me like a ton of bricks,” Nelson recalled to his biographer David Ritz in Billboard in 2015. The musician was on the road that day, watching Live Aid on his tour-bus TV.\n“Farming was my first job,” he told Billboard. “I picked cotton. I pulled corn. I knew firsthand what it meant to farm. I knew damn well how tough it was. My farm roots are deep-seated in the soil of my personal story.”\nSo are the roots of Nelson’s philanthropy. In his small hometown of Abbott, Texas, where he attended the United Methodist Church, “we had a collection box, and even though we were struggling financially, I knew there were folks with far greater struggles. As part of a loving community, I was taught the moral responsibility of helping those in need.”\nLike Dylan, at that time, Nelson also had been following the news of the family farming crisis that was devastating the heartland of the United States. Prices paid for crops had plummeted. Banks were foreclosing on farms, throwing families off land they had worked, often, for generations. Small towns, dependent on spending by local farmers, were reeling.\nDavid Senter, a fourth-generation farmer and co-founder of the American Agriculture Movement, recalled that time for “Against the Grain,” the Farm Aid podcast.\n“The farm crisis was a terrible, expanding tragedy for rural America,” said Senter. “We lost 50 percent of the total family farmers during the crisis. Three-hundred-and-sixty-five farmers a day were going out of business during ’85. We brought a couple of thousand farmers to Washington in March of ’85 and we had a rally on the steps of the Jefferson [Memorial]. We had 365 white crosses [bearing the names of farmers] who had committed suicide or been foreclosed on. And we drove them on the Mall and made a graveyard in front of U.S.D.A.,” the headquarters of the United States Department of Agriculture.\nIn 1985, Nelson’s booking agent was Tony Conway of Buddy Lee Attractions. For a history of Farm Aid published for the organization’s 20th anniversary, Lee recalled that, in August of that year, Nelson was playing the Illinois State Fair in Springfield, Ill., when the singer said: “I want to do a concert for the American farmers. I want to see if we can do it here in Illinois, just someplace where we can get a stadium.”\n“Willie asked me, ‘Do you think you can get a hold of the governor?,’” he recalled. “I made a few calls and got a call back saying [then] Governor Jim Thompson was on his way to the bus.”\nNelson told his idea to Thompson, Lee said, and the governor made a call to secure availability of the football stadium at the University of Illinois in Champaign, Ill., for the one day open in Nelson’s packed autumn touring schedule — Sept. 22, 1985.\nNelson recruited Neil Young and John Mellencamp, who later became the first fellow members of the Farm Aid board. (The board expanded in 2001 to include Dave Matthews and again in 2021 to include Margo Price — who had grown up on a farm which her family lost in 1986, during the crisis which led to the creation of Farm Aid.)\nFarm Aid: A Concert for America was put together with the unthinkably short lead time of six weeks. It raised more than $7 million for the nation’s family farmers and featured performers including Billy Joel, Bonnie Raitt, B.B. King, Loretta Lynn, Roy Orbison, Tom Petty — and Bob Dylan.\nA front-page story in Billboard, under the bylines of Paul Grein and Kip Kirby, reported that the Jam Productions of Chicago, which help mount Farm Aid, used the same 60-foot diameter, circular, two-stage set that had been used at JFK Stadium for Live Aid.\nThe Billboard story reported that Nelson wrote the first check on the Farm Aid account to the National Council of Churches in the amount of $100,000 for food pantries to help feed farm families in seven states: Iowa, Minnesota, Wyoming, Nebraska, Oklahoma, Ohio and Kansas. “In addition,” Billboard reported, “Nelson notes that the toll-free 1-800-FARMAID phone lines will remain in operation for one year.”\nForty years later, Farm Aid carries on. The organization has raised more than $80 million to support programs that help family farmers thrive. It has earned a four-star rating from Charity Navigator, the widely known assessment organization for philanthropies.\nNelson, Young, Mellencamp, Matthew and Price will headline this year’s anniversary concert on Sept. 20 at Huntington Bank Stadium in Minneapolis, on a bill with Billy Strings, Nathaniel Rateliff & the Night Sweats, Trampled by Turtles, Waxahatchee, Eric Burton of Black Pumas, Jesse Welles and Madeline Edwards.\nTranscending the crisis which sparked its creation, Farm Aid’s mission today is “to build a vibrant, family farm-centered system of agriculture in America,” the organization states on its website. “We’re best known for our annual music, food and farm festival, but the truth is we work each and every day, year-round to build a system of agriculture that values family farmers, good food, soil and water, and strong communities.”\nAnd Dylan, who has been sharing headlining status with Nelson on this summer’s Outlaw Music Festival Tour, made a surprise return to the Farm Aid stage in 2023 at the Ruoff Music Center in Noblesville, Indiana.\nJoined by members of The Heartbreakers — whom he first performed with at Farm Aid in 1985 — Dylan walked onstage without any introduction, and played a short-but-intense set of “Maggie’s Farm,” “Positively 4th Street” and “Ballad of a Thin Man” against the stark backdrop of a silhouetted windmill.\nHis connection to Nelson, to Farm Aid and the cause he first highlighted at Live Aid 40 years ago remains unbroken.",
      "author": "Thom Duffy",
      "published_date": "2025-07-14",
      "word_count": 1192,
      "fetch_timestamp": "2025-08-20T16:36:55.917629",
      "metadata": {
        "char_count": 7131,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:36:55.917623"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/mgk-bob-dylan-narrate-lost-americana-album-trailer-1235995258/",
      "source": "billboard",
      "artist_name": "Bob Dylan",
      "title": "MGK Searches for the ‘American Dream’ in New Album Trailer Seemingly Narrated by Bob Dylan",
      "content": "---\ntitle: MGK Searches for the ‘American Dream’ in New Album Trailer Seemingly Narrated by Bob Dylan\nauthor: Hannah Dailey\nurl: https://www.billboard.com/music/music-news/mgk-bob-dylan-narrate-lost-americana-album-trailer-1235995258/\nhostname: billboard.com\ndescription: MGK tapped a voice that sounds a lot like Bob Dylan to narrate his new 'Lost Americana' album trailer.\nsitename: Billboard\ndate: 2025-06-10\ncategories: ['Music News']\ntags: ['genre rock, Music News']\n---\nMGK‘s next album will be a tribute to Americana, and it seems that he tapped one of the subculture’s biggest heroes, Bob Dylan, to narrate the project’s trailer.\nIn a clip previewing the August-slated LP posted Tuesday (June 10), a voice sounding very familiar to Dylan’s can be heard reading a description of the rapper-turned-rocker’s Lost Americana, calling it “a personal excavation of the American dream.”\n“It’s a sonic map of forgotten places, a tribute to the spirit of reinvention and a quest to reclaim the essence of American freedom,” the Dylan-esque drawl says over fuzzy shots of MGK smoking, riding motorcycles, hanging out with friends, taking in a mountainous landscape in awe and walking the Las Vegas strip. “From the glow of neon diners to the rumble of the motorcycles, this is music that celebrates the beauty found in the in-between spaces. Where the past is reimagined, and the future is forged on your own terms.”\nTrending on Billboard\nMGK further teased that Dylan is in fact the featured voice by cheekily writing in the video’s caption, “narrated by …” without revealing any names. Later, the “My Ex’s Best Friend” artist not-so-randomly shared a black-and-white photo of the Rock & Roll Hall of Famer on Instagram Stories Tuesday.\nBillboard has reached out to Dylan’s reps for comment.\nArriving Aug. 8, Lost Americana will mark MGK’s seventh studio album, following 2022’s Billboard 200-topper Mainstream Sellout. Leading up to its release, the artist born Colson Baker has dropped singles “Your Name Forever” and “Cliche,” which followed his 2024 collaborations with Jelly Roll, “Lonely Road” and “Time of Day.”\nAnd while a collaboration with the famously elusive Dylan might seem random, the Lost Americana trailer wouldn’t be the first time he and MGK’s worlds have collided (assuming that it really is the legend’s voice in the narration). In February, Dylan left fans confused when, without explanation, he posted an old video of the “I Think I’m Okay” artist rapping in a Florida music store in 2016 on Instagram.\nWhether that was Dylan’s way of declaring that he’s a fan of MGK or just a random moment, the younger musician was amused by the post. “you having a phone is so rad,” MGK commented at the time.\nSee MGK’s Lost Americana trailer, seemingly featuring the voice of Bob Dylan, below.",
      "author": "Hannah Dailey",
      "published_date": "2025-06-10",
      "word_count": 444,
      "fetch_timestamp": "2025-08-20T16:36:55.965437",
      "metadata": {
        "char_count": 2802,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:36:55.965431"
      }
    },
    {
      "url": "https://www.billboard.com/lists/top-grossing-music-biopics-movies/",
      "source": "billboard",
      "artist_name": "Bob Dylan",
      "title": "Bob Dylan Biopic ‘A Complete Unknown’ Tops $140M in Global Box Office: See Where It Ranks Among Top 25 Music Biopics",
      "content": "---\ntitle: Bob Dylan Biopic ‘A Complete Unknown’ Tops $140M in Global Box Office: See Where It Ranks Among Top 25 Music Biopics\nauthor: Paul Grein\nurl: https://www.billboard.com/lists/top-grossing-music-biopics-movies/\nhostname: billboard.com\ndescription: Here's a list of the 25 highest-grossing biopics of musicians worldwide, according to boxofficemojo.com.\nsitename: Billboard\ndate: 2025-05-12\ncategories: ['Lists']\ntags: ['music biopics, top-grossing films']\n---\nThe Bob Dylan biopic A Complete Unknown has topped the $140 million threshold in worldwide box-office grosses, according to boxofficemojo.com. As of Tuesday (May 27), it has grossed $140.5 million worldwide, which puts it at No. 7 on Billboard‘s list of music biopics with the highest worldwide grosses.\nTimothée Chalamet stars in A Complete Unknown, which follows Dylan from January 1961, when he moved from Minnesota to New York City, to July 1965, when he caused an uproar by playing electronic instruments at the Newport Folk Festival. James Mangold, who directed the Johnny Cash biopic Walk the Line (which is No. 5 on the list), also did the honors here.\nA Complete Unknown received eight Oscar nominations on Jan. 23, and made Oscar history as the first music biopic to receive three acting nods – for Chalamet as Dylan, Edward Norton as Pete Seeger and Monica Barbaro as Joan Baez. The film was shut out on Oscar night, March 2 — though Chalamet, seated in the front row in a canary-yellow suit, probably got more close-up reaction shots than anyone else.\nHere are the highest-grossing biopics of musicians in terms of worldwide box office. We didn’t include a few high-grossing films about real-life music personalities because they’re not biopics in the traditional sense. These include The Sound of Music (which tells the story of Maria von Trapp and the Trapp Family Singers); Green Book (which deals with a road trip taken by pianist and composer Don Shirley); Florence Foster Jenkins (about an heiress and hopelessly untalented soprano by that name); and Music of the Heart (about violinist and music educator Roberta Guaspari). Meryl Streep starred in the latter two films.\nHere are the 25 biopics of music stars with the highest worldwide grosses.\n-\nGet on Up (2014)\nWorldwide gross: $33.4 million\nDirector: Tate Taylor\nMusic: Thomas Newman\nNotes: The late, great Chadwick Boseman starred as James Brown in this biopic, which was directed by Tate Taylor and produced by Taylor, Brian Grazer, Mick Jagger and Victoria Pearman. Viola Davis, Craig Robinson and Octavia Spencer had supporting roles. The film soundtrack reached No. 61 on the Billboard 200.\n-\nThe Doors (1991)\nWorldwide gross: $34.5 million\nDirector: Oliver Stone\nMusic: The Doors\nNotes: Val Kilmer starred as The Doors’ charismatic lead singer Jim Morrison in this film that was directed by Oliver Stone, who also co-wrote the screenplay. The film also starred Kyle MacLachlan as keyboardist Ray Manzarek, Frank Whaley as lead guitarist Robby Krieger and Kevin Dillon as drummer John Densmore. The film followed Morrison from his days as a UCLA film student to his untimely death in Paris at age 27 in 1971. The film shared its title with the title of The Doors’ classic 1967 debut album. The soundtrack reached No. 8 on the Billboard 200.\n-\nSelena (1997)\nWorldwide gross: $35.8 million\nDirector: Gregory Nava\nMusic: Dave Grusin\nNotes: Rising star Jennifer Lopez starred as Tejano music star Selena, who rose from cult status to performing at the Houston Astrodome. The film includes her shocking murder at age 23 at the hands of former fan club president Yolanda Saldívar. The soundtrack reached No. 7 on the Billboard 200.\n-\nShine (1996)\nWorldwide gross: $36 million\nDirector: Scott Hicks\nMusic: David Hirschfelder\nNotes: Geoffrey Rush won an Oscar for best actor for playing pianist David Helfgott, who suffered a mental breakdown and spent years in institutions. The film was nominated for seven Oscars, including best picture. The soundtrack reached No. 59 on the Billboard 200.\n-\nFunny Lady (1975)\nWorldwide gross: $39 million\nDirector: Herbert Ross\nMusic: John Kander, Fred Ebb, Peter Matz\nNotes: This was the less-celebrated, but still popular, sequel to 1968’s Funny Girl. Barbra Streisand reprised her Oscar-winning role as Fanny Brice and James Caan played showman Billy Rose. The film spawned an Oscar-nominated song, “How Lucky Can You Get.” The film soundtrack reached No. 6 on the Billboard 200.\n-\nWhat’s Love Got to Do With It (1993)\nWorldwide gross: $39.1 million\nDirector: Brian Gibson\nMusic: Stanley Clarke\nNotes: Angela Bassett received an Oscar nomination for best actress for playing the indomitable Tina Turner in this biopic. Laurence Fishburne received an Oscar nod for best actor for playing her abusive husband Ike Turner. The film drew its title from Turner’s biggest hit, which topped the Billboard Hot 100 for three weeks in 1984 and won Grammys for record and song of the year. The film soundtrack reached No. 17 on the Billboard 200 and spawned a top 10 hit on the Hot 100, “I Don’t Wanna Fight.”\n-\nNotorious (2009)\nWorldwide gross: $44.4 million\nDirector: George Tillman Jr.\nMusic: Danny Elfman\nNotes: Jamal Woolard starred as Christopher Wallace (a.k.a. The Notorious B.I.G.) in this biopic. After rising to the top of the rap music world, Biggie was shot to death at age 24 in 1997. Angela Bassett, Derek Luke and Anthony Mackie also starred in the film. The soundtrack reached No. 4 on the Billboard 200.\n-\nJudy (2019)\nWorldwide gross: $46 million\nDirector: Rupert Goold\nMusic: Gabriel Yared\nNotes: Renée Zellweger won an Oscar for best actress for playing Judy Garland in this film. The irony: Garland never won a competitive Oscar, despite two nominations, one in the same category in which Zellweger won. Judy wasn’t a standard biopic, but a look at the last year of her life, when she arrived in London in the winter of 1968 to perform a series of sold-out concerts. Zellweger was nominated for a Grammy for the soundtrack, in the category of best traditional pop vocal album.\n-\nAmadeus (1984)\nWorldwide gross: $52 million\nDirector: Miloš Forman\nNotes: Tom Hulce received an Oscar nomination for best actor for playing Wolfgang Amadeus Mozart, but lost to F. Murray Abraham, who had the showier role as Antonio Salieri, who was insanely jealous of Mozart’s talent. The film received 11 Oscar nominations and won eight awards, including best picture and best director for Miloš Forman. Peter Shaffer also won best adapted screenplay for adapting his stage play, which had won five Tony Awards in 1981. The double-disc soundtrack, credited to conductor/arranger Neville Marriner, reached No. 56 on the Billboard 200 and won a Grammy for best classical album.\n-\nFunny Girl (1968)\nWorldwide gross: $52.2 million\nDirector: William Wyler\nMusic: Jule Styne, Bob Merrill\nNotes: Barbra Streisand won an Oscar for her motion picture debut in which she played Fanny Brice, a top star of the vaudeville era. “My Man” and “I’d Rather Be Blue,” both featured in Funny Girl, were hits for Brice in the 1920s. Streisand won best actress in a tie (still the only one in the history of the category) with Katharine Hepburn, who won for The Lion in Winter. “Hello, gorgeous,” Streisand began her speech, before graciously adding: “And I’m very honored to be in such magnificent company as Katharine Hepburn.” Funny Girl received eight nominations, including best picture and best original song for “Funny Girl.” The film soundtrack reached No. 12 on the Billboard 200 and spent more than two years on the chart.\n-\nLa Bamba (1987)\nWorldwide gross: $54.2 million\nDirector: Luis Valdez\nMusic: Carlos Santana, Miles Goodman\nNotes: Lou Diamond Phillips starred as Chicano music star Ritchie Valens who died at age 17 in the same plane crash that claimed the lives of Buddy Holly and The Big Bopper. The film is titled after a Mexican folk song, which Valens completely transformed with his rock and roll rendition in 1958. Valens’ version reached No. 22 on the Hot 100 in 1959. (It was not his biggest hit. That was “Donna,” which reached No. 2.) The film soundtrack, credited to Los Lobos, topped the Billboard 200 for two weeks in 1987. Los Lobos’ zesty recording of “La Bamba” topped the Hot 100 for three weeks and received Grammy nominations for record and song of the year.\n-\nAll Eyez on Me (2017)\nWorldwide gross: $55.7 million\nDirector: Benny Boom\nMusic: John Paesano\nNotes: Demetrius Shipp Jr. starred as Tupac Shakur in this film, with Jamal Woolard reprising his role as Christopher “The Notorious B.I.G.” Wallace from Notorious. Shipp’s father worked on music videos with 2Pac, who was shot to death in 1996 at age 25. The film drew its title from 2Pac’s 1996 double-disc album, his second to top the Billboard 200.\n-\nWhitney Houston: I Wanna Dance With Somebody (2022)\nWorldwide gross: $59.8 million\nDirector: Kasi Lemmons\nMusic: Chanda Dancy\nNotes: Naomi Ackie starred in this film, which arrived 10 years after Houston’s shocking death. Stanley Tucci co-starred as Clive Davis, who signed Houston to Arista Records in 1983 when she was just 19. Davis oversaw her tremendous rise but was unable to prevent her tragic fall. The film is titled after Houston’s 1987 single that topped Billboard’s 2023 list of The 500 Best Pop Songs: Staff List.\n-\nCoal Miner’s Daughter (1980)\nWorldwide gross: $67.2 million\nDirector: Michael Apted\nMusic: Owen Bradley\nNotes: Sissy Spacek won an Oscar for best actress for playing country queen Loretta Lynn. The film received seven Oscar nominations, including best picture. Tommy Lee Jones, Beverly D’Angelo and Levon Helm had supporting roles. Ernest Tubb, Roy Acuff, and Minnie Pearl made cameo appearances as themselves. The film was based on a 1976 biography of Lynn by George Vecsey also titled Coal Miner’s Daughter. Both the book and the film drew their titles from Lynn’s signature hit, which reached No. 1 on Billboard’s Hot Country Singles chart (as it was called then) in December 1970. The soundtrack reached No. 40 on the Billboard 200.\n-\nJersey Boys (2014)\nWorldwide gross: $67.6 million\nDirector: Clint Eastwood\nMusic: Bob Gaudio\nNotes: Clint Eastwood directed and co-produced this film adaptation of the blockbuster stage musical, which opened on Broadway in 2005. The biopic about The Four Seasons starred John Lloyd Young as Frankie Valli, Erich Bergen as Bob Gaudio, Michael Lomenda as Nick Massi and Vincent Piazza as Tommy DeVito. The film didn’t get nearly as much awards love as the stage musical did. The musical won four Tony Awards including best musical and best actor in a musical for Young. The film didn’t land a single Oscar nod. Valli and Gaudio served as executive producers of the film. The soundtrack reached No. 15 on the Billboard 200.\n-\nI Can Only Imagine (2018)\nWorldwide gross: $86.1 million\nDirectors: Andrew & Jon Erwin\nMusic: Brent McCorkle\nNotes: Michael Finley starred as Bart Millard, the lead singer of the contemporary Christian band MercyMe. Millard wrote the title song about his relationship with his father, played by Dennis Quaid. The song reached No. 71 on the Hot 100 and charted for 18 weeks. At the 2018 Dove Awards, the film, which also starred Trace Adkins and Cloris Leachman, won inspirational film of the year.\n-\nLa Vie En Rose (2019)\nWorldwide gross: $87.5 million\nDirector: Olivier Dahan\nMusic: Christopher Gunning\nNotes: Marion Cotillard won an Oscar for her role as the French singer who recorded the 1947 classic that gave the film its title. The song reached No. 23 on Billboard’s pre-Hot 100 pop chart in 1950. (Piaf also had one Hot 100 entry, “Milord,” in 1961.) The literal translation of “La Vie En Rose” is “Life in Pink,” a figurative reference to rose-colored glasses.\n-\nRay (2004)\nWorldwide gross: $124 million\nDirector: Taylor Hackford\nMusic: Craig Armstrong\nNotes: Jamie Foxx won an Oscar for best actor for playing Ray Charles, the genre-bridging musician who lived up to the label “genius,” which was often bestowed on him. The film received six Oscar nominations, including best picture. Taylor Hackford directed and co-produced the film, and co-conceived the story. The soundtrack reached No. 9 on the Billboard 200 and won a Grammy for best compilation soundtrack album for motion picture, television or other visual media.\n-\nA Complete Unknown (2024)\nWorldwide gross: $140.5 million\nDirector: James Mangold\nMusic: Nick Baxter, executive music producer\nNotes: Timothée Chalamet stars as Bob Dylan in this biopic, which follows Dylan from January 1961, when he moved from Minnesota to New York City, to his 1965 concert at the Newport Folk Festival, which stirred controversy over the use of electric instruments. James Mangold, who directed the Johnny Cash biopic Walk the Line, also did the honors here. The cast also includes Edward Norton as Pete Seeger, Monica Barbaro as Joan Baez, Boyd Holbrook as Johnny Cash and Scoot McNairy as Woody Guthrie, among others. The title is drawn from a key line in Dylan’s 1965 classic “Like a Rolling Stone.”\n-\nBob Marley: One Love (2024)\nWorldwide gross: $180.8 million\nDirector: Reinaldo Marcus Green\nMusic: Kris Bowers\nNotes: “First he changed music. Then he changed the world” was the tagline for this film, which was directed and co-written by Reinaldo Marcus Green. It was based on the life of reggae legend Bob Marley, from his rise to fame in the mid-1970s up until his death in 1981. The film starred Kingsley Ben-Adir as Marley, with Lashana Lynch as his wife Rita Marley and James Norton as Island Records founder Chris Blackwell.\n-\nWalk the Line (2005)\nWorldwide gross: $186.8 million\nDirector: James Mangold\nMusic: T Bone Burnett\nNotes: Joaquin Phoenix received an Oscar nomination for best actor for playing country legend Johnny Cash, while Reese Witherspoon won best actress for playing his wife, country star June Carter Cash. The film received five Oscar nominations. The screenplay, written by James Mangold (who also directed the film) and Gill Dennis, was based on two Cash autobiographies — 1975’s Man in Black: His Own Story in His Own Words and 1997’s Cash: The Autobiography. The film drew its title from Cash’s 1956 hit, “I Walk the Line.” The soundtrack reached No. 9 on the Billboard 200 and won a Grammy for best compilation soundtrack album for motion picture, television or other visual media.\n-\nRocketman (2019)\nWorldwide gross: $195.3 million\nDirector: Dexter Fletcher\nMusic: Matthew Margeson\nNotes: Taron Egerton won raves for his performance as Elton John, with Jamie Bell playing his collaborator, Bernie Taupin. But the actors were passed over for Oscar nods, while the real thing, Elton and Bernie, won Oscars for best original song for “(I’m Gonna) Love Me Again.” The film drew its title from John’s 1972 hit, which reached No. 6 on the Hot 100 – his highest ranking to that point. (Many bigger hits were in his future.) The soundtrack reached No. 50 on the Billboard 200.\n-\nStraight Outta Compton (2015)\nWorldwide gross: $201.6 million\nDirector: F. Gary Gray\nMusic: Joseph Trapanese\nNotes: Ice Cube was played by his real-life son, O’Shea Jackson Jr., in this N.W.A biopic, which also starred Corey Hawkins as Dr. Dre, Jason Mitchell as Eazy-E, Neil Brown Jr. as DJ Yella and Aldis Hodge as MC Ren. Paul Giamatti was featured as N.W.A’s manager Jerry Heller. The members of N.W.A were involved in the production of the film, including Ice Cube and Dr. Dre as producers. Eazy-E’s widow, Tomica Woods-Wright, was also a producer, while MC Ren and DJ Yella served as creative consultants. The film drew its title from N.W.A’s debut album, which reached a new peak on the Billboard 200 (No. 4) following the film’s release. The album had originally peaked at No. 37 in 1989. On Aug. 7, 2015, one week before the film’s release, Dr. Dre released Compton: A Soundtrack by Dr. Dre. Though not an official soundtrack, Dre said the album was “inspired by the movie.” It debuted at No. 2 on the Billboard 200.\n-\nElvis (2022)\nWorldwide gross: $288.7 million\nDirector: Baz Luhrmann\nMusic: Elliott Wheeler\nNotes: Elvis was Baz Luhrmann’s biopic of Elvis Presley, from his childhood to becoming one of the greatest pop music stars of all time. The film also explored his complex relationship with his manager, Colonel Tom Parker, played by Tom Hanks. In addition to directing the film, Luhrmann co-wrote and co-produced it. This was Luhrmann’s sixth film, following Strictly Ballroom (1992), Romeo + Juliet (1996), Moulin Rouge! (2001), Australia (2008) and The Great Gatsby (2013). The soundtrack, attributed to Elvis Presley and Various Artists, reached No. 26 on the Billboard 200.\n-\nBohemian Rhapsody (2018)\nWorldwide gross: $910.8 million\nDirector: Brian Singer\nMusic: Queen\nNotes: Rami Malek won an Oscar for best actor for playing Queen’s charismatic lead singer Freddie Mercury. The film also starred Gwilym Lee as guitarist Brian May, Ben Hardy as drummer Roger Taylor and Joe Mazzello as bassist John Deacon. May and Taylor served as consultants on the film, which focused on the period from the band’s formation in 1970 to their triumphant performance at Live Aid in Wembley Stadium in 1985. The film received five Oscar nominations, including best picture, and won four awards, more than any other film that year. The film drew its title from Queen’s most famous song, which reached No. 9 on the Hot 100 in 1976 and No. 2 in 1992 after it was featured in the box-office smash “Wayne’s World.” The Bohemian Rhapsody soundtrack reached No. 2 on the Billboard 200.",
      "author": "Paul Grein",
      "published_date": "2025-05-12",
      "word_count": 2904,
      "fetch_timestamp": "2025-08-20T16:36:56.027995",
      "metadata": {
        "char_count": 17533,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:36:56.027990"
      }
    },
    {
      "url": "https://www.billboard.com/culture/product-recommendations/best-bob-dylan-movies-like-a-complete-unknown-stream-online-1235938760/",
      "source": "billboard",
      "artist_name": "Bob Dylan",
      "title": "Loved ‘A Complete Unknown’? Here Are 10 More Bob Dylan Movies You Need to See",
      "content": "---\ntitle: Loved ‘A Complete Unknown’? Here Are 10 More Bob Dylan Movies You Need to See\nauthor: Robert Levine\nurl: https://www.billboard.com/culture/product-recommendations/best-bob-dylan-movies-like-a-complete-unknown-stream-online-1235938760/\nhostname: billboard.com\ndescription: Loved 'A Complete Unknown'? From concert films and documentaries to biopics, we review 10 other Bob Dylan movies available to stream online right now.\nsitename: Billboard\ndate: 2025-04-03\ncategories: ['Product Recommendations']\ntags: ['a complete unknown, NOADS, Product Recommendations, streaming, TV / Film']\n---\nAll products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\nThe Bob Dylan biopic A Complete Unknown is essentially an origin story: A young artist moves to the city and becomes who he is. Influenced by American icons like Woody Guthrie and Pete Seeger, Dylan makes a name for himself in the early 1960s Greenwich Village folk scene, then pushes against the genre’s limitations and “goes electric” at the 1965 Newport Folk Festival. The fans there, many earnest lefties who valued authenticity over artistry, didn’t know what hit them. Dylan became a bona fide rock star – one that would constantly follow his own muse.\nThe movie, which started streaming on Hulu last week, is a fantastic introduction to one of rock’s most important artists. It’s both accessible and mythic, and actor Timothée Chalamet captures Dylan’s smart-ass charisma. But it’s only the beginning of Dylan’s story – and of his life onscreen. If you want to see what happens next – or how it really happened, or what it looked like live – here are 10 more films to check out. (I’m not counting the two movies in which Dylan acted, director Sam Peckinpah’s Pat Garrett and Billy the Kid or the unavailable Hearts of Fire, or the two projects he directed, both of which are commercially unavailable.)\nIt’s a substantial body of work that starts with two of the best movies ever made about pop music, I’m Not There and Don’t Look Back, and ends with what must be one of the weirdest. None of them really explain how or why Dylan did all he did, but they all make for fascinating viewing.\nI’m Not There\nTodd Haynes’ I’m Not There is the film Dylan deserves – sometimes inaccessible but always original. It’s not a biopic in the normal sense of the term – onscreen text says it is “inspired by the music and the many lives of Bob Dylan.” The 2007 film tells the story of an artist who constantly reinvents himself through a series of different characters, including a downward-spiraling star of the ’60s, a folkie-turned-Born Again gospel musician, and an actor portraying that folkie. Cate Blanchett is especially compelling as the ’60s-era star, all speeded-up raw nerves. One of the best films ever made about pop music.\nDon’t Look Back\nDon’t Look Back is the rock-doc equivalent of the Beatles’ appearances on “The Ed Sullivan show” – an early master-class on How to Be a Rock Star. D.A. Pennebaker’s observational documentary shows Dylan onstage and off during his 1965 tour of the U.K. – flipping cue cards of lyrics to “Subterranean Homesick Blues,” holding court in his room at London’s Savoy Hotel, and embarrassing press conference journalists. Dylan oozes charisma and contempt for the starmaking machine – which, purposefully or not, helped establish his public persona. The box set includes 65 Revisited, a collection of film outtakes and performances that’s also pretty great.\nRolling Thunder Revue\nDylan tried filmmaking, most famously with Renaldo and Clara, a fascinating mess of a movie about his 1975 Rolling Thunder Revue tour. (The film was so obsessed with archetypes that it could have been called “Forever Jung.”) Some of that footage was used in Rolling Thunder Revue: A Bob Dylan Story by Martin Scorsese, a wonderfully weird part fictional meta-documentary that comes off as the movie Dylan might have made if he better understood the medium. Like Dylan’s autobiography, Chronicles: Volume One, it may not be completely, 100% factual, but it feels deeply true.\nNo Direction Home\nNo Direction Home is the documentary version of A Complete Unknown – the story of how Dylan made a name for himself in, then turned his back on, the New York city folk scene. The interviews are revealing, the performance footage is compelling, and the intensity, shaped by Scorsese as director, is electric. It happened so fast: Dylan performed with an electric band at the Newport Folk Festival just four-and-a-half years after his January 1961 arrival in New York, and just another year elapsed between then and the motorcycle accident that ends this part of his story.\nTrouble No More\nGoing electric set Dylan apart from his folky contemporaries, but his most surprising move came in 1979, when the Jewish sixties icon embraced Jesus and became a born-again Christian. (My uncle, also Jewish, gave me a vinyl copy of every Dylan album until the gospel-oriented Slow Train Coming.) Trouble No More, an hour-long documentary included on a Dylan box set and now available to stream, explores the fan reactions, interspersed with sermons written by Lucy Santé and delivered by actor Michael Shannon. Dylan later returned to Judaism, but the concert footage remains powerful.\nThe Other Side of the Mirror\nDylan’s early career, and the plot of A Complete Unknown, pivots on his decision to “go electric” at the 1965 Newport folk festival. Documentarian Murray Lerner’s The Other Side of the Mirror shows the four songs he performed there, plus Dylan’s workshop and concert performances in 1963 and 1964. Within two years, Dylan goes from performing news-driven broadsides like “Who Killed Davey Moore?” to playing expressionistic songs like “Chimes of Freedom” to waving goodbye to the folk scene with “It’s All Over Now, Baby Blue. Amazon Prime members can stream The Other Side of the Mirror online free here.\nShadow Kingdom\nDylan’s 2021 Shadow Kingdom: The Early Songs of Bob Dylan might have been the best thing to come out of the pandemic. What was expected to be a streamed live performance turned out to be one of the most high-concept concert films since Stop Making Sense. It was shot in black and white, on a soundstage set up to look like the fictional “Bon Bon Club” in Marseille, and it features musicians Dylan doesn’t normally work with, playing arrangements of songs he rarely performs. It’s less a concert than a hazy, dreamlike vision of one – in a good way.\nBob Dylan: MTV Unplugged\nFirst Dylan plugged in, then he unplugged again – first for two albums in the early 1990s, then for a 1994 episode of MTV’s live music franchise that came out the following year as an album and the video, Bob Dylan: MTV Unplugged. Although he performed everything on those two albums, he played this show with his live band at the time, with the addition of producer Brendan O’Brien on Hammond organ. In true Dylan fashion, some of it is brilliant, including “All Along the Watchtower” and “Like a Rolling Stone;” and at least a bit of it is electric. Watch Dylan’s MTV Unplugged concert streaming free on Prime Video.\nThe 30th Anniversary Concert Celebration\nIn 1992, Dylan joined the Madison Square Garden tribute that was released as The 30th Anniversary Concert Celebration, where a variety of artists performed his songs. Some were great (Lou Reed, Willie Nelson), some were disappointing (Richie Havens), and not enough were unexpected. But the sheer star power here is hard to beat: George Harrison, Eric Clapton, Stevie Wonder, Neil Young and two members of Pearl Jam – plus Dylan himself. The songs are great, too.\nMasked and Anonymous\n“I wanted to make a Bob Dylan movie that was like a Bob Dylan song,” said screenwriter and director Larry Charles about Masked and Anonymous. One that was “ambiguous and hard to figure out, like a puzzle.” This movie, an oddball post-apocalyptic pop music comedy, stars Dylan as rock legend Jack Fate, sprung from prison to perform a benefit concert to save some future iteration of the U.S., is a few pieces short. It captures Dylan’s obsessions – shifts of identity, societal decay, the emptiness of celebrity – and fans will find it flawed but fascinating. Everyone else will just be confused.",
      "author": "Robert Levine",
      "published_date": "2025-04-03",
      "word_count": 1379,
      "fetch_timestamp": "2025-08-20T16:36:56.097235",
      "metadata": {
        "char_count": 8385,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:36:56.097229"
      }
    },
    {
      "url": "https://www.billboard.com/music/rock/courtney-love-bob-dylan-like-a-rolling-stone-1235916268/",
      "source": "billboard",
      "artist_name": "Bob Dylan",
      "title": "Courtney Love Covers Bob Dylan’s ‘Like a Rolling Stone’",
      "content": "---\ntitle: Courtney Love Covers Bob Dylan’s ‘Like a Rolling Stone’\nauthor: Jessica Lynch\nurl: https://www.billboard.com/music/rock/courtney-love-bob-dylan-like-a-rolling-stone-1235916268/\nhostname: billboard.com\ndescription: Courtney Love delivered a surprise cover of Bob Dylan’s 'Like a Rolling Stone' during an event in London earlier this week, adding to her growing repertoire of unexpected live covers.\nsitename: Billboard\ndate: 2025-03-06\ncategories: ['Rock']\ntags: ['genre rock, Music News']\n---\nCourtney Love delivered a surprise cover of Bob Dylan’s “Like a Rolling Stone” during an event in London earlier this week, adding to her growing repertoire of unexpected live covers.\nThe Hole frontwoman performed the iconic 1965 track at the Royal Geographical Society on Tuesday (March 4) while appearing in conversation with actor-writer Todd Almond. The event celebrated Almond’s new oral history collection Slow Train Coming: Bob Dylan’s ‘Girl From the North Country’ and Broadway’s Rebirth.\nFollowing their discussion, Love stepped onto the stage alongside an acoustic guitarist, delivering a raw and impassioned rendition of the classic song, with Almond providing backing vocals.\nTrending on Billboard\nThe performance took place nearly 60 years after Dylan famously played “Like a Rolling Stone” at the Royal Albert Hall, just next door to the event venue.\nDuring the evening, Love also addressed longstanding speculation about a Hole reunion—shutting down rumors once again. Despite previously hinting in early 2024 that the band might reunite, she reiterated that there are no current plans to bring the group back together.\nLove’s choice of cover continues a recent trend of unexpected performances. In February, she appeared onstage alongside Green Day frontman, Billie Joe Armstrong, who was performing at the U.K. venue The Garage with his side-project covers band, The Coverups.\n“Ladies and gentlemen, Courtney Love,” Armstrong said halfway through the show according to fan video of the moment the singer unexpectedly took the stage. “Thank you, Billie Joe. My name is Courtney Love – you may not remember me. I’ve been living in a cave in Birmingham for about nine years. We’ll give this a f–king try, right?”\nLove then crashed through revved-up takes on Cheap Trick’s 1977 power pop classic “He’s a Whore” and the 1979 Tom Petty & the Heartbreakers tune “Even the Losers” and, according to NME, came back for an encore of Cheap Trick’s iconic “Surrender.”\nIn 2021, she also surprised fans with a rendition of Britney Spears’ “Lucky,” and in 2017, she took on Selena Gomez’s “Hands to Myself.”\nLove’s surprise cover comes as Dylan remains a focal point of discussion in music and film circles. The legendary singer-songwriter was recently reported to have declined an invitation to perform and present at the 2025 Oscars. His biopic A Complete Unknown received eight nominations but did not secure any wins.",
      "author": "Jessica Lynch",
      "published_date": "2025-03-06",
      "word_count": 448,
      "fetch_timestamp": "2025-08-20T16:36:56.146972",
      "metadata": {
        "char_count": 2928,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:36:56.146967"
      }
    }
  ],
  "total_articles": 6,
  "total_words": 7271,
  "extracted_at": "2025-08-20T16:36:56.491664",
  "urls_processed": [
    "https://www.billboard.com/pro/bob-dylan-sexual-abuse-lawsuit-fines-lawyers/",
    "https://www.billboard.com/music/concerts/bob-dylan-live-aid-farm-aid-willie-nelson-mortgages-1236020528/",
    "https://www.billboard.com/music/music-news/mgk-bob-dylan-narrate-lost-americana-album-trailer-1235995258/",
    "https://www.billboard.com/lists/top-grossing-music-biopics-movies/",
    "https://www.billboard.com/culture/product-recommendations/best-bob-dylan-movies-like-a-complete-unknown-stream-online-1235938760/",
    "https://www.billboard.com/music/rock/courtney-love-bob-dylan-like-a-rolling-stone-1235916268/"
  ]
}