{
  "artist_name": "Sabrina Carpenter",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/music/music-news/sabrina-carpenter-family-dogs-cover-dogue-vogue-1236046970/",
      "source": "billboard",
      "artist_name": "Sabrina Carpenter",
      "title": "Meet Sabrina Carpenter’s Family Dogs, Whose Egos Have ‘Substantially Grown’ With Newfound Cover Star Fame",
      "content": "---\ntitle: Meet Sabrina Carpenter’s Family Dogs, Whose Egos Have ‘Substantially Grown’ With Newfound Cover Star Fame\nauthor: Hannah Dailey\nurl: https://www.billboard.com/music/music-news/sabrina-carpenter-family-dogs-cover-dogue-vogue-1236046970/\nhostname: billboard.com\ndescription: Sabrina Carpenter's adorable family dogs grace the cover of 'Dogue,' the canine-centric 'Vogue' issue in which the star gushed about Louie & Goodwin.\nsitename: Billboard\ndate: 2025-08-19\ncategories: ['Music News']\ntags: ['genre pop, Music News, pets']\n---\nSabrina Carpenter‘s dogs may be famous enough now to grace the cover of Dogue, but first and foremost, they’ll always be woman’s best friend.\nOn Monday (Aug. 18), the pop star and Vogue jointly announced that Carpenter’s two pups, Goodwin and Louie, are cover stars for the publication’s ongoing dog-focused series. “My dogs’ first dogue cover,” the performer wrote, sharing the issue on her Instagram Story.\nOn the Dogue cover, the two canines pose with their tongues out while riding a white miniature Mercedes-Benz, modeling kerchiefs specially ordered for the occasion by Carpenter’s mom. “They can’t go on walks without getting stopped anymore … egos have substantially grown,” the Grammy winner also quipped. “Wish me luck.”\nGoodwin and Louie aren’t the only celebrity fur babies who are part of Dogue‘s latest cover series. ROSÉ of BLACKPINK’s terrier Hank is also featured this issue, as are Maluma’s Dobermans, Buda and Karma, and Siberian huskies Bonnie and Clyde.\nTrending on Billboard\nIn an interview with Vogue, Carpenter shared some of her favorite things about her pups. At 14-years-old, Goodwin — named after one of the singer-actress’ first gigs, a role on quickly scrapped series The Goodwin Games — has been with the musician since she first kicked off her career starring on Disney Channel’s Girl Meets World in 2014.\nOne-year-old Louie is newer to the Carpenter family, but he already has a nickname for when he misbehaves. “When he’s being bad, I call him Lucifer, but most of the time I just call him LouLou,” Carpenter told Vogue.\n“This sounds cliché, but their best quality — both of them — is just how genuinely loving and adoring they are,” she added of her pups. “Goodwin is really empathetic. He just knows when you’re sick and not feeling well. His eyes are humanlike. He’s got a lot of emotion; he has a lot of stories. Louie’s most humanlike quality would probably be his ears. They’re so attuned. He’s such a good listener.”\nThe musician’s collaboration with Vogue comes at a fitting time, considering the dog-themed aesthetics of her fast-approaching new album, Man’s Best Friend. Arriving Aug. 28, the LP’s cover features Carpenter channeling a four-legged sidekick as she poses on all fours, held in place by a man grabbing her by the hair.\nCarpenter also unveiled each of the song titles on the album by having her fans pose with an adorable pup and a director’s chair embroidered with the track names.",
      "author": "Hannah Dailey",
      "published_date": "2025-08-19",
      "word_count": 471,
      "fetch_timestamp": "2025-08-20T16:07:25.218461",
      "metadata": {
        "char_count": 2979,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:07:25.218436"
      }
    },
    {
      "url": "https://www.billboard.com/culture/product-recommendations/best-sabrina-carpenter-merch-find-online-1235936498/",
      "source": "billboard",
      "artist_name": "Sabrina Carpenter",
      "title": "From Funko Pops to Jersey Tops – Prep for ‘Man’s Best Friend’ by Shopping Sabrina Carpenter Merch",
      "content": "---\ntitle: From Funko Pops to Jersey Tops – Prep for ‘Man’s Best Friend’ by Shopping Sabrina Carpenter Merch\nauthor: Alison Abbey Hudak; Amina Ayoud\nurl: https://www.billboard.com/culture/product-recommendations/best-sabrina-carpenter-merch-find-online-1235936498/\nhostname: billboard.com\ndescription: Sabrina Carpenter's seventh studio album 'Man's Best Friend' is almost here. Here's how to shop Carpenter's merch ahead of the album's release now.\nsitename: Billboard\ndate: 2025-08-20\ncategories: ['Product Recommendations']\ntags: ['merch, Product Recommendations, Sabrina Carpenter']\n---\nAll products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\nCalling all Sabrina Carpenter fans!\nThe “Espresso” singer’s seventh studio album, Man’s Best Friend, is dropping in nine days via Island Records, which means it’s crunch time. The album, which drops on Aug. 29, includes 12 tracks, including her previously released single “Manchild.” Tracks include “Tears,” “My Man on Willpower,” “Sugar Talking,” “We Almost Broke Up Again Last Night,” “Nobody’s Son,” “Never Getting Laid,” “When Did You Get Hot?, “Go Go Juice,” “Don’t Worry I’ll Make You Worry,” “House Tour” and “Goodbye.” “Manchild” serves as the album’s opener.\nThe singer revealed the tracklist via her Instagram and Twitter posed up with puppies. To prep for her album like a true fan, we’ve rounded up a few of our favorite pieces of Carpenter merch, both official and unofficial, for you to shop now. We’re talking Funko Pops, coquette apparel and even fragrances that you can browse on Urban Outfitters, Target, Hot Topic and more. The best part? Nothing on this list is over $50.\nCollectors of Carpenter’s merch will love this Funko Pop Rocks Sabrina Carpenter figure. Retailing for $15.99, the durable vinyl figure depicts the singer in a bright blue nightgown with matching blue sandals laid out on what looks like a bed that doubles as a stand. The 3.75-inch figure perfectly fits on a shelf or inside a display case, showing off for all to see your love of the performer.\nTrending on Billboard\nWe love a subtle merch moment. Fashion-forward merch is becoming more and more popular these days, doubling as a wardrobe staple and a show of allegiance. This unofficial Man’s Best Friend necklace fits that profile to a tee. Retailing for $12.99, the necklace is made of a high-quality alloy with silver plating, making the necklace shiny and durable. The chain is attached to an embossed circular pendant reading “MBF” in fancy script or Man’s Best Friend in reference to her 2025 album. The chain is fixed with an adjustable clasp so you can customize the necklace’s fit. The stylish piece would make a great addition to your daily jewelry rotation.\nTotes are always a great item to have in your wardrobe. They’re stylish, effortless and super handy. If you want to give off a “cool girl” vibe with a Carpenter flair, then this tote is for you. Retailing for $15.92, this tote is made of a durable mix of polyester and canvas and features a print of a lit-up mirror on the front with a message scrawled in lipstick reading “Workin late” in reference to Carpenter’s hit song “Espresso.” This tote measures 12″ x 16″, perfect for holding all the necessities.\nThis Sabrina Carpenter Embroidered Girls Jersey is just darling. The style is extremely flattering and affordable to boot. Retailing for $44.90, this light blue top is made of a breezy jersey fabric and includes details that are utterly Carpenter. You’ve got puffy sleeves, a cropped hemline and a dainty white graphic printed on the front reading “SC.” The v-neckline is trimmed with white, creating contrast against the light blue base. Sizing options range from small to 3X. Wed style this fashionable piece with baggy barrel-esque jeans and sneakers for a casual concert moment. If you want to dress it up, a flowy white maxi skirt and moto boots should do the trick.\nThis Don’t Make Me Hate You Dad Cap is a must-have. The piece is currently on sale at Hot Topic for $21.52, which is 20% off the og price. The baby blue cap is made of breathable 100% cotton and features an embroidered logo fixed to the front that reads “Don’t Make Me Hate You” in reference to Carpenter’s track “Please Please Please.” The cap also includes an adjustable clasp that allows you to customize the fit. This cap is a great piece to throw on to make it look like you tried, even if you didn’t.\nIf you’re still attached to Carpenter’s 2024 album Short n’ Sweet like we are, you should definitely get this tee. Retailing for just $12, the shirt comes in sizes XXS to 3X and features a stylish boxy fit. The colorway is an off-white. A large retro-esque graphic in contrasting brown is sprawled on the front, depicting Carpenter and the words Short n’ Sweet beneath her. Simple and cute, we’d style this tee in a laid-back way with denim shorts and sneakers to grab coffee or cozy slippers and sweats for a night in.\nSimilar to our last entry, this t-shirt is pretty simple but a classic in our book. The merch piece retails for $12.99 and comes in black with contrasting flashy red graphics on the front reading Carpenter’s name. The tee comes in sizes XXS to 3X. The back of the tee is blank.\nIf you didn’t know, Carpenter first released a fragrance back in 2022. The Sweet Tooth line was expanded upon throughout the years to include four scents that feature a gourmand profile. That basically just means the fragrance smells like something you’d want to eat. The line includes Caramel Dream, Sweet Tooth, Me Espresso and, our favorite, Cherry Baby.\nIf you want a piece of practical merch, then this is it. Retailing for $50, this 75mL Eau De Parfum fragrance is scented how you’d expect, like cherries. According to Urban Outfitters, the notes include cherry cosmo, glazed apple, plum nectar, brown sugar, red poppy, peony blossom, dark chocolate, vanilla orchid, cashmere wood, sensual musk and patchouli elixir. To translate, it’s a sweet and fruity mix with musk that creates a deeper, earthier base. There’s also a smaller 1-oz bottle available at Urban Outfitters if you aren’t down to committing to a bigger batch.\nAlong with her Sweet Tooth line of perfumes, Carpenter also released Sweet Tooth body mists. The mists feature similar names and fragrance profiles to the perfumes. You’ve got Sweet Tooth, Caramel Dreams, Cherry Baby and Espresso. Espresso is our pick for the moment and smells like you bottled up a frappuccino.\nThe notes, according to Urban Outfitters’ website, include cocoa powder, espresso bean, night-blooming jasmine, vanilla orchid, buttery biscotti, caramel drizzle, sugared amber and whipped cream. The resulting fragrance is sweet and indulgent with milky notes and a hint of floral from the jasmine. Keep in mind that body mists are less pungent than perfumes. They have less staying power and pack less of a fragrance punch.\nFancy yourself an artist? Dive into this Sabrina-inspired unofficial coloring book, which includes 50 color-ready pages devoted to the lyrics, music and all-around vibes of the superstar’s latest album.\nIf you’re as much of a musician as you are a fan, this unofficial songbook will keep you in tune and in touch with your obsession all at once. Learn all 12 of Carpenter’s hits included here at home and perform your own concert in anticipation of the tour’s return.\nLooking for something a little more special (and a lot more luxe?) Dress the part in this custom-made corset from Etsy. Inspired by the costumes Carpenter rocks on the Short N’ Sweet Tour, this intricate fan-made ensemble will make you stand out in the crowd and have concert-goers wondering if they just caught a glimpse of the star herself. The Etsy seller says the dress is made from Italian and French fabrics and tailored to your measurements after purchase.\nThese unofficial keychains are a cute and easy way to show your love for the singer. Choose your favorite song (with a Spotify-inspired background) and your favorite charms to customize a keepsake you can use every day.\nThis 100% percent cotton tee baring a striking black and white silhouette of the Short N’ Sweet singer is a chic way to pay tribute to the star. Available in sizes XS to 3X, the unisex tee is listed in men’s sizing. Go up a size if you want that trendy oversized look.\nDesigned in the style of Carrie Bradshaw’s famous nameplate necklace on Sex and the City, this unofficial alloy-plated brass necklace is a trendy way to pay tribute to Carpenter’s album title. Fandom and fashion together? Sign us up!",
      "author": "Alison Abbey Hudak; Amina Ayoud",
      "published_date": "2025-08-20",
      "word_count": 1446,
      "fetch_timestamp": "2025-08-20T16:07:25.370947",
      "metadata": {
        "char_count": 8696,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:07:25.370938"
      }
    },
    {
      "url": "https://www.billboard.com/music/awards/2025-vmas-first-performers-set-sabrina-carpenter-sombr-more-1236045774/",
      "source": "billboard",
      "artist_name": "Sabrina Carpenter",
      "title": "Sabrina Carpenter, sombr, Alex Warren & More to Perform on 2025 MTV VMAs",
      "content": "---\ntitle: Sabrina Carpenter, sombr, Alex Warren & More to Perform on 2025 MTV VMAs\nauthor: Paul Grein\nurl: https://www.billboard.com/music/awards/2025-vmas-first-performers-set-sabrina-carpenter-sombr-more-1236045774/\nhostname: billboard.com\ndescription: First performers are set for the 2025 VMAs. Sabrina Carpenter, sombr, Alex Warren, Busta Rhymes, Ricky Martin & more will perform on the Sept. 7 show.\nsitename: Billboard\ndate: 2025-08-18\ncategories: ['Awards']\ntags: ['award, MTV Video Music Awards, MTV VMAs, Music News']\n---\nSabrina Carpenter is set to perform on the MTV Video Music Awards for the second year in a row.\nLast year, the pop sensation performed a three-smash medley – “Please Please Please,” “Taste” and “Espresso” – and won song of the year for “Espresso.” Carpenter is up for eight awards this year, including video of the year (“Manchild”) from her upcoming album Man’s Best Friend.\nAlex Warren, Busta Rhymes, J Balvin featuring DJ Snake, Ricky Martin and sombr are also set to perform on the show. The 2025 VMAs, hosted by LL COOL J, will air live coast-to-coast from New York’s UBS Arena on Sunday, Sept. 7, at 8 p.m. ET/5 p.m. PT.\nWarren and sombr are both nominated for best new artist at the VMAs. Both are almost certain to be nominated in that category at the Grammys, as Carpenter was last year. Last year’s VMA winner for best new artist, Chappell Roan, went on to win the Grammy in that category. (This year’s other VMA nominees for best new artist are Ella Langley, Gigi Perez, Lola Young and The Marías.)\nTrending on Billboard\nWarren is also nominated for best pop and song of the year for his global No. 1 smash “Ordinary.” Sombr is also nominated for best alternative for his hit “back to friends,” one of three songs of his on the current Billboard Hot 100 (along with “Undressed” and “12 to 12”). This is billed as sombr’s awards show debut.\nBusta will receive the MTV VMA Rock the Bells Visionary Award, presented by host LL COOL J (who had a hit in 1986 titled “Rock the Bells”). Martin will be honored with the inaugural Latin Icon Award.\nMartin’s award honors a four-decade career that launched Latin music and culture into the mainstream. Martin’s VMAs return marks the 26th anniversary of his first VMAs performance. On the 1999 telecast, he performed “She’s All I Ever Had” and his hip-swiveling global smash “Livin’ La Vida Loca.” The latter video won five awards: best pop video, best dance video and three International Viewer’s Choice awards.\nBusta’s award celebrates boundary-breaking cultural impact. Busta made his first VMAs appearance in 1997, when he presented best dance video alongside Martha Stewart. His most recent appearance was performing an extended hits medley in 2021. Busta received a Global Icon award at the 2024 MTV EMAs.\nJ Balvin returns to the VMAs with his latest hit “Zun Zun,” joined by Latin stars Justin Quiles and Lenny Tavárez. He’ll then team up with producer DJ Snake – making his first VMAs appearance – for the live premiere of their collab “Noventa.” Balvin, who last performed on the VMAs in 2022, is hoping to take home his sixth Moon Person this year. That would break him out of a tie with Martin as the leading Latin award winner in VMA history.\nAdditional performers, presenters and special guests will be revealed in the coming weeks.\nLady Gaga leads the nominations for the 2025 MTV Video Music Awards with 12 nods, followed closely by her “Die With a Smile” duet partner Bruno Mars, who has 11 nods. Other top contenders are Kendrick Lamar (10), ROSÉ and Sabrina Carpenter (eight each), Ariana Grande and The Weeknd (seven each) and Billie Eilish (six).\nMTV has yet to announce this year’s recipient of the Video Vanguard Award, but Billboard’s Andrew Unterberger listed eight likely candidates – in ascending order of perceived likelihood. (Last year, he correctly predicted Katy Perry as the Vanguard recipient, so he knows what he’s talking about.)\nThis will mark the first time the show has been broadcast by CBS. It will also simulcast on MTV and stream on Paramount+ in the U.S.\nThe 2025 MTV VMAs are executive produced by Bruce Gillmer, Den of Thieves co-founder Jesse Ignjatovic, and Barb Bialkowski. Gunpowder & Sky CEO Van Toffler is producer. Alicia Portugal is co-executive producer. Jackie Barba is executive in charge of production. Wendy Plaut is executive in charge of celebrity talent. Lisa Lauricella is executive in charge of music talent.\nThis marks Toffler’s return to the show following a decade-long absence.",
      "author": "Paul Grein",
      "published_date": "2025-08-18",
      "word_count": 750,
      "fetch_timestamp": "2025-08-20T16:07:25.453256",
      "metadata": {
        "char_count": 4527,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:07:25.453248"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/sabrina-carpenter-plays-mans-best-friend-early-fans-1236045260/",
      "source": "billboard",
      "artist_name": "Sabrina Carpenter",
      "title": "Sabrina Carpenter Has ‘Playdate’ With 26 Lucky Fans Who Got to Hear ‘Man’s Best Friend’ Before Its Release",
      "content": "---\ntitle: Sabrina Carpenter Has ‘Playdate’ With 26 Lucky Fans Who Got to Hear ‘Man’s Best Friend’ Before Its Release\nauthor: Hannah Dailey\nurl: https://www.billboard.com/music/music-news/sabrina-carpenter-plays-mans-best-friend-early-fans-1236045260/\nhostname: billboard.com\ndescription: Sabrina Carpenter played 'Man's Best Friend' early for some lucky fans, more than two weeks ahead of the album's release.\nsitename: Billboard\ndate: 2025-08-15\ncategories: ['Music News']\ntags: ['genre pop, Music News']\n---\nSabrina Carpenter is loosening her leash on Man’s Best Friend ahead of its release date, with the pop star playing the album for a group of lucky fans who got to hear it before the rest of the world at an exclusive event on Wednesday (Aug. 13).\nIn an Instagram post shared the following day, Carpenter announced, “Last night was the first playdate for Man’s Best Friend!”\n“I asked 26 of my beautiful LA fans to meet at a private location and then get on a bus to come meet me at the studio where i got to play the whole album for them,” she continued. “they were gracious enough to let me take their phones so they were totally present and respectful and amazing and it was genuinely one of my favorite nights in such a long time!”\nTrending on Billboard\nThe Grammy winner also shared a few pictures from the event, including a group photo of herself and the fans smiling at the camera as well as a snap of everyone dancing to the unreleased music. “The excitement i get to play this album top to bottom is really like no other record I’ve made,” Carpenter added in her caption.\nThe so-called playdate comes just two weeks ahead of the release of Man’s Best Friend, which will follow last year’s Billboard 200-topping Short n’ Sweet. Featuring 12 songs — including No. 1 Billboard Hot 100 hit “Manchild” — Carpenter’s seventh studio album drops Aug. 29.\nBut that’s not the only new music the Girl Meets World alum has in the works. As revealed by Taylor Swift on Wednesday (Aug. 13), the former Eras tourmates will be teaming up for a duet on the title track of Swift’s upcoming album, The Life of a Showgirl. Reacting to the announcement on Instagram Stories, Carpenter wrote, “i know someone who’s freaking out and it’s me.”",
      "author": "Hannah Dailey",
      "published_date": "2025-08-15",
      "word_count": 375,
      "fetch_timestamp": "2025-08-20T16:07:25.531727",
      "metadata": {
        "char_count": 2236,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:07:25.531718"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/sabrina-carpenter-mans-best-friend-final-cover-bonus-song-1236039768/",
      "source": "billboard",
      "artist_name": "Sabrina Carpenter",
      "title": "Sabrina Carpenter Unveils Final ‘Man’s Best Friend’ Alternate Cover Complete With ‘Special Bonus Track’",
      "content": "---\ntitle: Sabrina Carpenter Unveils Final ‘Man’s Best Friend’ Alternate Cover Complete With ‘Special Bonus Track’\nauthor: Hannah Dailey\nurl: https://www.billboard.com/music/music-news/sabrina-carpenter-mans-best-friend-final-cover-bonus-song-1236039768/\nhostname: billboard.com\ndescription: Sabrina Carpenter has unveiled the final cover of 'Man's Best Friend,' complete with a bonus song.\nsitename: Billboard\ndate: 2025-08-08\ncategories: ['Music News']\ntags: ['genre pop, Music News']\n---\nSabrina Carpenter has one last cover variant for new album Man’s Best Friend up her sleeve, and this time, it features an exclusive bonus track.\nThe pop star unveiled the fourth and final edition of the LP in an Instagram post on Friday (Aug. 8), three weeks before the project drops on streaming services. The artwork shows Carpenter holding court at a dinner table, looking glamorous in a sparkling blue gown as she commands five tuxedoed men surrounding her.\n“the final alternate cover for Man’s Best Friend features such a special bonus track called ‘Such A Funny Way’ available only on vinyl,” the Grammy winner wrote. “pre order now + a limited number of signed vinyl.”\nCarpenter also noted the short amount of time before her seventh studio album, which fans have been waiting for since she first announced the project in June. “3 weeks left!!!” she added. “can’t wait for it to be yours x.”\nTrending on Billboard\nThe Man’s Best Friend cover art has been a quintessential part of the album’s rollout so far, whether or not Carpenter intended it to be. When she first debuted the original artwork — a risqué photo of herself down on all fours, held in place by a man grabbing her by the hair — discourse erupted online over whether the image was empowering or regressive for women, a topic that even made it’s way to The View.\nSince then, the Girl Meets World alum has released multiple variations of the artwork, including a black-and-white photo of herself leaning on a man’s shoulder as well as a colorful snap of Carpenter basking in a room filled with flower bouquets sent by admirers. All four versions of Man’s Best Friend are available for purchase on the singer’s website.\nThe additional cover comes just a few days after Carpenter finally unveiled the Man’s Best Friend tracklist, which features 12 songs including Billboard Hot 100-topping lead single “Manchild.” At her headlining Lollapalooza set this past weekend, the star played the track for fans in Chicago as well as duetted with special guest Earth, Wind & Fire.\nSee Carpenter’s fourth and final Man’s Best Friend variant below.",
      "author": "Hannah Dailey",
      "published_date": "2025-08-08",
      "word_count": 414,
      "fetch_timestamp": "2025-08-20T16:07:25.610835",
      "metadata": {
        "char_count": 2595,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:07:25.610827"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/sabrina-carpenter-earth-wind-fire-lollapalooza-cameo-1236038148/",
      "source": "billboard",
      "artist_name": "Sabrina Carpenter",
      "title": "Earth, Wind & Fire Says Sabrina Carpenter ‘Did Her Homework’ to Pull Off Lollapalooza Cameo in Under 24 Hours",
      "content": "---\ntitle: Earth, Wind & Fire Says Sabrina Carpenter ‘Did Her Homework’ to Pull Off Lollapalooza Cameo in Under 24 Hours\nauthor: Hannah Dailey\nurl: https://www.billboard.com/music/music-news/sabrina-carpenter-earth-wind-fire-lollapalooza-cameo-1236038148/\nhostname: billboard.com\ndescription: Sabrina Carpenter apparently gave Earth, Wind & Fire just 24 hours' notice before the band joined her for a surprise performance at Lollapalooza.\nsitename: Billboard\ndate: 2025-08-06\ncategories: ['Music News']\ntags: ['Lollapalooza, Music News']\n---\nOne of the most memorable moments of this year’s Lollapalooza — Earth, Wind & Fire joining Sabrina Carpenter as a surprise guest — came together in less than 24 hours, according to member Philip Bailey.\nIn a post-festival interview with Vulture published Tuesday (Aug. 5), the frontman revealed that his band only had a day’s notice before their big moment on stage, with Carpenter’s team reaching out to the 1970s/80s icons with an invitation, flying them into Chicago on a private plane and hosting them for rehearsals all within a 24-hour time period. “We had to really turn this thing around,” Bailey told the publication.\n“We hopped a plane at seven in the morning, went in, and had the rehearsal,” he continued. “It was very quick and kind of sketchy. I was almost concerned about it. But by that evening, they had dialed everything in, and [Carpenter] did her homework on what verses she was going to take. We went out there and floated on all that energy.”\nTrending on Billboard\n“She’s very cordial, very kind, and very approachable,” Bailey noted of the Gen Z singer, whose work he hadn’t previously heard aside from smash hit “Espresso.” “Her energy and our energy were very compatible and complementary to one another. How she puts her show together, in terms of how it accelerates and builds, was fantastic.”\nThe interview comes three days after Earth, Wind & Fire took the stage with Carpenter, who closed out the entire 2025 festival by headlining the last of its four days on Sunday (Aug. 3). The other headliners included Tyler, the Creator, Rufus du Sol and Olivia Rodrigo, while Doechii, Gracie Abrams, KATSEYE and dozens of other artists also performed over the weekend.\nDuring Carpenter’s set, it came as a total surprise to her crowd when — in the middle of her usual setlist of tracks from Billboard 200-topping album Short n’ Sweet — Earth, Wind and Fire’s “Let’s Groove” started playing over the speakers. “We can just let loose, right? We can just groove,” the Girl Meets World alum said moments before the soul singers walked out on stage. “I thought, ‘Why not bring out my friends from Chicago?’ Give it up for Earth, Wind & Fire!'”\nThe musicians went on to perform “Let’s Groove” and “September” together. Summarizing the whole experience, Bailey added to Vulture, “We were honored to be asked and very appreciative to her and to her fans for embracing these moments we were able to share.”\nCarpenter is now gearing up to release her seventh studio album, Man’s Best Friend, on Aug. 29, following a whirlwind year of breakout success thanks to Short n’ Sweet. So far, fans have only gotten to hear one of the songs on the LP — “Manchild,” which dropped in June and hit No. 1 on the Billboard Hot 100 — but the vocalist did recently unveil the full tracklist.",
      "author": "Hannah Dailey",
      "published_date": "2025-08-06",
      "word_count": 549,
      "fetch_timestamp": "2025-08-20T16:07:25.689242",
      "metadata": {
        "char_count": 3328,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:07:25.689233"
      }
    },
    {
      "url": "https://www.billboard.com/video/liv-morgan-dominik-mysterio-summerslam-sabrina-carpenter/",
      "source": "billboard",
      "artist_name": "Sabrina Carpenter",
      "title": "Liv Morgan & Dominik Mysterio Talk SummerSlam, Sabrina Carpenter & More | Billboard",
      "content": "---\ntitle: Liv Morgan & Dominik Mysterio Talk SummerSlam, Sabrina Carpenter & More | Billboard\nauthor: Katie Cao\nurl: https://www.billboard.com/video/liv-morgan-dominik-mysterio-summerslam-sabrina-carpenter/\nhostname: billboard.com\ndescription: WWE Champions Liv Morgan & Dominik Mysterio on wanting to go up against Cardi B & Megan Thee Stallion in the ring, Sabrina Carpenter and more!\nsitename: Billboard\ndate: 2025-06-18\ncategories: ['Videos']\ntags: ['Billboard, genre pop']\n---\nWWE Champions Liv Morgan & Dominik Mysterio share what their dream entrance song remixes would be, Liv wanting to go up against Cardi B & Megan Thee Stallion in the ring, their thoughts on ‘Love On The Spectrum,’ SummerSlam, Sabrina Carpenter and more!\nAre you excited for Summer Slam? Let us know in the comments!\nNoah Reardon: We’re here with Liv Morgan and Dominik Mysterio. Gonna chat music today, a little different for you. I want to hear from both of you: What is your dream remix? Who would you love to have remix your theme?\nLiv Morgan: My dream remix of my song … I’d like a collaboration. I’d like a collaboration between Sabrina Carpenter and, like Drake, if they could come together and do some, like, cool remix of my song, I think that’d be pretty good. There’se a little giggle in the beginning, and that could be Sabrina, but then Drake could, like, chime in and, you know, say some cool s–t about me.\nDominik Mysterio: I would probably go a little bit more traditional Mexican. Fuerza Regida or Adriel Favela, Calle 24, maybe throw in some Mexican OT, too. I think that’d be, that’d be pretty dope. But, yeah, I think so.\nOh you just met him earlier?\nMysterio: Yeah, he’s a good dude.\nHow was that?\nMysterio: He’s awesome, yeah. I mean, looking forward to seeing him around more for sure.\nI heard it’s coming up on your anniversary. Is there any music from last summer’s songs that you’re like, “Oh, that is us. We were listening to that bumping that.”\nMorgan: I don’t know that there’s anything specific, because Dominik has, like, a very diverse, kind of eclectic music taste like he’s everywhere. But, you know, I did learn last summer that he’s a Sabrina Carpenter fan and so, you know, just anything Sabrina Carpenter kind of reminds me of Dominik a little bit. You know, she just released “Man Child,” not that song, but, you know, just Sabrina Carpenter in general.\nKeep watching for more!",
      "author": "Katie Cao",
      "published_date": "2025-06-18",
      "word_count": 402,
      "fetch_timestamp": "2025-08-20T16:07:26.613799",
      "metadata": {
        "char_count": 2397,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:07:26.613790"
      }
    },
    {
      "url": "https://www.billboard.com/video/olivia-rodrigo-sabrina-carpenter-gear-up-festival-season/",
      "source": "billboard",
      "artist_name": "Sabrina Carpenter",
      "title": "Olivia Rodrigo, Sabrina Carpenter, Kim Petras & More Gear Up for Festival Season | Billboard News",
      "content": "---\ntitle: Olivia Rodrigo, Sabrina Carpenter, Kim Petras & More Gear Up for Festival Season | Billboard News\nauthor: Katie Cao\nurl: https://www.billboard.com/video/olivia-rodrigo-sabrina-carpenter-gear-up-festival-season/\nhostname: billboard.com\ndescription: This summer is packed with festivals, and we're highlighting stars Olivia Rodrigo, Sabrina Carpenter and more, who will be bringing their hits!\nsitename: Billboard\ndate: 2025-06-05\ncategories: ['Videos']\ntags: ['BBAmazonPrime2025, Billboard, billboard news, genre pop, Partner Content']\n---\nThis is partner content.\nThis summer is packed with festivals, and we’re highlighting incredible stars such as Olivia Rodrigo, Sabrina Carpenter, Kim Petras and more, who will be bringing their hottest hits to the stage!\nTetris Kelly:\nThe festival season is far from over, and as we gear up for the rest of the year, we’re breaking down three massive outings that you should have your eye on, presented by Amazon Prime. It’s Pride Month and Pride is bringing icons only to Washington, D.C., June 6 and 7. You can catch Paris Hilton and Kim Petras, Troye Sivan and Miss Jennie from the block, Jennifer Lopez. At the same time over in New York City, Benson Boone will be flipping his way into the Governors Ball, with a lineup that also includes Tyler, the Creator and Olivia Rodrigo. Olivia is a darling of festival season, as she is also headlining Chicago’s Lollapalooza. Tyler is making his way there as well, and on July 31 to Aug. 3, they will be joined by Doechii, Gracie Abrams and Sabrina Carpenter.\nWe will be following all the festivals all year long, so keep it locked at Billboard.",
      "author": "Katie Cao",
      "published_date": "2025-06-05",
      "word_count": 258,
      "fetch_timestamp": "2025-08-20T16:07:26.683414",
      "metadata": {
        "char_count": 1642,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:07:26.683405"
      }
    }
  ],
  "total_articles": 8,
  "total_words": 4665,
  "extracted_at": "2025-08-20T16:07:26.683987",
  "urls_processed": [
    "https://www.billboard.com/music/music-news/sabrina-carpenter-family-dogs-cover-dogue-vogue-1236046970/",
    "https://www.billboard.com/culture/product-recommendations/best-sabrina-carpenter-merch-find-online-1235936498/",
    "https://www.billboard.com/music/awards/2025-vmas-first-performers-set-sabrina-carpenter-sombr-more-1236045774/",
    "https://www.billboard.com/music/music-news/sabrina-carpenter-plays-mans-best-friend-early-fans-1236045260/",
    "https://www.billboard.com/music/music-news/sabrina-carpenter-mans-best-friend-final-cover-bonus-song-1236039768/",
    "https://www.billboard.com/music/music-news/sabrina-carpenter-earth-wind-fire-lollapalooza-cameo-1236038148/",
    "https://www.billboard.com/video/liv-morgan-dominik-mysterio-summerslam-sabrina-carpenter/",
    "https://www.billboard.com/video/olivia-rodrigo-sabrina-carpenter-gear-up-festival-season/"
  ]
}