{
  "artist_name": "BTS",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/bts-be/",
      "source": "pitchfork",
      "artist_name": "BTS",
      "title": "BTS: Be",
      "content": "---\ntitle: BTS: Be\nauthor: Dani Blum\nurl: https://pitchfork.com/reviews/albums/bts-be/\nhostname: pitchfork.com\ndescription: Read Dani Blum’s review of the album.\nsitename: Pitchfork\ndate: 2020-12-05\n---\nYou have to at least want to root for BTS. The supergroup’s global dominance has been a rare constant in a year of upheaval, a pulse of pure joy through all this muck. There they are on The Late Late Show With James Corden, handing each other presents while crooning into their hand mics. There they are on TikTok, plopping a bouquet in a hand-lettered vase and offering it to their fans. BTS has broken so many records, at such a frantic pace, that any effort to tally them becomes almost instantly obsolete. Their new album, Be, devotes a full three-minute skit to celebrating the rise of “Dynamite,” their first all-English single, to the top of the Billboard charts. (“Don’t you think this is what happiness is like?” RM asks.) By the time the album itself was released, its first track had also reached the top of the U.S. charts, making BTS the first K-pop group ever to hit No. 1 on the Billboard 100.\nThat level of fame has not come without its costs. As a band—and a brand—that prizes authenticity, BTS haven’t shied away from addressing the tolls of megastardom and growing up in general. They’ve trained their pristine pop machine on sweeping philosophical ideas—the Jungian concept of the soul, a Herman Hesse bildungsroman—with varying degrees of success. On Be, the Bangtan Boys fixate instead on life in quarantine. In a year when profundity is woven into the mundane, when the rote tasks of getting through the day have taken on new intensity, BTS soften and shine.\n“The entire year got stolen,” Jimin croons in Korean on the shimmering “Fly to My Room,” before the group lilts about lying in bed with a bloated stomach, a pile of takeout containers, and the constant blare of a TV. Frustration and grief animate these songs, but it’s their simplicity and specificity that make them compelling. On “Blue & Grey,” Suga wonders if “that hazy shadow that swallows me up” classifies as anxiety or as depression. “I just want to be happier,” the group cries over delicate, bleeding strings, their voices whittled down to pleading rasps.\nThe record’s thematic center is “Life Goes On,” a flickering prayer for pushing past 2020. Artists have struggled with how to construct a record about self-isolation—Charli XCX opted for the glitch and quiver of How I’m Feeling Now, while Drake danced alone through his massive, frigid house. BTS pluck minutiae from the blur of days trapped inside: “On my pillow, on my table,” they sing, “life goes on.” In the past, BTS have used their songs as vehicles for feel-good messages (“I love, I love, I love myself! I know, I know, I know myself!” they shouted on Wings’ “Cypher 4”); here, they build hope in real time. Each gradual glimmer of layered vocals, every lush harmony that streams over the delicate backbeat, stitches together an intimacy. I kept the song on repeat while I churned through my daily tasks—I pruned my inbox, pushed a Swiffer across my floor. By the seventh or eighth play, I realized I’d been crying.",
      "author": "Dani Blum",
      "published_date": "2020-12-05",
      "word_count": 539,
      "fetch_timestamp": "2025-08-19T20:24:04.364335",
      "metadata": {
        "char_count": 3175,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T20:24:04.364326"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/bts-map-of-the-soul-7/",
      "source": "pitchfork",
      "artist_name": "BTS",
      "title": "BTS: Map of the Soul: 7",
      "content": "---\ntitle: BTS: Map of the Soul: 7\nauthor: Sheldon Pearce\nurl: https://pitchfork.com/reviews/albums/bts-map-of-the-soul-7/\nhostname: pitchfork.com\ndescription: The K-pop group’s latest is part memoir, part fan service, and part amateur psych eval. They can still tap into something enchanting, but the glimpses of personality here are fleeting.\nsitename: Pitchfork\ndate: 2020-02-25\n---\nThe BTS brand has never been stronger. The seven Bangtan Boys have already parlayed their massive fanbase into a merch and media empire that includes a Mattel toy collection, a mobile game, and a soundtrack doubling as a collaborative EP. Their new album, Map of the Soul: 7, is already a huge global hit. It sold two million copies in its first two hours in South Korea and is projected to do bigger first-week numbers stateside than Justin Bieber did. The shareholders are satiated. The Army is spoken for. The K-pop superstars have emerged as the product arm of a worldwide commercial apparatus that’d make the Svengalis behind turn-of-the-millenium teen-pop salivate.\nExcept the members of BTS maintain that there’s still a beating heart at the core of the machine. Authenticity is part of their appeal, and they use vaguely philosophical, Jungian blueprints to make music about being true to one’s self. 7, which follows (and includes much of) the 2019 mini-album Persona, is part memoir, part fan service, part amateur psych eval. Though the music is flattened enough to appeal to just about everyone, it can still tap into something enchanting, but the glimpses of personality are fleeting.\nThe “seven” in the title is an obvious reference to the number of members in the group and the number of years they’ve been performing together. Fittingly, the album is dedicated to their group arc and highlighting their individual journeys within. 7 is highly self-referential, with new songs sampling old songs and alluding to others dating back to their 2013 debut. It is tasked with doing a lot—not only chronicling the group’s path to this point but also unpacking the rest of their ambitious yet hard to parse concept: an exploration of the relationship between the persona and the shadow. There is some obvious overlap between the two: the negativity we unconsciously bear and its correspondence with the masks we all wear mirrors the dichotomy of managing a public face amid the looming private pressures of being a famous K-pop star.\nBecause the album repurposes Persona as a five-song preface, 7 really begins with the interlude “Shadow,” performed by Suga. “One message that penetrates the album as a whole is that you must face your inner shadow, but resist becoming submerged into its depths,” he explained during the album’s seemingly endless press junket. “Shadow” is supposed to set the tone for a more intense exploration of self from the Boys, together and individually, but it turns out to be the most thoughtful moment on an album that is unnecessarily drawn-out, jumbled, and uneven.",
      "author": "Sheldon Pearce",
      "published_date": "2020-02-25",
      "word_count": 482,
      "fetch_timestamp": "2025-08-19T20:24:04.436575",
      "metadata": {
        "char_count": 2988,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T20:24:04.436567"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/various-artists-bts-world-original-soundtrack/",
      "source": "pitchfork",
      "artist_name": "BTS",
      "title": "Various Artists: BTS World: Original Soundtrack",
      "content": "---\ntitle: Various Artists: BTS World: Original Soundtrack\nauthor: Joshua Minsoo Kim\nurl: https://pitchfork.com/reviews/albums/various-artists-bts-world-original-soundtrack/\nhostname: pitchfork.com\ndescription: The soundtrack to the superstar boy band’s mobile app game is the most inessential BTS-affiliated project to date.\nsitename: Pitchfork\ndate: 2019-07-04\n---\nEarly in the decade, Akon, Snoop Dogg, and Kanye West all featured on woefully misguided K-pop songs, emblematic of how K-pop collaborations with Western artists weren’t always well thought through. There’s been marked improvement in the past couple years, and BTS have been crucial in making these cross-continental pairings—like their songs with Steve Aoki, Nicki Minaj, and Halsey—feel more sensible. Ahead of BTS WORLD, the group released a new collaboration every week. Those tracks are the most noteworthy ones here by a considerable margin.\nDespite its title, BTS WORLD isn’t really a BTS album: It’s the soundtrack to a freemium mobile app game of the same name. Less than a third of the record’s 50-minute runtime is devoted to the boy band, and one would be hard-pressed to consider these four tracks among their best. Three collaborations only contain a few BTS members each, mixing and matching the group’s singers and rappers with suitable Western counterparts. While they aren’t as embarrassing as collaborations from K-pop’s yesteryear, they still fail to showcase the strengths of their respective artists.\nOn “Dream Glow,” Jin, Jimin, and Jungkook team up with Charli XCX for a diaphanous EDM song that’s in constant search of a satisfying climax. Its muted nature is intentional—the track is meant to serve as a mantra about following your dreams—but in the absence of any cathartic bombast, the vocal hook and lethargic production are a chore. At last, a song that embodies the tedious labor involved in reaching one’s goals.\nThe spacious and vaguely tropical “A Brand New Day,” featuring Zara Larsson, doesn’t fare much better. Producer Mura Masa throws in a daegeum—a Korean bamboo flute—but since it functions the same as any other flute loop we’ve heard in the past few years, it’s little more than a cute gesture. J-Hope’s shouted vocals are the only thing providing a semblance of personality. Juice WRLD exudes a fair amount of charm on “All Night,” ditching his lugubriousness for some slurred lines that pine for a girl. The relative sloppiness of his delivery proves a welcome contrast to RM and Suga’s prim rapping. Suga in particular is in prime form: He switches up his flow in meaningful ways, bringing to mind K-pop star Zico’s verse on “Oasis,” the very first time a Korean idol rapper adopted overtly ATL flows in a pop-rap single.",
      "author": "Joshua Minsoo Kim",
      "published_date": "2019-07-04",
      "word_count": 430,
      "fetch_timestamp": "2025-08-19T20:24:04.468793",
      "metadata": {
        "char_count": 2734,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T20:24:04.468786"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/bts-charli-xcx-dream-glow/",
      "source": "pitchfork",
      "artist_name": "BTS",
      "title": "BTS / Charli XCX: “Dream Glow”",
      "content": "---\ntitle: BTS / Charli XCX: “Dream Glow”\nauthor: Sheldon Pearce\nurl: https://pitchfork.com/reviews/tracks/bts-charli-xcx-dream-glow/\nhostname: pitchfork.com\ndescription: The song also promotes BTS’ new mobile game\nsitename: Pitchfork\ndate: 2019-06-07\n---\nIn 2017, Charli XCX joked that she was the newest member of BTS. It seemed feasible enough. She knows her way around a candy-coated melody, and she understands how to hit a musical bliss point. And she’s no stranger to the world of K-pop; earlier this year, she wrote a song for the twee idol group Twice, and boy-band cast-off turned Roc Nation rapper Jay Park closed Pop 2’s “Unlock It.” As if making good on a promise, Charli appears alongside BTS officially for “Dream Glow,” the first song from the BTS World soundtrack for a mobile game of the same name. There are few things more K-pop than using music as advertising for an app, but the song’s light bop is nearly pessimist-proof.\n“Dream Glow” repurposes a 2016 Charli XCX demo produced by StarGate, flipping an irradiant come-on into a twinkling reverie. Though billed to BTS, the song only features three of the group’s four singers—Jimin, Jin, and Jungkook—and none of its rappers. They don’t miss a beat, with Charli filling the vacant spaces to maintain their carefully arranged synchronicity. She beams through with re-recorded vocals and new lyrics, and the boys swirl around her. Their performances are like decorative icing carefully applied around the edges of a cake, layer within layer of lithe coos. They sing vaguely but assuredly, in English and Korean, about the yet-to-be-realized potential of dreams. It’s starry-eyed but not fanciful. “Dream Glow” forgoes the bubblegum pop neverland of their Halsey collab, “Boy With Luv,” for pristine EDM-lite delight. With Charli XCX as an honorary member, an undermanned BTS squad turn a forgotten leftover into a sweet lullaby for their ARMY idealists.",
      "author": "Sheldon Pearce",
      "published_date": "2019-06-07",
      "word_count": 306,
      "fetch_timestamp": "2025-08-19T20:24:04.500406",
      "metadata": {
        "char_count": 1924,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T20:24:04.500401"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/bts-map-of-the-soul-persona/",
      "source": "pitchfork",
      "artist_name": "BTS",
      "title": "BTS: MAP OF THE SOUL : PERSONA",
      "content": "---\ntitle: BTS: MAP OF THE SOUL : PERSONA\nauthor: Noah Yoo\nurl: https://pitchfork.com/reviews/albums/bts-map-of-the-soul-persona/\nhostname: pitchfork.com\ndescription: The biggest K-pop group in the world try to move their sound forward but spend too much time leaning on their past.\nsitename: Pitchfork\ndate: 2019-04-15\n---\nBTS are the superheroes of K-pop, a group of seven young South Korean men—RM, Jin, Suga, J-Hope, Jimin, V, and Jungkook—who have carried the boy-band torch into the global arena. Formed in 2013, BTS cut their teeth making rap-centric tracks at a time when hip-hop was just beginning to dominate the Korean music scene. Fans were quickly drawn to their musical self-sufficiency, socially conscious messaging, and the high-art references of their visuals. Last year, their studio album Love Yourself 轉 ‘Tear’ became the first Korean album to ever top the U.S. Billboard 200 chart, earning them a new level of acclaim rarely seen by “international” artists; the superheroes won the day.\nWith the seven-song MAP OF THE SOUL : PERSONA, BTS are trying to blaze a path forward, further securing their foothold in commercial pop while proving to diehards that they’re still high-minded outsiders who preface their music videos with Herman Hesse quotes and reference Carl Jung with the best of them. But the album suffers from sequel syndrome and suggests that the Bangtan Boys are too willing to lean on their past accomplishments. The arrangements on PERSONA are busy and convoluted, and many lyrical highlights are buried in meta, self-referential schlock rock.\nThe album is bookended with songs built around the kind of inelegant instrumentation you’d find in royalty-free music or internal corporate videos, with big guitars and drums that sound as if they’ve been airlifted in from a downloadable sampler pack. In the case of “Intro : Persona,” the production is built around a recycled beat from the opening track of BTS’ 2014 debut. But to a new listener lacking context, the song comes across as sour and stale, which is a shame considering bandleader RM waxes poetic about his imposter syndrome and recapturing his motivation to pursue music. Meanwhile, “Dionysus” moves from stadium-ready fuzz to a shoehorned trap section to a contrived breakdown, with the members sounding as if they’re being dragged along rather than leading with their voices. And yet this closing track contains the most fascinating lyrics of the whole project.\nLike Kendrick Lamar’s “Swimming Pools (Drank),” a meditation on alcoholism that was co-opted by hedonistic teens, “Dionysus” is a moment of existential introspection disguised as a party-starter. The bridge, rapped by Suga in an Auto-Tuned drawl a la Travis Scott, comments on the banality of stardom, as he applies the drinking metaphor to his desire to create lasting art. “Breaking new records means a fight with myself, raise the glass for a shot but I’m thirsty as I ever was,” he proclaims. The obnoxiousness of the production might be the whole point, but the song’s otherwise compelling concept is rendered largely inert by the grueling music that guides it.",
      "author": "Noah Yoo",
      "published_date": "2019-04-15",
      "word_count": 499,
      "fetch_timestamp": "2025-08-19T20:24:04.536538",
      "metadata": {
        "char_count": 3126,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T20:24:04.536533"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/bts-home/",
      "source": "pitchfork",
      "artist_name": "BTS",
      "title": "BTS: “HOME”",
      "content": "---\ntitle: BTS: “HOME”\nauthor: Joshua Minsoo Kim\nurl: https://pitchfork.com/reviews/tracks/bts-home/\nhostname: pitchfork.com\ndescription: The standout song comes from the K-pop group’s new album, MAP OF THE SOUL : PERSONA.\nsitename: Pitchfork\ndate: 2019-04-12\n---\nBTS’ new album, MAP OF THE SOUL : PERSONA, nabbed over 3 million pre-orders, and the music video for lead single “Boy With Luv” is on track to set world records for its already-impressive view count. Given all this success, one might assume that the group’s seven members are strangers to sadness. The album’s standout track, “HOME,” projects an image of carefree luxury. If you were to latch onto the song’s English lyrics, you’d be forgiven for thinking this is a track about flaunting wealth and reveling in one’s come-up. But despite this talk of “big cars” and “shin[ing] with flashin’ lights,” BTS find themselves unsatisfied. “The more I fill up the emptier I get/The more I’m with people the more I feel alone,” sings Jimin in the pre-chorus. Suddenly, the song’s glossy sheen feels like a facade.\nAs spokespersons for South Korea at large, BTS are undoubtedly faced with an insurmountable amount of pressure to represent their country with grace. Last year, BTS leader RM released a solo single that hinted at his conflicted feelings about such a position. That song, however, was outwardly melancholic—a huge contrast to the glimmering confidence that “HOME” seems to exude.\nIn a sense, “HOME” represents their current situation; while the majority of the world will find this to be a cozy R&B song, BTS harbor an unseen pain. They talk about wanting to spend time with a lover and how this person makes them feel rich—at home. By the end of the song, they’re in this lover’s presence, finding comfort at last. While BTS fans have looked to their socially conscious messages for hope and inspiration, the chart-topping K-pop group make clear that they need consolation from others too, that even though they are literally the biggest band in the world right now, they’re still human.",
      "author": "Joshua Minsoo Kim",
      "published_date": "2019-04-12",
      "word_count": 337,
      "fetch_timestamp": "2025-08-19T20:24:04.567869",
      "metadata": {
        "char_count": 2057,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T20:24:04.567864"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/bts-love-yourself-tear/",
      "source": "pitchfork",
      "artist_name": "BTS",
      "title": "BTS: Love Yourself 轉 ‘Tear’",
      "content": "---\ntitle: BTS: Love Yourself 轉 ‘Tear’\nauthor: Sheldon Pearce\nurl: https://pitchfork.com/reviews/albums/bts-love-yourself-tear/\nhostname: pitchfork.com\ndescription: The latest album from the masters of the K-pop formula is a slick, loosely thematic album about love and loss, with a stronger emphasis on rapping than ever before.\nsitename: Pitchfork\ndate: 2018-05-24\n---\nK-pop has long been poised for a breakthrough in the U.S., and the stars have aligned for the Korean boy band BTS. It doesn’t hurt that it is easier now than ever to be a K-pop fan on this side of the world, with the genre being tailor-made for our current algorithm-fed content chain. BTS has seized the opportunity, building a ravenous fanbase, not just at home and stateside but in South America and Europe as well. Bangtan Boys (their full name, Bangtan Sonyeondan, translates to “bulletproof boy scouts” in English), are designed for this moment, highly curated, aesthetically optimized for Western consumption.\nBTS have been presented as the art-house alternative to K-pop’s manic energy: a modish, dilettantish, act whose music is a vehicle for larger artistic choices and statements. After debuting as a swag rap outfit, they evolved from rap-sung mashups to posh electro-pop pageantry. The concept for their 2016 album, Wings, was inspired by Hermann Hesse’s 1919 book Demian. The visuals for one of the best BTS songs, “Blood Sweat & Tears,” were picturesque stills framed in a pop-up museum featuring “The Fall of the Rebel Angels,” Michelangelo’s “Pietà,” and Nietzsche quotes etched in stone, which all produced dramatic fan readings of the video’s symbolism. The members co-write and co-produce their songs, some of which delve into mental wellness and social responsibility, a process that has led many to dub their songs more “personal,” a word sometimes used as a dog whistle for music appealing to be taken more seriously. Their tactics have been emulated by boy bands who have followed, but in many ways, BTS are simply the K-pop model maximized for efficiency.\nLove Yourself: 轉 ‘Tear’, which follows the 2017 mini album Love Yourself: ‘Her’ and the Japanese full-length Face Yourself released earlier this year, is a kaleidoscopic mark of that efficiency, observing the finely tuned formula BTS have been perfecting since 2015. ‘Tear’, like ‘Her’, is a concept album of sorts. Roughly half the songs adhere to the album’s subhead. If ‘Her’ was an assortment of heart-professing love songs, then ‘Tear’ is the inverse. It deals primarily, though not exclusively, with the cycle of grief that lingers through a separation. But all of the songs generally find their way back around to self-love at some point. The album’s opener, “Intro: Singularity,” provides its thesis. “Even in my momentary dreams/The illusions that torture me are still the same,” V sings. “Did I lose myself, or did I gain you?”",
      "author": "Sheldon Pearce",
      "published_date": "2018-05-24",
      "word_count": 462,
      "fetch_timestamp": "2025-08-19T20:24:04.604400",
      "metadata": {
        "char_count": 2889,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T20:24:04.604392"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/12181-jai-paul-btstu-edit/",
      "source": "pitchfork",
      "artist_name": "BTS",
      "title": "Jai Paul: \"BTSTU (Edit)\"",
      "content": "---\ntitle: Jai Paul: \"BTSTU (Edit)\"\nauthor: Hari Ashurst\nurl: https://pitchfork.com/reviews/tracks/12181-jai-paul-btstu-edit/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2011-04-26\n---\nSinging, \"Don't fuck with me, don't fuck with me,\" in an angelic falsetto is a disarming way to start a debut song. But so begins \"BTSTU\", the first track released by UK singer-songwriter Jai Paul. By the time cascading synths emerge shortly thereafter, a slightly more robotic (and lower pitched) Paul sings, \"I know I've been gone a long time/ But I'm back and I want what is mine,\" and the song becomes a strange duet between two very different vocal approaches, both of which are laced with a hard-edge that betrays any implied sensitivity. The menacing delivery gives the song a twist and there's a hunger at its core, something also meted out in the restless quality of the beat.\nJai Paul's production is rich in idiosyncrasies, from muted blank spaces that appear out of nowhere-- almost like a DJ flicking a cross fader-- to short guitar accents on the offbeat, and even a layered saxophone part towards the end. On the surface \"BTSTU\" plays like an easy, confident three and a half minutes of pop music. The subtle character packed into that time gives it longevity-- the song first appeared on blogs over a year ago, and has since been re-mastered and issued by XL-- and shows off the kind of invention that lands a kid from Rayners Lane in London with a record contract in the first place.\n[from the BTSTU single; out now on XL]",
      "author": "Hari Ashurst",
      "published_date": "2011-04-26",
      "word_count": 257,
      "fetch_timestamp": "2025-08-19T20:24:04.635147",
      "metadata": {
        "char_count": 1530,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T20:24:04.635139"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "BTS",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-19\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nRap\nLet God Sort Em Out\nClipse\nBy\nAlphonse Pierre\nJuly 11, 2025\nElectronic\n/\nRap\nO Que as Mulheres Querem\nd.silvestre\nBy\nBenny Sun\nJuly 11, 2025\nRap\nEM0THUG\nMikeBrokeasf\nBy\nOlivier Lafontant\nJuly 11, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-19",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-19T20:24:05.122521",
      "metadata": {
        "char_count": 7685,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T20:24:05.122509"
      }
    }
  ],
  "total_articles": 9,
  "total_words": 4631,
  "extracted_at": "2025-08-19T20:24:05.122932",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/bts-be/",
    "https://pitchfork.com/reviews/albums/bts-map-of-the-soul-7/",
    "https://pitchfork.com/reviews/albums/various-artists-bts-world-original-soundtrack/",
    "https://pitchfork.com/reviews/tracks/bts-charli-xcx-dream-glow/",
    "https://pitchfork.com/reviews/albums/bts-map-of-the-soul-persona/",
    "https://pitchfork.com/reviews/tracks/bts-home/",
    "https://pitchfork.com/reviews/albums/bts-love-yourself-tear/",
    "https://pitchfork.com/reviews/tracks/12181-jai-paul-btstu-edit/",
    "https://pitchfork.com/reviews/albums/"
  ]
}