{
  "artist_name": "Paul McCartney",
  "source": "guardian",
  "articles": [
    {
      "url": "https://www.theguardian.com/music/2025/aug/19/paul-mccartney-beatles-elizabeth-alker-avant-garde-composers-john-cage-i-am-the-walrus",
      "source": "guardian",
      "artist_name": "Paul McCartney",
      "title": "‘The King Lear in I Am the Walrus? That came from John Cage’: Paul McCartney on the Beatles’ debt to great avant-garde composers",
      "content": "---\ntitle: ‘The King Lear in I Am the Walrus? That came from John Cage’: Paul McCartney on the Beatles’ debt to great avant-garde composers\nauthor: Elizabeth Alker; Guardian staff reporter\nurl: https://www.theguardian.com/music/2025/aug/19/paul-mccartney-beatles-elizabeth-alker-avant-garde-composers-john-cage-i-am-the-walrus\nhostname: theguardian.com\ndescription: In the mid-60s, the Beatles tuned in to the world’s most audacious experimental musicians. Paul McCartney reveals how many of the Fab Four’s ‘far-out’ masterpieces were inspired by their sonic breakthroughs\nsitename: The Guardian\ndate: 2025-08-19\ncategories: ['Music']\ntags: ['Paul McCartney,Classical music,Music,Culture,Books,Music books,Pop and rock,The Beatles,Psychedelia,Experimental music']\n---\nIt is a sunny October afternoon and I am sitting in a long wood-panelled hallway in an old converted townhouse in London waiting to be called into the office of Paul McCartney. I am dressed in my best clothes and trying not to let nerves get the better of me. I am here to ask him about an aspect of his career that is rarely discussed but which, I believe, helped cement his reputation as a world-conquering compositional force and which made the Beatles the most interesting and influential band of all time.\nIn the mid-1960s, as well as topping the charts, turning a generation of teenage girls hysterical and finding themselves the focus of obsessive media attention, the Beatles were also engaged with, and educating themselves about, the work of classical music’s most audacious and important composers.\nMcCartney watched the communist and free improviser Cornelius Cardew play the prepared piano at the Royal College of Art in London. He saw Karlheinz Stockhausen deliver an address about the development of synthesised sound. And he went to meet Delia Derbyshire (“She was in a shed at the bottom of her garden full of machines”) to ask if she wanted to write an electronic score for Yesterday. He attended a lecture by the Italian composer and electronic experimentalist Luciano Berio, who later arranged a series of songs by the Beatles for his first wife, the mezzo-soprano Cathy Berberian.\nThe Beatles, McCartney tells me, also took their cue from the 1956 piece Radio Music by John Cage for one of the band’s most famous songs: “Cage had a piece that started at one end of the radio’s range,” he says, “and he just turned the knob and went through to the end, scrolling randomly through all the stations. I brought that idea to I Am the Walrus. I said, ‘It’s got to be random.’ We ended up landing on some Shakespeare – King Lear. It was lovely having that spoken word at that moment. And that came from Cage.”\nOn a purple velvet sofa in his office, McCartney talks to me with the same irrepressible energy that has driven his contribution to music for more than 60 years. He also has a very endearing way of never assuming knowledge and very politely checks, for instance, that I know about his friend, John. “You know, John Lennon?” (I do.) And did I know the Beatles had “this song called Yesterday?” (I did). He seems delighted to talk less about his own achievements and more about the people who helped broaden his scope.\nTwo men who certainly did that were French composer-engineers Pierre Henry and Pierre Schaeffer who, in the late 1940s and early 1950s, pioneered a style of composition called musique concrète. Working in Parisian studios set up for propaganda broadcasts during the second world war, the pair used turntables and tape machines to forge an entirely original method of composing which, in line with French movements in art and philosophy at the time, sought to deconstruct established ideas and build from scratch a new means of making music.\nThis was iconoclasm driven by an erosion of trust in a ruling class that had led millions to their deaths during two brutal international conflicts. Schaeffer and Henry recorded natural or found sounds on to magnetic tape – the bark of a dog, the whistle or chugging of a train, a cackling voice – and then, using tape machines to slow down, speed up or reverse the original sound, they created collages of altered or “manipulated” recordings that are completely bewildering and mesmeric. Our ear is lured by that which is familiar and then unsettled by its abstraction. The suggestion is that all is not what it seems – the very essence of psychedelia.\n“Not everything we see is clear and figurative,” McCartney says to me, pointing to a Willem de Kooning painting next to us on the wall. “Sometimes when you’re asleep or you rub your eye, you see an abstract: your mind knows about it. We know about this stuff. It was the same with music. We were messing around, but our minds could still accept it because it was something that we already kind of knew anyway. Even though we were in another lane to more classical composers, we were kind of equal in that we also wanted freedom.”\nAfter buying a pair of his own Brenell tape machines, McCartney set about looping and spooling these ideas into the work he had to do for “his day job”. He describes the recording of Tomorrow Never Knows, “which was shaping up to be kind of a far-out Beatles song”. McCartney remembers carrying a plastic bag full of tape loops – on which he’d recorded various sounds at home – to Abbey Road during sessions for Revolver. “I set up the tape machines to create popping, whirring and dissolving sounds all mixed together. There could have been a guitar solo in it – straightforward or wacky – but when you put the tape loops in, they take it to another place because when they play, you get all these kind of happy accidents. They’re unpredictable and that suited that track. We used those tricks to get the effect we wanted.”\nThe result is a myriad of strange musical textures and meditative drones, a sonic vacuum into which all our troubling thoughts and feelings are swallowed up and disappear. It’s a big part of what made the Beatles as colourful as the recreational substances that were so popular at the time. It’s also the alchemical element in their work that helped put them in a different league, in terms of their legacy and influence.\nEventually John Lennon also procured a pair of Brenell machines and entered new realms of experimentalism. This produced the hypnotic track Revolution 9: “John was fascinated and he loved the craziness of it,” McCartney says. He, meanwhile, preferred to use these new studio gadgets “in a controlled way”, working within the pop-song format, cherrypicking interesting stylistic elements and twisting them into the Beatles’ established song-writing template.\nTogether the pair fashioned a new, intelligent and avant garde-informed kind of pop music – a reminder, as if we need it, of the magic of the Lennon-McCartney partnership. The push and pull of two genius creatives working together to upend the status quo. “You think, ‘Oh well our audience wants a pop song,’” McCartney says. “And then you might read about William Burroughs using the cut-up technique and you think, ‘Well, he had an audience, and his audience liked what he did.’ And eventually we decided that our audiences would come along with us, rather than it being down to us to feed them a conventional diet.”\nMy quest into the roots of this trippy magic in the Beatles’ music is just one of many explorations I made into the way the 20th century’s most innovative pop musicians borrowed from the classical avant garde, for my book Everything We Do Is Music. In it, I draw a line from John Cale’s drone in the Velvet Underground to the extraordinary Indian classical-inspired sounds in music by La Monte Young; and connect the blistering microtonality of Polish sonorism to the angst-ridden rock of Radiohead. The feminist philosophies of Pauline Oliveros formed a blueprint for techno, meanwhile, and US composers such as Edgard Varèse, John Cage, Steve Reich and Philip Glass found ways to reflect the energy and freneticism of the urban metropolis in their work. In each case, I found that artists on both sides of the pop/classical divide reached across it, disregarding those things that usually separate us – education, class, nationality, gender – to do something epochal.\nAt the end of our conversation, I ask McCartney if he ever felt restricted by the expectations of fans, or limited by his schooling and background. Actually, he says, he always felt a real sense of freedom to engage with the open-minded atmosphere of the time. This was largely thanks to his late wife Linda. “She used to say, ‘It’s allowed.’ And that lit up the skies for me. I’d think, ‘Yeah, it’s allowed.’”\nEverything We Do is Music by Elizabeth Alker (Faber & Faber, £20) is published on 28 August. To support the Guardian, order your copy at guardianbookshop.com. Delivery charges may apply.",
      "author": "Elizabeth Alker; Guardian staff reporter",
      "published_date": "2025-08-19",
      "word_count": 1471,
      "fetch_timestamp": "2025-08-20T15:39:57.051272",
      "metadata": {
        "char_count": 8825,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:39:57.051256",
        "access_status": "ok",
        "paywall": false
      }
    }
  ],
  "total_articles": 1,
  "total_words": 1471,
  "extracted_at": "2025-08-20T15:39:57.051568",
  "urls_processed": [
    "https://www.theguardian.com/music/2025/aug/19/paul-mccartney-beatles-elizabeth-alker-avant-garde-composers-john-cage-i-am-the-walrus"
  ]
}