{
  "artist_name": "Taylor Swift",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/taylor-swift-the-tortured-poets-department-the-anthology/",
      "source": "pitchfork",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift: The Tortured Poets Department / The Anthology",
      "content": "---\ntitle: Taylor Swift: The Tortured Poets Department / The Anthology\nauthor: Olivia Horn\nurl: https://pitchfork.com/reviews/albums/taylor-swift-the-tortured-poets-department-the-anthology/\nhostname: pitchfork.com\ndescription: Read Olivia Horn’s review of the album.\nsitename: Pitchfork\ndate: 2024-04-22\ntags: ['music']\n---\nTaylor Swift’s music was once much bigger than her. A born storyteller, she gathered up the emotional ephemera of her life and molded it into indelible songs about herself, but also about young women—about their sorrow, their desire, their wit and will. She was the girl next door with the platinum pen, her feelings worth hearing about not simply because they existed but because she turned them into art.\nThose days are gone. Swift, pumped up to mythical proportions by discursive oxygen, is bigger than her body of work—no knock against her body of work. She is her own pantheon: a tragic hero and a vindicated villain; an inadvertent antitrust crusader and a one-woman stimulus package; an alleged climate criminal and fixer; The Person of the Year of the Girl. Over the past 13 months, she’s strapped on her spangled bodysuit and performed a Herculean feat three nights a week on the highest-grossing tour of all time, earning her vaunted billion-dollar valuation. Her musical achievements are remarkable. But nobody makes a billion dollars from music alone.\nThe Tortured Poets Department, Swift’s 11th studio album, senses that widening gap between Taylor Swift the artist and Taylor Swift the phenomenon, and wants to fill it with a firehose of material. The burden of expectation is substantial: This is Swift’s first body of new work since the end of a years-long relationship and a pair of high-profile, whirlwind romances—one of which, with the 1975’s Matty Healy, appears to have provided much of the inspiration here. Fans came to Tortured Poets seeking emotional catharsis, or at least the salacious details. Swift, it seems, wanted the comfort of familiarity. Returning to Jack Antonoff and the National’s Aaron Dessner, her primary songwriting and producing partners of the last several years, Swift picks up threads from Folk-more and Midnights without quite pulling anything loose.\nTortured Poets’ extended Anthology edition runs over two hours, and even in the abridged version, its sense of sprawl creeps down to the song level, where Swift’s writing is, at best, playfully unbridled and, at worst, conspicuously wanting for an editor. The winking title track—a joke about its subjects’ self-seriousness—makes fun of the performance of creative labor, which is funny, given the show that Swift is putting on herself. She piles the metaphors on thick, throws stuff at the wall even after something has stuck, picks up the things that didn’t stick and uses them anyway.",
      "author": "Olivia Horn",
      "published_date": "2024-04-22",
      "word_count": 436,
      "fetch_timestamp": "2025-08-19T10:49:49.697386",
      "metadata": {
        "char_count": 2812,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T10:49:49.697348"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/taylor-swift-karma-ft-ice-spice/",
      "source": "pitchfork",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift: “Karma” [ft. Ice Spice]",
      "content": "---\ntitle: Taylor Swift: “Karma” [ft. Ice Spice]\nauthor: Shaad D’Souza\nurl: https://pitchfork.com/reviews/tracks/taylor-swift-karma-ft-ice-spice/\nhostname: pitchfork.com\ndescription: The Bronx rapper forges ahead on the path to superstardom with a big-ticket collaboration that feels strangely utilitarian.\nsitename: Pitchfork\ndate: 2023-05-26\n---\nBack in January, before she had even released her debut EP, Ice Spice was thinking about pop dominance. “I do want to be a mainstream artist,” she told The New York Times. “I want diamond records and plaques and Grammys. So I think in order to get that, you do have to surpass just one subgenre.” A scant five months later, the Bronx rapper has netted two top five hits and a handful of plaques for the wall, forging ahead on an avowedly traditionalist path to superstardom, which includes pledging fealty to pop’s old guard.\nNow, she’s landed one of pop’s ultimate co-signs: a collaboration with Taylor Swift. Her remix of the Midnights track “Karma” is not Swift’s best rap collaboration (that would be Reputation’s “End Game,” featuring Future) nor is it the most interesting song she released today (that would be “Hits Different”). Like a lot of pop-rap collaborations, the “Karma” remix feels strangely utilitarian, a feat of marketing and pop diplomacy. Ice Spice’s verse lacks the rat-a-tat velocity of her starmaking turn on PinkPantheress’ “Boy’s a Liar, Pt. 2”—“Karma is your check’s boutta bounce/Karma is the fire in your house,” she raps—and the clash of sensibilities dulls a little of the original’s over-the-top, high-camp shine. But, at the end of the day, the “Karma” remix will likely be Ice Spice’s first No. 1 hit, marking the exact moment that she ascended to pop’s A-list—and that “opps” entered your mom’s vocabulary.",
      "author": "Shaad D’Souza",
      "published_date": "2023-05-26",
      "word_count": 281,
      "fetch_timestamp": "2025-08-19T10:49:49.740850",
      "metadata": {
        "char_count": 1790,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T10:49:49.740832"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/the-pitchfork-review-podcast-tackles-taylor-swifts-midnights/",
      "source": "pitchfork",
      "artist_name": "Taylor Swift",
      "title": "The Pitchfork Review Podcast Tackles Taylor Swift’s Midnights",
      "content": "---\ntitle: The Pitchfork Review Podcast Tackles Taylor Swift’s Midnights\nauthor: Pitchfork\nurl: https://pitchfork.com/features/podcast/the-pitchfork-review-podcast-tackles-taylor-swifts-midnights/\nhostname: pitchfork.com\ndescription: Our critics discuss the highs, lows, surprises, and disappointments of the pop superstar’s latest album.\nsitename: Pitchfork\ndate: 2022-10-27\ncategories: ['features']\n---\nCo-hosted by Editor-in-Chief Puja Patel and Reviews Editor Jeremy D. Larson, and featuring guest critics and contributors, our weekly podcast includes in-depth analysis of the new albums we find extraordinary, exciting, and just plain terrible. This week, Senior Editor Anna Gaca and Staff Writer Quinn Moreland drop by to fill us in on everything you need to know about Taylor Swift’s 10th album, Midnights: the lyrical themes, the musical hits and misses, and, yes, the chaotic surprises.\nListen to this week’s episode below, and subscribe to The Pitchfork Review here. You can also check out an excerpt of the podcast’s transcript below.\nPuja Patel: I want to talk a little bit about the sound of this album. I think that it felt like a cohesive project, which everyone was applauding, but also something that felt very kind of reflective and referential and pointedly looking back. Like, what were you hearing on this album that felt like, “Oh yeah, this was Taylor in her Lover era, her Reputation era?” You know?\nAnna Gaca: You maybe would expect this album to feel like an evolution of the Folklore period, but to me, it feels almost like a time warp where we're zooming back to like 2019 and even 2017, with Reputation and sort of revisiting those sounds. But, like, as if you were asleep while you were doing it– because it is so much more muted and the hooks are not as big and there's certainly nothing as loud or as high contrast as the songs on Reputation. It feels much more subdued. I mean, a classic Taylor aesthetic is that, like, old Polaroid photo kind of sound to it. Where there's a little bit of a halo on it because it maybe wasn't totally developed.\nQuinn Moreland: From the album cover with her blue eyeshadow and the lighter, I thought maybe she'd be trying to go for this more like, quote unquote, indie sound.\nPatel: Indie sleaze. It's back.\nMoreland: Yeah. I was a little concerned, like, uh oh, where are we going with this? The things that kept coming up for me–it's so weird to even call these potential influences because they are her contemporaries, essentially– but I couldn't help but think back to Lorde's Pure Heroine, Take Care by Drake, even the early Weeknd albums. Maybe a little minimalist, but heavier, rumbling, production that really allowed the vocalist’s voice to come to the forefront. It reminded me a little bit of Purity Ring. Which made me wonder if Taylor Swift watches Search Party because then she cast John Early in her video for “Anti-Hero.”\nPatel: [Laughs] Yeah.\nMoreland: But it seemed like a lot of those influences were really standing out to me. That she was more interested in, like, this mood. How do you convey an emotion or a feeling through the production in a more subdued way than she has in the past? Or a more electronic way?\nGaca: The ultimate Drake aesthetic of just, “I'm home alone. It’s late at night. And the house is really, really, really, really big.” [Laughter]",
      "author": "Pitchfork",
      "published_date": "2022-10-27",
      "word_count": 554,
      "fetch_timestamp": "2025-08-19T10:49:49.770141",
      "metadata": {
        "char_count": 3348,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-19T10:49:49.770130"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/taylor-swift-love-story-taylors-version/",
      "source": "pitchfork",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift: “Love Story (Taylor’s Version)”",
      "content": "---\ntitle: Taylor Swift: “Love Story (Taylor’s Version)”\nauthor: Vrinda Jagota\nurl: https://pitchfork.com/reviews/tracks/taylor-swift-love-story-taylors-version/\nhostname: pitchfork.com\ndescription: A superstar songwriter launches an ambitious project to recreate her discography note-for-note.\nsitename: Pitchfork\ndate: 2021-02-12\n---\nIn the summer of 2019, Taylor Swift took to Tumblr to announce that her former record label, Big Machine, had sold her masters to a company backed by music exec Scooter Braun. As a songwriter, Swift still held her publishing rights, but without influence over the masters, she’d lost a measure of control, like the ability to choose when her recordings could be used in film or advertising. But she wasn’t going down without a fight—she was going to re-record her entire discography, and this time, she’d own the masters. The news sparked countless questions: Would she reimagine older songs, as she had in the past? Where would she start? How would she release the music? After making its debut in a dating app commercial starring Ryan Reynolds, the very first re-recorded song, Swift’s 2008 hit “Love Story,” is here.\nThis new recording largely remains faithful to the original, as if determined to make Braun’s masters obsolete. Aside from minor changes—the production is slightly more restrained, and Swift’s mature vocals are subtler, with no trace of country twang—it’s hard to tell the difference. This is the kind of endeavor that a detail-oriented person like Swift excels at: She employed the same fiddle player and backup singer from the original record, reunited the members of her touring band from the time, and doubled down on her lucky number 13. (It has been 13 years since the release of the original Fearless, while the new version’s announcement date and release date each add up to 13.) If most mortal millennials tried to recreate our teenage creative endeavors, we would be sharing Twilight fan fiction or painfully awkward YouTube dance videos. It speaks to Taylor’s wunderkind status that she can revisit the work of her teen self without embarrassment.\nSwift is also invested in reinvention, and her last few albums are almost antithetical to who she was on Fearless. She now sings about love with skepticism and remove; she drinks wine and alludes to sex; she delves into self-doubt and takes accountability for selfishness. But before that, she was a brash teenage girl unafraid of the intensity of her romantic desire, and though “Love Story” isn’t her best song, it illustrates her imaginative power (she wrote it, she’s said, before she had any “knowledge of what love was”). There is something wonderfully audacious about a teen girl rewriting the most famous Shakespearean tragedy as, well, a love story. Now, years later, “Love Story” becomes another type of performance: an adult woman’s display of ownership and agency.",
      "author": "Vrinda Jagota",
      "published_date": "2021-02-12",
      "word_count": 456,
      "fetch_timestamp": "2025-08-19T10:49:49.814068",
      "metadata": {
        "char_count": 2891,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T10:49:49.814054"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/taylor-swift-loves-indie-too/",
      "source": "pitchfork",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift Loves Indie, Too",
      "content": "---\ntitle: Taylor Swift Loves Indie, Too\nauthor: Pitchfork\nurl: https://pitchfork.com/features/podcast/taylor-swift-loves-indie-too/\nhostname: pitchfork.com\ndescription: A discussion of Taylor Swift’s new album, folklore, on the latest episode of our new podcast The Pitchfork Review.\nsitename: Pitchfork\ndate: 2020-07-31\ncategories: ['features']\ntags: ['podcast']\n---\nLast week, Taylor Swift surprised her fans with the announcement of the imminent release of a new 16-track album, entitled folklore. The National’s Aaron Dessner co-wrote or co-produced 11 of the songs, and it also features collaborations with Bon Iver and Jack Antonoff. “Most of the things I had planned this summer didn’t end up happening, but there is something I hadn’t planned on that DID happen,” Taylor’s announcement said of the making of the album. At its best, folklore reinforces something that has been true throughout Swift’s career: her biggest strength is her storytelling. On this week’s episode, Pitchfork Editor Puja Patel is joined by Senior Editor Jillian Mapes and Associate Editor Anna Gaca to discuss everything Taylor Swift—and her most recent release.\nListen to this week’s episode below, and subscribe to The Pitchfork Review for free on Apple Podcasts, Spotify, Spotify, Stitcher, or wherever you listen to podcasts. You can also check out an excerpt of the podcast’s transcript below.\nFor more about Taylor Swift and folklore, check out Jill’s review and Sam Sodomsky’s takeaways from the album. Also, Aaron Dessner sat down with Sam to talk about his work on the album—read the interview here.\nPuja Patel: So let’s dig into folklore. Swift is definitely growing up, she’s here to be an independent woman and to state her case, but she also is apologizing for the first time and feels kind of self-aware in a different way. Jill, what song signifies that kind of growth to you?\nJillian Mapes: “the last great american dynasty” is, I think, one of the best Taylor songs ever. Musically, it’s really good. You really can see it play out. And I think a lot of Taylor Swift’s best songs are like that. You can imagine it, she’s picking up on little bits of very classic American imagery.\nWe’re talking about Rebekah Harkness, who married into the Standard Oil family, who was a reviled woman, a “mad woman.” They wanted to drive her out of Rhode Island, apparently. And [Swift] is going at the end, “And I bought her house! And now that’s me!” So yeah, I like it!\nAnna Gaca: Yeah, it’s great. Especially since it has an actual, literal direct tie-in to the house that she owns. It’s like, I don’t know, a Dave Eggers book or something, where it’s a little bit fictional, and then the first-person walks into the room. Just really, really clever set-up and works really well.\nSomething I really liked, Jill, that you said in your review, is that it sounds like a National song, too. And I hear that in kind of the way the little swells of piano and synth go. You can hear that sort of backline of the song, you can hear that happening in a National song.\nJM: Oh yeah, I do love that. It’s really a nice base for all of these interesting images she’s bringing up. It’s subtle because you don’t realize the work it’s doing. Or at least I don’t, I’m so focused on, like, “Rebekah’s on the train, and she’s looking towards her saltbox house!”\nAG: She’s making fun of herself, too. Like when she says, “Oh, there’s only so much new money can buy.” Certainly Taylor Swift is somebody who’s been criticized for maybe throwing sort of gauche parties that look really expensive. And yeah, she can own that.",
      "author": "Pitchfork",
      "published_date": "2020-07-31",
      "word_count": 606,
      "fetch_timestamp": "2025-08-19T10:49:49.836432",
      "metadata": {
        "char_count": 3590,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-19T10:49:49.836424"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/taylor-swift-folklore/",
      "source": "pitchfork",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift: Folklore",
      "content": "---\ntitle: Taylor Swift: Folklore\nauthor: Jill Mapes\nurl: https://pitchfork.com/reviews/albums/taylor-swift-folklore/\nhostname: pitchfork.com\ndescription: Made from afar, primarily with the National’s Aaron Dessner, Swift’s eighth album is a sweater-weather record filled with cinematic love songs and rich fictional details.\nsitename: Pitchfork\ndate: 2020-07-27\n---\nThe phantom pang of missing someone before you ever meet them is an emotion worthy of its own word. That fated feeling of love and the passage of time is the theme that runs between Carly Rae Jepsen’s smash hit “Call Me Maybe” and the National’s antisocial romance “Slow Show”; it’s also the kind of thing Taylor Swift might write about. One of the loveliest tracks on Folklore, the surprise album the singer-songwriter made primarily with the National’s guitarist, Aaron Dessner, stands out for a strangely similar reason: a thread connecting two strangers that exists long before either realizes it’s there. “And isn’t it just so pretty to think/All along there was some/Invisible string/Tying you to me,” she sings on the delightfully plucky “Invisible String,” simultaneously recalling famous lines from Jane Eyre and The Sun Also Rises.\nFolklore will forever be known as Taylor Swift’s “indie” album, a sweater-weather record released on a whim in the blue heat of this lonely summer, filled with cinematic love songs in search of a film soundtrack. There are those who already dislike Folklore on principle, who assume it’s another calculated attempt on Swift’s part to position her career as just so (how dare she); meanwhile, fans will hold it up as tangible proof that their leader can do just about anything (also a stretch). While it’s true that Folklore pushes the limits of Swift’s sound in a particular, perhaps unexpected direction, her reference points feel more like mainstream “indie” homage than innovation, taking cues from her collaborators’ work and bits of nostalgia.\nAt its best, Folklore asserts something that has been true from the start of Swift’s career: Her biggest strength is her storytelling, her well-honed songwriting craft meeting the vivid whimsy of her imagination; the music these stories are set to is subject to change, so long as it can be rooted in these traditions. You can tell that this is what drives Swift by the way she molds her songs: cramming specific details into curious cadences, bending the lines to her will. It’s especially apparent on Folklore, where the production—mostly by Dessner, with Jack Antonoff’s pop flair occasionally in the mix—is more minimal than she typically goes for. Her words rise above the sparse pianos, moody guitars, and sweeping orchestration, as quotable as ever.\nAfter years as pop’s most reliable first-person essayist, Swift channels her distinct style into what are essentially works of fiction and autofiction, finding compelling protagonists in a rebellious heiress and a classic teenage love triangle. In “The Last Great American Dynasty,” she tells the story of eccentric debutante Rebekah Harkness, who married into the Standard Oil family and once lived in Swift’s Rhode Island mansion, as a way to celebrate women who “have a marvelous time ruining everything.” Filled with historical details and Americana imagery, you can see the song play out in your mind like a storybook, but it also effectively makes a point about society’s treatment of brash women. Swift cleverly draws a line between Harkness and herself at the end, an idea she fleshes out in a more literal sequel, “Mad Woman.” Out of all the songs on Folklore, “The Last Great American Dynasty” is the all-timer, the instant classic. It sounds like the latter-day National/Taylor mashup you never knew you needed—textural and tastefully majestic, with Fitzgerald-esque lines about filling the pool with champagne instead of drinking all the wine.",
      "author": "Jill Mapes",
      "published_date": "2020-07-27",
      "word_count": 609,
      "fetch_timestamp": "2025-08-19T10:49:49.882330",
      "metadata": {
        "char_count": 3870,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T10:49:49.882315"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/taylor-swift-betty/",
      "source": "pitchfork",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift: “Betty”",
      "content": "---\ntitle: Taylor Swift: “Betty”\nauthor: Vrinda Jagota\nurl: https://pitchfork.com/reviews/tracks/taylor-swift-betty/\nhostname: pitchfork.com\ndescription: A story of fraught young love showcases the maturity and nuance of Swift’s adult songwriting.\nsitename: Pitchfork\ndate: 2020-07-24\n---\n“Betty” has the markings of an early Taylor Swift anthem: plucky guitar and harmonica, vivid storytelling, a dramatic shift from the conditional (“If I just showed up at your party/Would you have me?”) to the present tense (“I showed up at your party/Will you have me?)” at the song’s climax. But Folklore, Swift’s surprise new album, isn’t like anything she’s made before. The narratives she’s offered about what love looks and feels like are crumbling. Feelings and memories are expansive and obscured here, as if seen through a snow globe. Swift’s usual poignant indignation is replaced with a more mundane sadness, an understanding that joy is inevitably interwoven with melancholy, love with loss.\n“Betty,” a story of fraught young love, showcases the maturity and nuance that Swift has gained since she was a teenager herself. In the past, she has sung about regretting a breakup and unfairly blowing fights out of proportion. But “Betty” is the rare truly apologetic Swift song. It takes place in the height of the action, just after the narrator—referred to in passing as James but speculated to be a woman—has cheated on their high school sweetheart. This is a song about sitting with what you did, wondering if it is too late to fix it, and then stumbling, sloppily, towards accountability.\nIn typical Swift fashion, the songs and narratives on Folklore weave together. References to a porch and a cardigan at the end of “Betty” echo the imagery in “Cardigan,” which seems to tell the same story from Betty’s perspective. The narrator of “Betty” searches for absolution in their naivety: “I’m only 17/I don’t know anything.” But recalling the same incident on “Cardigan,” Betty speaks with insight, suggesting that youth does not always make one so clueless: “I knew everything when I was young/I knew I’d curse you for the longest time.” By pairing the two songs together, Swift asks us to question our allegiances to any one narrator. She empathizes with the difficulty of apologizing even while she criticizes those who are oblivious to their power to hurt. Swift used to write as her own main character, a protagonist on a quest for a knight in shining armor. But on Folklore, we see her disavow heroes and fairytales—and, implicitly, the heteronormative ideals they instill—for the more complicated daily work of acknowledging your own shortcomings and trying to heal.",
      "author": "Vrinda Jagota",
      "published_date": "2020-07-24",
      "word_count": 427,
      "fetch_timestamp": "2025-08-19T10:49:49.925876",
      "metadata": {
        "char_count": 2672,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T10:49:49.925860"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/taylor-swift-lover/",
      "source": "pitchfork",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift: Lover",
      "content": "---\ntitle: Taylor Swift: Lover\nauthor: Anna Gaca\nurl: https://pitchfork.com/reviews/albums/taylor-swift-lover/\nhostname: pitchfork.com\ndescription: On her seventh album, Taylor Swift is a little wiser and a lot more in love. Though uneven, Lover is a bright, fun album with great emotional honesty.\nsitename: Pitchfork\ndate: 2019-08-26\n---\nThe theme of Taylor Swift’s Lover is right there in the title. These 18 songs are odes to the things she loves most and knows best: her boyfriend and her mom, the West Village and the West End, and, always and forever on a Taylor Swift album, being in love. It’s an exuberant celebration of the challenges of maintaining a relationship through seasons and across continents, of telling the truth and saying sorry. Swift has always mined her personal life for opaque fables of love and retribution; she memorializes a romance’s fleeting details, wraps them in bows, and ferries them to an audience eager to receive her gifts. She writes about a life that’s strengthened, not broken, by heartbreak. Lover is the suggestion that the right person, the right song, might lift heartbreak from your life, too. The concept is, as she claims early on, both “overdramatic and true.”\nLover nods to 2017’s Reputation, but, in spirit, it’s the sequel to the synth-pop glitter of 1989. Produced mostly with ubiquitous pop whisperer Jack Antonoff, it’s full of low-lying synthesizer pulses and reverbed beats that can feel more like scaffolding than full songs. Sometimes it attempts to honor Swift’s entire artistic journey at once: The waltzing “Lover,” full of fiddle and fairytale weddings, harks back to the Old Taylor; “I Think He Knows” is a thumping electro-pop shout-out to Nashville’s Music Row. She uses the word “shade” twice, up from once on Reputation. She’s 29, but she still writes metaphors about prom dresses and homecoming queens. It’s bright and fun and occasionally cloying.\nLover’s emotional peaks and valleys are higher and deeper than reputation, where romance played out under a long shadow of doubt. Opener “I Forgot That You Existed” is a hopscotch rhythm set to a rhyme like you’d leave in your nemesis’ yearbook if you were really being honest—which is to say, it doesn’t sound like she forgot for one second. It comes off as throat-clearing, but it opens a stretch of drama-free delights, like the magnetic pink glow of “Cruel Summer” (“I don’t want to keep secrets just to keep you!”) and the crystal-ball clarity of “The Archer,” with its elegant, Chromatics-esque synthesizer build and self-aware regret: “I cut off my nose just to spite my face/And I hate my reflection for years and years.” The exception is undercooked gender-equality anthem “The Man,” a song that hilariously, unironically points to Leonardo DiCaprio’s playboy image as the height of masculine privilege, and proves that other people shouldn’t write Kesha songs.",
      "author": "Anna Gaca",
      "published_date": "2019-08-26",
      "word_count": 467,
      "fetch_timestamp": "2025-08-19T10:49:49.972254",
      "metadata": {
        "char_count": 2891,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T10:49:49.972242"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/taylor-swift-speak-now/",
      "source": "pitchfork",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift: Speak Now",
      "content": "---\ntitle: Taylor Swift: Speak Now\nauthor: Sam Sodomsky\nurl: https://pitchfork.com/reviews/albums/taylor-swift-speak-now/\nhostname: pitchfork.com\ndescription: Swift’s third album is her most unabashedly transitional work: between childhood and adulthood, innocence and understanding, country and pop.\nsitename: Pitchfork\ndate: 2019-08-19\n---\nAfter two hit records, Taylor Swift decided that her third would be longer and more personal, and she would write it entirely by herself, no co-writers. The songs would concern major events in her life, many of which occurred in the public eye. The lyrics would take the form of letters, direct addresses, one-on-one conversations where she always got the last word. She wanted to use her newfound wisdom to reflect on her parents, her dreams, and how it felt to stand on stage and notice a bigger crowd every night, shouting the words back at her. The working title was Enchanted, though she didn’t always feel that way. After 2008’s massively successful Fearless, Swift wrestled with her outsider persona and sudden celebrity, and the dissonance weighed heavily on her relationships. But she was learning fast.\nSwift was 20 when the album, eventually titled Speak Now, came out and sold over a million copies in its first week—a record high in 2010. She had, and would continue to have, bigger hits, but these songs were breakthroughs in their own right. Co-produced by Nathan Chapman, the album is patiently sequenced; the average song length is just under five minutes, giving Swift enough time to pace her hooks—which had never been bigger—and her lyrics, which had never sounded more careful or wise. It’s an album focused on growing up, something she was learning would often be confusing, sad, and uncomfortable. It’s her most unabashedly transitional work: between adolescence and adulthood, innocence and understanding, country and pop. She was at a crossroads, and she was feeling lucky.\nSwift had already become known for her intimate and intense relationship with fans. On these songs, she took a more authoritative role. There’s “Sparks Fly,” an early song that developed a big reputation after a live acoustic version circulated online. It appears here with all its fireworks and rain-soaked drama, a call to arms for people who’d been following since the beginning. There’s also “Never Grow Up,” a quiet acoustic ballad that draws the clearest line to her old material. Only now, Swift is wistful and sentimental, sounding far older than her years as she urges girls younger than her to savor every moment: “I just realized everything I have is someday gonna be gone,” she sings softly. It’s a heavy thought for a young songwriter, and the key word is just. As in, this is all happening right now, and if I don’t document it, it may disappear.",
      "author": "Sam Sodomsky",
      "published_date": "2019-08-19",
      "word_count": 451,
      "fetch_timestamp": "2025-08-19T10:49:50.020980",
      "metadata": {
        "char_count": 2801,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T10:49:50.020967"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/taylor-swift-red/",
      "source": "pitchfork",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift: Red",
      "content": "---\ntitle: Taylor Swift: Red\nauthor: Ivy Nelson\nurl: https://pitchfork.com/reviews/albums/taylor-swift-red/\nhostname: pitchfork.com\ndescription: The spectacular Red transformed pop and country music around it. It remains the pinnacle of Taylor Swift’s career, an intimate album of disappearances and lost relationships.\nsitename: Pitchfork\ndate: 2019-08-19\n---\nIn early 2012, Taylor Swift turned in 20 songs to her label for what would become her fourth album, Red. They were all further outgrowths of the pop-country sound she had mastered in her early years, as a teenager finding her voice in the Nashville scene, trying on songs like “Tim McGraw” to reflect the starlight over Georgia and the allure and disappointment of romantic love through a lens that was unmistakably hers. As she amassed a body of work for Red, she was still writing songs about love and its fugitive presence, songs about relationships that swelled like an obsessive thought, songs that picked up and enhanced the smallest pixels of intimate detail as if they were scanning security footage in a crime procedural. When she strummed a chord, it shimmered and just hung there. It sounded like Swift, an organic progression from her previous records.\nLooking at the albums that followed Red, it’s obvious Swift longed for the inorganic, to send her songs through the distortions of modern pop and see what kind of genetically-scrambled horror would come back. You can hear it immediately in the first song she wrote in collaboration with pop gurus Max Martin and Shellback, “We Are Never Ever Getting Back Together”—a mutation is happening. A chord thrums from an acoustic guitar which then turns inside out as it plays, as if caught in the neck of a vacuum. It didn’t sound like the old Taylor Swift, the one who wrote 20 new Taylor Swift songs for a new Taylor Swift album. It sounded like a new version of her, being fitfully born.\nSwift was trying to push her music outside of its traditional boundaries, to stray into the interzone between pop and country. Pop was just beginning to mingle its DNA with EDM; dubstep, a once varied and relatively new branch of dance music, had been reduced to the stomach-flip of the drop just as its popularity in America crested. Martin and Shellback were aware of these shifts in pop’s geography; they incorporated many of them into Femme Fatale, the Britney Spears album from the previous year. One of the other Swift/Martin/Shellback collaborations on Red, “I Knew You Were Trouble,” starts as a pop-rock song but its edges mimic the queasy wobble of dubstep. Synths scream behind Swift’s voice like mechanical saws. It was as if she had finally found a musical backdrop sharp as her lyrics—the lakes and backroads of Tennessee and Georgia disappear, replaced with formations of jagged crystal, a perfect environment for a song about falling in love with someone you know will hurt you and leave you feeling empty as a canyon.",
      "author": "Ivy Nelson",
      "published_date": "2019-08-19",
      "word_count": 487,
      "fetch_timestamp": "2025-08-19T10:49:50.074063",
      "metadata": {
        "char_count": 2944,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-19T10:49:50.074054"
      }
    }
  ],
  "total_articles": 10,
  "total_words": 4774,
  "extracted_at": "2025-08-19T10:49:50.074596",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/taylor-swift-the-tortured-poets-department-the-anthology/",
    "https://pitchfork.com/reviews/tracks/taylor-swift-karma-ft-ice-spice/",
    "https://pitchfork.com/features/podcast/the-pitchfork-review-podcast-tackles-taylor-swifts-midnights/",
    "https://pitchfork.com/reviews/tracks/taylor-swift-love-story-taylors-version/",
    "https://pitchfork.com/features/podcast/taylor-swift-loves-indie-too/",
    "https://pitchfork.com/reviews/albums/taylor-swift-folklore/",
    "https://pitchfork.com/reviews/tracks/taylor-swift-betty/",
    "https://pitchfork.com/reviews/albums/taylor-swift-lover/",
    "https://pitchfork.com/reviews/albums/taylor-swift-speak-now/",
    "https://pitchfork.com/reviews/albums/taylor-swift-red/"
  ]
}