{
  "artist_name": "Gene Simmons",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/media/podcasts/gene-simmons-touring-solo-saving-money-behind-the-setlist-podcast-1235854583/",
      "source": "billboard",
      "artist_name": "Gene Simmons",
      "title": "Gene Simmons Is Touring Solo, Traveling Light and Making Lots of Money",
      "content": "---\ntitle: Gene Simmons Is Touring Solo, Traveling Light and Making Lots of Money\nauthor: Glenn Peoples\nurl: https://www.billboard.com/media/podcasts/gene-simmons-touring-solo-saving-money-behind-the-setlist-podcast-1235854583/\nhostname: billboard.com\ndescription: Gene Simmons describes his experiences touring solo, and details how he and his band save money while on the road. Listen to Behind the Setlist.\nsitename: Billboard\ndate: 2024-12-12\ncategories: ['Podcasts']\ntags: ['Podcasts, Touring']\n---\nGene Simmons spent decades traveling the world as the fire-breathing bass player for KISS, taking with him the large road crews required for massive — and expensive — productions on some of music’s biggest stages. Since KISS’s final show in December 2023, Simmons has been traveling considerably lighter as the frontman for the Gene Simmons Band, playing KISS favorites, some rarely heard Simmons solo tunes and familiar classics by the likes of Van Halen and Motorhead.\nSimmons says he has stripped down the tour to the essential elements — the musicians — and pockets more money from a Gene Simmons Band show than he netted as a member of KISS. “The local promoters provide the back line, and we just get up there and play,” Simmons tells Billboard’s Behind the Setlist podcast. That’s a sharp contrast to the complex — and expensive — production required to take KISS on the road.\nTrending on Billboard\nAs a solo artist playing festivals and theaters, Simmons has “no managers, no private jets, no 20 tractor trailers, no 60-man crew, no huge shows — and the pyro alone for every [KISS] show is ten grand, sometimes 50 [thousand dollars] if you go outdoors,” he explains. “Enormous, enormous costs for doing that.”\nSimmons is “proud” to have performed those massive productions, but the Gene Simmons Band tour isn’t trying to replicate the KISS stage show. “It’s almost as if you decided to rent some amps in a garage and plug in,” he says, “and then everybody from the neighborhood comes in … It’s very informal and a lot of fun.”\nOutside of the four band members, the band takes two additional people on the road, says guitarist Brent Woods, who manages the travel and concert production details: an assistant who helps with business duties and Simmons’ security, and one crew member for the musicians. As for equipment, Woods says the band — which also includes guitarist Jason Walker and drummer Brian Tichy — takes only its guitars and pedal boards, and Tichy may take his own snare drum on the upcoming tour. Otherwise, everything is rented. “It does save a lot of money,” says Woods. “And then in turn, everybody benefits, right? The band included. Everybody makes more money.”\nThe stripped-down traveling arrangement wouldn’t work with a larger group of people, Woods admits. Nor would it work if Simmons wasn’t comfortable riding in a splitter van and going without rock star trappings. “But Gene’s so easygoing,” says Woods. “He’s just so relaxed and he’s low maintenance. He doesn’t need a lot. He’s not the quintessential rock star that has to have a certain room or a suite that’s on this floor far away from the elevator. He just is not that way.”\nSimmons readily admits he didn’t pioneer this approach to touring. “It used to be done by black musicians on the Chitlin’ Circuit, what used to be the black clubs, because they couldn’t play white clubs,” he said. Rock pioneer Chuck Berry took it a step further, touring only with his guitar and arriving in each city with a local band that had learned and rehearsed his songs. (Bruce Springsteen once played in Berry’s backing band for a concert in 1973.) “Now, I don’t do that,” said Simmons. “I take my band with me, but Berry would show up and would, you know, he’d tell the guys, ‘Study the records, learn these songs, I’m going to show up,’ and no rehearsal, nothing.”\nTo Woods, the Gene Simmons Band’s do-it-yourself touring approach is simply a longer version of the “weekend warrior” touring artist. “Bands go out Thursday, Friday, Saturday, and they play two, three shows. It’s the same thing. They’re flying to the destination, the back line’s there for them.”\nExtending the weekend warrior approach into longer tours requires the knowledge Woods gained from decades as a traveling musician for decades, first as a member of the group Wildside and more recently as a member of Sebastian Bach’s band. “I’ve learned since the 90s,” he says, “when I started going out and touring. And you kind of learn by a lot of mistakes and your own mistakes and other people’s mistakes, and you finally figure it out.” Woods’ time on the road has also allowed him to built a network of professionals he can call to work at his shows in different cities. “It’s hard for younger bands to do that because they don’t know a lot of people,” he says.\nListen to the entire interview with Gene Simmons in the embedded Spotify playlist or go to Spotify, Apple Podcasts, iHeart, Amazon Music, Podbean or Everand.\nNote: An earlier version of this article incorrectly said guitarist Zach Throne was a member of the Gene Simmons Band.",
      "author": "Glenn Peoples",
      "published_date": "2024-12-12",
      "word_count": 848,
      "fetch_timestamp": "2025-08-20T18:19:42.959059",
      "metadata": {
        "char_count": 5086,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T18:19:42.959034"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/kiss-gene-simmons-slammed-x-creepy-sexist-comments-dancing-with-the-stars-1235796882/",
      "source": "billboard",
      "artist_name": "Gene Simmons",
      "title": "KISS’ Gene Simmons Slammed on X For ‘Creepy’ Comments During ‘Dancing With the Stars’ Guest Judge Stint on Hair Metal Night",
      "content": "---\ntitle: KISS’ Gene Simmons Slammed on X For ‘Creepy’ Comments During ‘Dancing With the Stars’ Guest Judge Stint on Hair Metal Night\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/music-news/kiss-gene-simmons-slammed-x-creepy-sexist-comments-dancing-with-the-stars-1235796882/\nhostname: billboard.com\ndescription: KISS' Gene Simmons slammed by X users for comments dubbed 'creepy' and sexist on Tuesday's (Oct. 8) 'Dancing With the Stars' hair metal night.\nsitename: Billboard\ndate: 2024-10-09\ncategories: ['Music News']\ntags: ['Music News, nsfs, rock, tv']\n---\nRetired KISS bassist/singer Gene Simmons is known for unapologetically wagging his legendarily long tongue and for his self-described reputation as a lusty Lothario. But during a guest judging stint on Tuesday night’s (Oct. 8) “Hair Metal Night” on Dancing With the Stars some commenters thought he went too far by focusing on pulchritude instead of Paso doble.\nFirst, Simmons reportedly got a loud round of boos on air after he gave a bewigged Reginald VelJohnson (Family Matters, Die Hard) a lowly score of 5 for his stiff cha cha to Twisted Sister’s “I Wanna Rock.” According to EW, the studio audience did not take kindly to fellow permanent judges Derek Hough and Bruno Tonioli posting the same score — Carrie Ann Inaba gave them a more magnanimous 6 — but when Simmons followed suit, the boos reportedly got significantly louder.\nThe low score came after Simmons had previously been generous to the fellow septuagenarian, saying before the dance, “Hey Reggie, you’ve got a beautiful woman right beside you who can twist it and turn it and knows how to move it and all that. But I want to tell you, as a guy that’s been on the stage for half a century around the world, I’m kind of a big deal, Reggie. It’s all in the attitude. And you’ve got something in that beautiful face. They love you.”\nVelJohnson — who was eliminated on Tuesday night — had had consistently low scores so far this season, but EW said Inaba noted that he’d been a season 33 fan favorite as he hoofed alongside such fellow stars as previous eliminees con artist Anna Delvey, actors Eric Roberts and Tori Spelling, as well as still-active contestants Olympic gymnast Stephen Nedoroscik, NFL player Danny Amendola, NBA center Dwight Howard, Olympic rugby star Ilona Maher, model Brooks Nader and Bachelorette star Jenn Tran, among others.\nSimmons was repeatedly called out by viewers in comments on X for what they dubbed his “creepy” remarks, which some said treated the female dancers as if they were in a beauty pageant. The pointed to Simmons saying he couldn’t decide which one was more “hot hot hot” among Amendola and pro dancer Witney Carson and telling 24-year-old actress Chandler Kinney (Pretty Little Liars) that she “fogged up my glasses” and that she “moved me — not just with your gyrations, but with your beautiful face.”\n“ABC needs to issue an apology after having Gene Simmons on there and subjecting their cast to that . Why didn’t a producer tell him to knock it off,” wrote one X user, while another joked, “Gene Simmons comments about the ladies are giving the energy of the gross uncle who corners you at the reunion.” A similar comment read, “it’s only the first dance and i’m already over gene simmons being a creep,” as one added, “Gene Simmons is seriously sucking all the energy out of the ballroom with his creepy comments about the female dancers.”\nWell known for speaking his mind on all manner of subjects, Forbes noted that Simmons has been called out before for his thoughts on the opposite sex, including over a passage in his 2017 book, On Power: My Journey Through the Corridors of Power and How You Can Get More Power, in which he wrote that leveraging sexuality is still the fastest route to the top for women.\n“Women have a choice,” he said in an interview with the New York Post while promoting the book in 2017. “They can dress in potato sacks, [but] as soon as they pretty themselves up with lipstick, lift and separate them and point them in our general direction, they’re gonna get a response. Guys are jackasses — we will buy them mansions and houses . . . all because of sex.” In that same interview, Simmons told women to “get over” their biological urges, opining, “It’s natural to want to have kids, but, sorry, you can’t have it both ways. You have to commit to either career or family. It’s very difficult to have both.”\nKISS said that after five decades on tour their End of the Road Tour — which wrapped in December — would be their last go-round. The group then sold its name, image and likeness rights and announced a virtual Las Vegas performance set to launch in 2027.\nWatch VelJohnson’s routine and see some of the comments about Simmons below.",
      "author": "Gil Kaufman",
      "published_date": "2024-10-09",
      "word_count": 804,
      "fetch_timestamp": "2025-08-20T18:19:43.025478",
      "metadata": {
        "char_count": 4752,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:19:43.025468"
      }
    },
    {
      "url": "https://www.billboard.com/artist/gene-simmons/chart-history/hsi",
      "source": "billboard",
      "artist_name": "Gene Simmons",
      "title": "Gene Simmons | Biography, Music & News | Billboard",
      "content": "---\ntitle: Gene Simmons | Biography, Music & News | Billboard\nauthor: Wp-Block-Co-Authors-Plus-Coauthors Is-Layout-Flow\nurl: https://www.billboard.com/artist/gene-simmons/\nhostname: billboard.com\ndescription: Explore Gene Simmons' music on Billboard. Get the latest news, biography, and updates on the artist.\nsitename: Billboard\ndate: 2025-08-14\n---\n×\nSkip to main content\nOpen menu\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nBillboard\nBillboard\nCharts\nMusic\nVideo\nShop\nAwards\nBusiness\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nAccount\nManage Account\nLog Out\nAccount\nLOGIN\nLogin\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nOpen menu\nBillboard\nCharts\nMusic\nVideo\nShop\nAwards\nBusiness\nLOGIN\nLogin\nAccount\nManage Account\nLog Out\nAccount\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nBillboard Hot 100™\nBillboard 200™\nGlobal 200\nArtist 100\nOpen menu\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nBillboard\nBillboard\nCharts\nMusic\nVideo\nShop\nAwards\nBusiness\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nAccount\nManage Account\nLog Out\nAccount\nLOGIN\nLogin\nSearch\nClick to Expand Search Input\nPlus Icon\nClick to Close Search Input\nAll Charts\nClose the menu\nTop Charts\nExpand top-charts menu\nBillboard Hot 100™\nBillboard 200™\nBillboard Artist 100\nEmerging Artists\nStreaming Songs\nRadio Songs\nDigital Song Sales\nTop Album Sales\nTop Streaming Albums\nIndependent Albums\nVinyl Albums\nIndie Store Album Sales\nGlobal\nExpand global menu\nBillboard Global 200\nBillboard Global Excl. U.S.\nAfrobeats\nExpand afrobeats menu\nBillboard U.S. Afrobeats Songs\nHits of the World\nExpand hits-of-the-world menu\nBillboard Arabic Hot 100\nBillboard Arabic Artist 100\nBillboard Argentina Hot 100\nBillboard Brasil Hot 100\nBillboard Canadian Hot 100\nBillboard Canadian Albums\nBillboard Italy Hot 100\nBillboard Italy Albums Top 100\nBillboard Japan Hot 100\nBillboard Philippines Hot 100\nBillboard Philippines Top Philippine Songs\nBillboard Thailand Top Thai Songs\nBillboard Thailand Top Thai Country Songs\nBillboard Vietnam Hot 100\nBillboard Vietnam Top Vietnamese Songs\nThe Official U.K. Singles Chart\nThe Official U.K. Albums Chart\nAustralia Songs\nAustralia Albums\nAustria Songs\nBelgium Songs\nBolivia Songs\nChile Songs\nChina TME UNI Chart\nCroatia Songs\nCzech Republic Songs\nDenmark Songs\nEcuador Songs\nFinland Songs\nFrance Songs\nGermany Songs\nGermany Albums\nGreece Songs\nGreece Albums\nHong Kong Songs\nHungary Songs\nIceland Songs\nIndia Songs\nIndonesia Songs\nIreland Songs\nLuxembourg Songs\nMalaysia Songs\nMexico Songs\nNetherlands Songs\nNew Zealand Songs\nNorway Songs\nPeru Songs\nPoland Songs\nPortugal Songs\nRomania Songs\nSingapore Songs\nSlovakia Songs\nSouth Africa Songs\nSpain Songs\nSweden Songs\nSwitzerland Songs\nTaiwan Songs\nTurkey Songs\nU.K. Songs\nGreatest of All Time\nExpand greatest-of-all-time menu\nGreatest of All Time Artists\nGreatest of All Time Hot 100 Songs\nGreatest of All Time Hot 100 Artists\nGreatest of All Time Billboard 200 Albums\nGreatest of All Time Billboard 200 Artists\nTop Artists of the 21st Century\nTop Hot 100 Songs of the 21st Century\nTop Billboard 200 Albums of the 21st Century\nTop Women Artists of the 21st Century\nGreatest of All Time Hot 100 Women Artists\nGreatest of All Time Hot 100 Songs by Women\nGreatest of All Time Billboard 200 Women Artists\nGreatest of All Time Billboard 200 Albums by Women\nGreatest of All Time Songs of the '80s\nGreatest of All Time Songs of the '90s\nGreatest of All Time Holiday 100 Songs\nGreatest of All Time Top Holiday Albums\nGreatest of All Time Songs of the Summer\nGreatest of All Time Hot 100 No. 2 Hits\nGreatest of All Time Pop Songs Artists\nGreatest of All Time Pop Songs\nGreatest of All Time Adult Contemporary Artists\nGreatest of All Time Adult Contemporary Songs\nGreatest of All Time Adult Pop Songs Artists\nGreatest of All Time Adult Pop Songs\nGreatest of All Time Top Country Artists\nGreatest of All Time Hot Country Songs\nGreatest of All Time Top Country Albums\nTop Country Artists of the 21st Century\nTop Hot Country Songs of the 21st Century\nTop Country Albums of the 21st Century\nGreatest of All Time Top R&B/Hip-Hop Artists\nGreatest of All Time Hot R&B/Hip-Hop Songs\nGreatest of All Time Top R&B/Hip-Hop Albums\nGreatest of All Time Alternative Artists\nGreatest of All Time Alternative Songs\nGreatest of All Time Adult Alternative Artists\nGreatest of All Time Adult Alternative Songs\nGreatest of All Time Mainstream Rock Artists\nGreatest of All Time Mainstream Rock Songs\nGreatest of All Time Latin Artists\nGreatest of All Time Hot Latin Songs Artists\nGreatest of All Time Hot Latin Songs\nGreatest of All Time Top Dance Club Artists\nPop\nExpand pop menu\nPop Airplay\nAdult Contemporary\nAdult Pop Airplay\nCountry\nExpand country menu\nHot Country Songs\nTop Country Albums\nCountry Streaming Songs\nCountry Airplay\nCountry Digital Song Sales\nBluegrass Albums\nAmericana/Folk Albums\nRock & Alternative\nExpand rock-alternative menu\nHot Rock & Alternative Songs\nTop Rock & Alternative Albums\nRock & Alternative Airplay\nHot Rock Songs\nTop Rock Albums\nRock Streaming Songs\nRock Digital Song Sales\nHot Alternative Songs\nTop Alternative Albums\nAlternative Streaming Songs\nAlternative Airplay\nAlternative Digital Song Sales\nHot Hard Rock Songs\nTop Hard Rock Albums\nHard Rock Streaming Songs\nHard Rock Digital Song Sales\nAdult Alternative Airplay\nMainstream Rock Airplay\nR&B/Hip-Hop\nExpand rb-hip-hop menu\nHot R&B/Hip-Hop Songs\nTop R&B/Hip-Hop Albums\nR&B/Hip-Hop Streaming Songs\nR&B/Hip-Hop Airplay\nR&B/Hip-Hop Digital Song Sales\nHot R&B Songs\nTop R&B Albums\nR&B Streaming Songs\nR&B Digital Song Sales\nHot Rap Songs\nTop Rap Albums\nRap Streaming Songs\nRap Airplay\nRap Digital Song Sales\nMainstream R&B/Hip-Hop Airplay\nAdult R&B Airplay\nRhythmic Airplay\nLatin\nExpand latin menu\nHot Latin Songs\nTop Latin Albums\nLatin Airplay\nLatin Streaming Songs\nLatin Digital Song Sales\nHot Regional Mexican Songs\nTop Regional Mexican Albums\nRegional Mexican Airplay\nHot Latin Pop Songs\nTop Latin Pop Albums\nLatin Pop Airplay\nHot Tropical Songs\nTop Tropical Albums\nTropical Airplay\nHot Latin Rhythm Songs\nTop Latin Rhythm Albums\nLatin Rhythm Airplay\nDance\nExpand dance menu\nHot Dance/Electronic Songs\nHot Dance/Pop Songs\nTop Dance Albums\nDance Streaming Songs\nDance Digital Song Sales\nDance/Mix Show Airplay\nChristian\nExpand christian menu\nHot Christian Songs\nTop Christian Albums\nChristian Streaming Songs\nChristian Airplay\nChristian Digital Song Sales\nChristian AC Airplay\nGospel\nExpand gospel menu\nHot Gospel Songs\nTop Gospel Albums\nGospel Streaming Songs\nGospel Airplay\nGospel Digital Song Sales\nSongwriters & Producers\nExpand songwriters-producers menu\nHot 100 Songwriters\nHot 100 Producers\nCountry Songwriters\nCountry Producers\nRock & Alternative Songwriters\nRock & Alternative Producers\nRock Songwriters\nRock Producers\nAlternative Songwriters\nAlternative Producers\nHard Rock Songwriters\nHard Rock Producers\nR&B/Hip-Hop Songwriters\nR&B/Hip-Hop Producers\nR&B Songwriters\nR&B Producers\nRap Songwriters\nRap Producers\nLatin Songwriters\nLatin Producers\nDance/Electronic Songwriters\nDance/Electronic Producers\nDance/Pop Songwriters\nDance/Pop Producers\nChristian Songwriters\nChristian Producers\nGospel Songwriters\nGospel Producers\nClassical\nExpand classical menu\nClassical Albums\nClassical Crossover Albums\nTraditional Classical Albums\nJazz\nExpand jazz menu\nJazz Albums\nContemporary Jazz Albums\nTraditional Jazz Albums\nSmooth Jazz Airplay\nWorld\nExpand world menu\nWorld Albums\nWorld Digital Song Sales\nHoliday\nExpand holiday menu\nHoliday 100\nTop Holiday Albums\nHoliday Streaming Songs\nHoliday Airplay\nHoliday Digital Song Sales\nHoliday 100 Songwriters\nHoliday 100 Producers\nSummer\nExpand summer menu\nSongs of the Summer\nStage & Screen\nExpand stage-screen menu\nCast Albums\nSoundtracks\nAdditional Genres\nExpand additional-genres menu\nBlues Albums\nComedy Albums\nKid Albums\nNew Age Albums\nReggae Albums\nAdditional Charts\nExpand additional-charts menu\nBubbling Under Hot 100\nTop Current Album Sales\nCatalog Albums\nCompilation Albums\nLyricFind U.S.\nLyricFind Global\nExplore\nGene Simmons\nBillboard Hot 100™\n0\nNo. 1 Hits\n1\nSongs\n0\nTop 10 Hits\nBillboard Hot 100™\nBillboard Hot 100™\nBillboard 200™\nTop Album Sales\nTop Current Album Sales\nDebut Date\nPeak Pos.\nPeak Date\nWks. on Chart\nRadioactive\nGene Simmons\n12/02/78\n47\n12 Wks\n1/13/79\n8\nBrowse\nLatest News\nAwards\nKISS Members Who Once Referred to Donald Trump As a ‘True Danger to Democracy’ React to Kennedy Center Honor: ‘Deeply Honored’\n8/14/25\nGil Kaufman\nVideo Icon\nMusic News\nWatch Gene Simmons Hilariously Take Over a Los Angeles Weather Report & Deliver a Chaotic Forecast\n3/14/25\nHannah Dailey\nMusic News\nGene Simmons Is Letting Fans Become His Roadie for a Day\n3/10/25\nTyler Jenke\nPodcasts\nGene Simmons Is Touring Solo, Traveling Light and Making Lots of Money\n12/12/24\nGlenn Peoples\nTech\nHow Megadeth Pioneered the First Artist Website 30 Years Ago This Month\n10/31/24\nSteve Knopper\nPro\nMusic News\nKISS’ Gene Simmons Slammed on X For ‘Creepy’ Comments During ‘Dancing With the Stars’ Guest Judge Stint on Hair Metal Night\n10/9/24\nGil Kaufman\nAwards\n2024 Rock & Roll Hall of Fame Inductees to Be Revealed Live on ‘American Idol’\n4/15/24\nPaul Grein\nPop\nGene Simmons Totally Approves of JoJo Siwa’s KISS-Inspired Red Carpet Outfit: ‘She Looks Cool’\n4/4/24\nGil Kaufman\nMusic News\nBoy George, Sharon Osbourne, Gene Simmons & More Sign Letter Rejecting Attempt to Bar Israel From 2024 Eurovision Song Contest\n2/14/24\nGil Kaufman\nRock\nKiss Announces ‘New Era’ With Digital Avatars Following Final Concert in New York\n12/3/23\nMitchell Peters\nRead More\nLogin\nLogin\nAccount\nManage Account\nLog Out\nClose the menu\nCharts\nExpand charts menu\nAll Charts\nBillboard Hot 100™\nBillboard 200™\nGlobal 200\nHits Of The World™\nChart Beat\nSongs Of The Summer\nYear-End Charts\nDecade-End Charts\nMusic\nExpand music menu\nMusic News\nPop\nR&B/Hip-Hop\nLatin\nRock\nAwards\nChart Beat\nConcerts\nFeatures\nReviews\nVideos\nExpand videos menu\nCulture\nExpand culture menu\nEvents\nLifestyle\nPolitics\nTV/Film\nMedia\nExpand media menu\nLists\nPhotos\nPodcasts\nVideos\nBusiness\nExpand business menu\nBusiness News\nLegal\nTouring\nPublishing\nRadio\nRecord Labels\nView All Pro\nPro Tools\nExpand pro-tools menu\nSongwriters & Producers\nSong Index\nArtist Index\nRoyalty Calculator\nMarket Watch\nIndustry Events Calendar\nBillboard Español\nExpand billboard-espanol menu\nNoticias\nMúsica\nNegocios\nCultura y Entretenimiento\nSwitching Stages\nExpand switching-stages menu\nGET ACCESS TODAY\nad",
      "author": "Wp-Block-Co-Authors-Plus-Coauthors Is-Layout-Flow",
      "published_date": "2025-08-14",
      "word_count": 1606,
      "fetch_timestamp": "2025-08-20T18:19:43.450944",
      "metadata": {
        "char_count": 10540,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T18:19:43.450930"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/kiss-gene-simmons-los-angeles-weather-report-1235922217/",
      "source": "billboard",
      "artist_name": "Gene Simmons",
      "title": "Watch Gene Simmons Hilariously Take Over a Los Angeles Weather Report & Deliver a Chaotic Forecast",
      "content": "---\ntitle: Watch Gene Simmons Hilariously Take Over a Los Angeles Weather Report & Deliver a Chaotic Forecast\nauthor: Hannah Dailey\nurl: https://www.billboard.com/music/music-news/kiss-gene-simmons-los-angeles-weather-report-1235922217/\nhostname: billboard.com\ndescription: KISS' Gene Simmons delivered Los Angeles' weather report, taking over meteorologist Adam Krueger's broadcast. Watch the hilarious video.\nsitename: Billboard\ndate: 2025-03-14\ncategories: ['Music News']\ntags: ['genre rock, Music News, TV / Film']\n---\nGene Simmons can rock n’ roll all night and deliver the weather forecast the next day. On Thursday (March 13), the KISS frontman hilariously took over Los Angeles meteorologist Adam Krueger’s weekend report on Fox 11 — and it was truly chaotic from start to finish.\nWearing a denim shirt, sunglasses and a black cap, Simmons began by asserting he knows “quite a lot” about weather. He also landed a backhanded compliment toward Krueger — “You look much better in real life than you do on TV” — before pointing out regions on a map of Southern California and nonchalantly reading off the weather patterns crossing through.\nAt one point, Simmons pushed Krueger away so as not to block the graphics behind them before reading out the warm temperatures local viewers would experience over the next few days. Krueger then went in for a play on KISS’ Billboard Hot 100 hit “Rock and Roll All Nite,” saying, “This weekend, I’m thinking, it’s looking pretty good. If people want to rock and roll all night …?”\nTrending on Billboard\n“They should party every day,” Simmons finished.\nAnother hilarious moment came when Krueger tried to signify the end of the segment by giving the rock star a fist bump, prompting Simmons to ask, “Are you kicking me out?”\n“You don’t have the thing in my ear where they’re saying wrap, so I gotta wrap,” Krueger responded, leading Simmons to start freestyling some bars.\n“Rap? ‘You go to 7-Eleven/ Go to heaven …,” Simmons spit, doing a little dance.\nAfter the broadcast, Krueger shared some behind the scenes photos with the rock legend on Instagram and wrote, “Do weather with @genesimmons” along with a checkmark emoji.\nKrueger is known for creating viral weather moments by incorporating popular music into his presentations. Last year, he turned heads by using lyrics from Kendrick Lamar’s “Not Like Us” while delivering a Houston forecast, telling viewers, “If you wanna pass on this heat like John Stockton, you can go into the Northwest where there’s 60s and 70s for highs today.”\n“So again, we got temperatures in the 90s, but it’s going to feel hotter for several days … Wop, wop, wop, wop!” he continued at the time. “This is not a major cold front. In fact, the general rule this time of year if it’s June and we’re talking about a cold front, it’s probably a minor.“\nKrueger’s has also recently paid homage to Doechii, Tyler, the Creator and Travis Scott.\nSimmons has also previously tried his hand at meteorology. In September, he joined KTLA 5 Morning News and hilariously pushed resident weatherman Henry DiCarlo aside to take over that week’s weather report.\nWatch Simmons make his weather report above.",
      "author": "Hannah Dailey",
      "published_date": "2025-03-14",
      "word_count": 513,
      "fetch_timestamp": "2025-08-20T18:19:43.505840",
      "metadata": {
        "char_count": 3165,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:19:43.505830"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/gene-simmons-fans-roadie-for-a-day-1235918623/",
      "source": "billboard",
      "artist_name": "Gene Simmons",
      "title": "Gene Simmons Is Letting Fans Become His Roadie for a Day",
      "content": "---\ntitle: Gene Simmons Is Letting Fans Become His Roadie for a Day\nauthor: Tyler Jenke\nurl: https://www.billboard.com/music/music-news/gene-simmons-fans-roadie-for-a-day-1235918623/\nhostname: billboard.com\ndescription: Fans can purchase the opportunity to work backstage on Gene Simmons' upcoming tour, though it doesn't come cheap.\nsitename: Billboard\ndate: 2025-03-10\ncategories: ['Music News']\ntags: ['Damageplan, Dimebag Darrell Abbott, gene simmons, genre rock, kiss, Pantera, Vinnie Paul Abbott']\n---\nLegendary KISS bassist Gene Simmons is giving fans the chance to live out their dreams of rock stardom by letting them be his roadie for a day – but it comes with a hefty price tag.\nIn 2024, Gene Simmons explained to Billboard that he was saving money on tour by traveling light. “There’s no managers, no private jets, no 20 tractor trailers, no 60-man crew, no huge shows,” he explained, revealing he makes more money now than as a member of KISS. “The local promoters provide the back line, and we just get up there and play,” he adds.\nIn fact, the whole production is a bit of a skeleton crew. Alongside Simmons, the crew also features drummer Brian Tichy, and guitarists Jason Walker and Brent Woods, with the latter also managing travel and concert production details. Only two others are on the road, including an assistant who helps with business duties and Simmons’ security, and one crew member for the musicians.\nTrending on Billboard\nNow, Simmons has launched a rather compelling way of saving money while expanding his crew, and it all involves allowing fans to pay for the privilege.\nAs the Gene Simmons Band prepares to hit the road again in April, the eponymous rocker has launched a handful of Experiences which fans can purchase ahead of the upcoming dates. One of them is the Gene Simmons Bass Experience, which allows you (and three guests) the chance to meet Simmons after the stage.\nAlongside the ability to take photos and videos (and the potential to “find that Gene Simmons is very down-to-earth, funny, and knowledgeable on almost any subject”), purchases will also be able to take home one of Simmons’ bass guitars, which can be signed and personalized. In addition to the original ticket price, this experience costs $6,500 for a “non stage played” instrument, and $12,500 for an instrument that Simmons has previously played on stage.\nThe other of these experiences (dubbed ‘The Ultimate Gene Simmons Experience’) allows the purchaser to become “Simmons’ personal assistant & band roadie for the day.”\nAlongside a handful of merch benefits (a crew shirt and hat, a VIP laminate, and a signed setlist), it provides the opportunity to help with load-in at the venue, stage set-up, and the ability to sit in on sound check and hang out backstage. Meanwhile, photo opportunities are plentiful, Simmons will join the purchaser for a meal, and then will introduce the lucky roadie during the show.\nThis package costs a total of $12,495 (in addition to the original ticket price), and also includes a bass guitar that had been used by Simmons during a KISS rehearsal. Only one experience per concert is available, with 26 dates currently scheduled across North America between April and August.\nThough some may balk at such a high price for the opportunity to work on Simmons’ tour, it’s far from the most unique offering that the musician and his bandmates have put on the market. Back in 2001, the Kiss Kasket was introduced, giving fans the chance to take their fandom into the afterlife. Though no longer for sale, the item was however used by a number of individuals, including Pantera and Damageplan members “Dimebag” Darrell Abbott and his brother Vinnie Paul Abbott.\n“This is the ultimate KISS collectible,” Simmons said at the time. “I love livin’, but this makes the alternative look pretty damn good.”",
      "author": "Tyler Jenke",
      "published_date": "2025-03-10",
      "word_count": 628,
      "fetch_timestamp": "2025-08-20T18:19:43.561035",
      "metadata": {
        "char_count": 3841,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:19:43.561028"
      }
    },
    {
      "url": "https://www.billboard.com/music/pop/gene-simmons-approves-jojo-siwa-kiss-inspired-red-carpet-outfit-1235649088/",
      "source": "billboard",
      "artist_name": "Gene Simmons",
      "title": "Gene Simmons Totally Approves of JoJo Siwa’s KISS-Inspired Red Carpet Outfit: ‘She Looks Cool’",
      "content": "---\ntitle: Gene Simmons Totally Approves of JoJo Siwa’s KISS-Inspired Red Carpet Outfit: ‘She Looks Cool’\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/pop/gene-simmons-approves-jojo-siwa-kiss-inspired-red-carpet-outfit-1235649088/\nhostname: billboard.com\ndescription: KISS bassist/singer Gene Simmons said he totally approves of JoJo Siwa's KISS-inspired rock and roll red carpet look at the iHeartRadio Music Awards.\nsitename: Billboard\ndate: 2024-04-04\ncategories: ['Pop']\ntags: ['Music News, Pop, rock']\n---\nJoJo Siwa took a wild swing earlier this week when she hit the red carpet at the 2024 iHeartRadio Music Awards on Monday in a wild rock and roll outfit that paid homage to KISS‘ Gene Simmons. The Demon-channeling look included a skin-baring black and silver bodysuit that was more cut-outs than fabric, a towering faux hawk, spooky, star-shaped eye makeup and black lipstick.\nSo far, Siwa, 20, has not commented on her glam metal makeover, but the former Dance Moms star is gearing up to release her new single, “Karma,” due out on Friday (April 5). “Karma’s a b–ch, I should’ve known better/ If I had a wish I would’ve never F’d around/ When I saw the pics of you and her I felt thе knife twist/ Karma’s a b—- / And she’s with you right now,” she sings on the song’s chorus; the track’s video also features Siwa’s KISS-y outfit.\nThe look caught the attention of the OG Demon, KISS bassist/singer Gene Simmons, who told TMZ that he really liked JoJo’s bad girl rocker persona. The site said he Simmons praised the edgier look and said that haters don’t get it and are probably just jealous. “Never be ordinary. Always be extraordinary,” Simmons said. “JoJo is extraordinary and she looks cool.”\nTrending on Billboard\nThough KISS recently retired from touring, the group announced on Thursday (April 4) that it Swedish company Pophouse had acquired the rights to the band’s publishing, recording royalties and trademarks, including the iconic KISS logo and signature Kabuki-like makeup design. The deal with the company behind the ABBA Voyage virtual concert residency in London will also include a Pophouse-produced KISS virtual show, using some of the same technology employed in the hit ABBA show.\nCheck out a preview of the “Karma” video — which includes the Demon look — below.",
      "author": "Gil Kaufman",
      "published_date": "2024-04-04",
      "word_count": 365,
      "fetch_timestamp": "2025-08-20T18:19:43.612523",
      "metadata": {
        "char_count": 2304,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T18:19:43.612511"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/2024-eurovision-song-contest-open-letter-reject-israel-ban-1235607339/",
      "source": "billboard",
      "artist_name": "Gene Simmons",
      "title": "Boy George, Sharon Osbourne, Gene Simmons & More Sign Letter Rejecting Attempt to Bar Israel From 2024 Eurovision Song Contest",
      "content": "---\ntitle: Boy George, Sharon Osbourne, Gene Simmons & More Sign Letter Rejecting Attempt to Bar Israel From 2024 Eurovision Song Contest\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/music-news/2024-eurovision-song-contest-open-letter-reject-israel-ban-1235607339/\nhostname: billboard.com\ndescription: More than 400 entertainers, including Boy George, Sharon Osbourne and Gene Simmons, sign letter rejecting attempts to bar Israel from 2024 Eurovision.\nsitename: Billboard\ndate: 2024-02-14\ncategories: ['Music News']\ntags: ['Eurovision, Eurovision Song Contest, Music News, Pop, rock']\n---\nA wide-ranging group of more than 400 musicians, actors, agents and managers and studio executives signed an open letter to the 2024 Eurovision Song Contest rejecting attempts by some participating countries to bar Israel from participating in this year’s event. Among those lending their names to the letter from the non-profit entertainment industry organization Creative Community for Peace were: Helen Mirren, Liev Schreiber, KISS’ Gene Simmons, Scooter Braun, Boy George, Sharon Osbourne, Emmy Rossum, Mayim Bialik, Debra Messing, Diane Warren and Selma Blair, among many others.\nThe letter supports the European Broadcasting Union’s commitment to including Israel in this year’s contest amid calls last month from Swedish and Finnish artists demanding Israel’s exclusion from the contest over their belief that including the country “undermines” the spirit of the competition. The letters cited Israel’s ongoing response to the deadly Oct. 7 surprise assault on the nation from Hamas militants in which more than 1,200 Israelis — mostly civilians — were murdered, sexually assaulted and attacked and more than 250 were taken hostage.\nTrending on Billboard\n“We have been shocked and disappointed to see some members of the entertainment community calling for Israel to be banished from the Contest for responding to the greatest massacre of Jews since the Holocaust,” the letter reads. “Under the cover of thousands of rockets fired indiscriminately into civilian populations, Hamas murdered and kidnapped innocent men, women, and children.”\nArtist manager Braun added, “Music is a place for unity not division. It is a language that should always bring us together. Artists should never be discriminated against for who they are, who they love, or where they’re born. These boycott efforts do nothing but distract from the uplifting and unifying power of music – something we need now more than ever.”\nKISS’ Simmons, who was born in Israel to a Holocaust survivor mother, wrote, “Music unites people from all backgrounds. It’s the one language that everyone can understand. It’s a beautiful thing and a great way to bring people together. Those advocating to exclude an Israeli singer from Eurovision don’t move the needle towards peace, but only further divide the world.”\nLast month’s letter from a group of more than 1,000 Swedish artists — this year’s Eurovision will be held in the the Swedish city of Malmö from May 7-11 — requested that Israel be barred from participating over it’s “brutal” response to the Hamas attack, citing the “humanitarian disaster” in Gaza.\n“We who sign this are 1,000 artists who believe in music as a unifying force. The Eurovision song contest began as a peace project with the ambition to unite countries and citizens through music,” read the Swedish letter, whose signers included Robyn, First Aid Kit and Fever Ray. “Allowing Israel’s participation undermines not only the spirit of the competition but the entire public service mission. It also sends the signal that governments can commit war crimes without consequences. Therefore, we appeal to the EBU: Exclude Israel from the Eurovision song contest 2024.”\nTo date, the 130-day war has reportedly led to the deaths of more than 28,000 Palestinians, the destruction of much of the Gaza Strip’s infrastructure and the displacement of more than one million Gazans. The Swedish letter joined earlier, similar requests to exclude Israel from more than 1,400 artists in Finland and Iceland.\nThe open letter from Creative Community for Peace — the first public call of its kind from the entertainment industry voicing unequivocal support of Israel’s inclusion in the contest — highlights Eurovision’s ability to unify people from diverse backgrounds and music’s power to effect positive change in the world.\nOther signatories to the open letter include: Julianna Marguiles, Ginnifer Goodwin, Recording Academy CEO Harvey Mason Jr., Skylar Astin, Atlantic Records Group CEO Julie Greenwald, Universal Music Publishing Group CEO Jody Gerson, Warner Records CEO Aaron Bay-Schuck, Patricia Heaton, Jennifer Jason Leigh, Disturbed’s David Draiman, Tom Arnold, Columbia Pictures chairman Tom Rothman and MRC co-founder/co-CEO Modi Wiczyk.\nThe letter notes that Israel has a long and storied Eurovision history — including hosting in 1979, 1999 and 2019 and winning in 1978, 1979, 1998 and 2018 — while offering up a diverse group of contestants representing the Palestinian, Ethiopian and LGBTQIA+ communities. “Furthermore, we believe that unifying events such as singing competitions are crucial to help bridge our cultural divides and unite people of all backgrounds through their shared love of music,” it reads.\n“The annual Eurovision Song Contest embodies this unifying spirit. Every year, millions of people across Europe and around the world join in a massive display of cultural exchange and celebration of music. Those who are calling for Israel’s exclusion are subverting the spirit of the Contest and turning it from a celebration of unity into a tool of politics.” Click here to see the full letter.",
      "author": "Gil Kaufman",
      "published_date": "2024-02-14",
      "word_count": 867,
      "fetch_timestamp": "2025-08-20T18:19:43.668084",
      "metadata": {
        "char_count": 5700,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:19:43.668076"
      }
    }
  ],
  "total_articles": 7,
  "total_words": 5631,
  "extracted_at": "2025-08-20T18:19:44.016955",
  "urls_processed": [
    "https://www.billboard.com/media/podcasts/gene-simmons-touring-solo-saving-money-behind-the-setlist-podcast-1235854583/",
    "https://www.billboard.com/music/music-news/kiss-gene-simmons-slammed-x-creepy-sexist-comments-dancing-with-the-stars-1235796882/",
    "https://www.billboard.com/artist/gene-simmons/chart-history/hsi",
    "https://www.billboard.com/music/music-news/kiss-gene-simmons-los-angeles-weather-report-1235922217/",
    "https://www.billboard.com/music/music-news/gene-simmons-fans-roadie-for-a-day-1235918623/",
    "https://www.billboard.com/music/pop/gene-simmons-approves-jojo-siwa-kiss-inspired-red-carpet-outfit-1235649088/",
    "https://www.billboard.com/music/music-news/2024-eurovision-song-contest-open-letter-reject-israel-ban-1235607339/"
  ]
}