{
  "artist_name": "Laurie Anderson",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/laurie-anderson-amelia/",
      "source": "pitchfork",
      "artist_name": "Laurie Anderson",
      "title": "Laurie Anderson: Amelia",
      "content": "---\ntitle: Laurie Anderson: Amelia\nauthor: Philip Sherburne\nurl: https://pitchfork.com/reviews/albums/laurie-anderson-amelia/\nhostname: pitchfork.com\ndescription: Read Philip Sherburne’s review of the album.\nsitename: Pitchfork\ndate: 2024-09-04\n---\nLaurie Anderson’s debut album, 1982’s Big Science, opens with a plane crash. Ever since, aircraft have figured inauspiciously in her work. The jets ominously crisscrossing “O Superman” (“Here come the planes/They’re American planes,” she intones) took on an even more portentous cast when she performed the song shortly after 9/11. In 2017, Anderson created a virtual reality installation, Aloft, that simulates sitting in a plane that slowly dissolves, leaving the viewer suspended in midair. At least some of these pieces may be drawn from Anderson’s own experience: She once survived the wreck of a small commercial plane. “It took a long time, ten minutes, from the time the first engine started sputtering to crash,” she recently recalled. “It sounds like nothing at all, ten minutes, and yet when you’re in a situation like that and you can’t move, it feels like the longest time imaginable.”\nAnderson’s new album Amelia plays similar tricks with time, but in reverse, compressing the last 44 days of Amelia Earhart’s life into a breezy 35 minutes. A fictionalized retelling of the pilot’s ill-fated 1937 attempt to circumnavigate the globe, it is, essentially, the chronicle of a crash foretold. From the very first engine noises that open the album, growling like a World War II dogfight, we know exactly how this story will end: with the 39-year-old adventurer, technologist, and feminist pioneer disappearing somewhere over the Pacific, never to be found.\nLike 2018’s Landfall—a rumination on the aftermath of Hurricane Sandy in collaboration with the Kronos Quartet—Amelia pairs Anderson’s hypnotic style of vocalizing with a contemporary classical ensemble (Filharmonie Brno, conducted by Dennis Russell Davies). But Amelia, despite its tragic final act, is a lighter and livelier reflection: a celebration of Earhart’s life and spirit, and an occasionally awestruck meditation on the magnitude of her quest.\nAnderson uses multiple perspectives to tell Earhart’s story. Flatly objective logbook data bleed into fictionalized journal entries (“It was the sound of the motor I remember the most”). Telegrams (“Fred unable to set his chronometers. Stop. Personal unfitness. Stop. Looking bad for arrival in Oakland July 4th stop. Stop.”) alternate with third-person narration delivered with the coolly objective tone of an encyclopedia entry. Anderson uses different vocal styles and registers to accommodate these overlapping perspectives, while ANOHNI, singing through a vocoder, gives voice to the waves and the wind.\nThese fragmented scenes suggest the kaleidoscopic perspective of a text like Michael Ondaatje’s Coming Through Slaughter, but in its brevity and gliding pace, Amelia feels more like a PBS special; you can practically see the red line moving across the animated map, the tastefully reenacted cockpit vignettes, the sleek montage of newspaper headlines and newsreel footage. Anderson has said that an earlier version of the piece was overstuffed with instruments and ideas, but Amelia flits briskly from scene to scene, with just enough musical backing to flesh out the atmosphere: shimmering oceanic drones; subtly driving pulses; dissonant whorls abruptly smoothed into reassuring consonance. A handful of guest musicians, including jazz guitarist Marc Ribot, flesh out Anderson’s impressionistic soundscapes, but they’re so carefully integrated into the whole that you might never notice their individual presence. Despite brief moments of tumult, it is a largely frictionless listen.",
      "author": "Philip Sherburne",
      "published_date": "2024-09-04",
      "word_count": 559,
      "fetch_timestamp": "2025-08-20T08:52:05.795330",
      "metadata": {
        "char_count": 3764,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:52:05.795319"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/words-of-wisdom-from-kim-gordon-and-laurie-anderson/",
      "source": "pitchfork",
      "artist_name": "Laurie Anderson",
      "title": "Words of Wisdom From Laurie Anderson and Kim Gordon",
      "content": "---\ntitle: Words of Wisdom From Laurie Anderson and Kim Gordon\nauthor: Pitchfork\nurl: https://pitchfork.com/features/podcast/words-of-wisdom-from-kim-gordon-and-laurie-anderson/\nhostname: pitchfork.com\ndescription: This episode of the Pitchfork Review podcast features an interview with the two music legends about maintaining your sanity as an artist, the fight for reproductive rights, and the essay collection This Woman’s Work.\nsitename: Pitchfork\ndate: 2023-05-11\ncategories: ['features']\n---\nOur weekly podcast includes in-depth analysis of the music we find extraordinary, exciting, and just plain terrible, along with interviews with some of our favorite artists. This week, Editor-in-Chief Puja Patel talks to boundary-breaking icons Laurie Anderson and Kim Gordon, as well as writer and editor Sinéad Gleeson, to discuss the essay anthology This Woman’s Work, which was edited by Gordon and Gleeson, and features a piece about Anderson. The interview took place in May 2022 as part of the Chicago Humanities Festival.\nListen to this week’s episode below, and follow The Pitchfork Review here. You can also check out an excerpt of the podcast’s transcript below.\nPuja Patel: Laurie, how have you navigated the act of work and creating art for so long while also trying to maintain your sanity?\nLaurie Anderson: I have not, at all. [laughs] It’s really hard to do. But I also don’t particularly think of this as a work. I never really did when I was starting out as a visual artist. Not one artist I knew ever thought we would make a living doing this stuff. It was not at all like the kind of professionalism that’s going on now. I was really starting out close to the ’60s with that idea of: We’re gonna dance down the road and just see what happens, and the people who are going to get jobs were idiots. [laughs] We felt sorry for them. They were just sad. So I never thought of it as work.\nI also never knew who I was working for, which is a big issue when you’re thinking of work. I remember a headline from a British newspaper, something like, “Britain Loses Millions of Man Hours Due to Sickness.” And I was like, “Britain loses? You owe Britain your man hours?” So “Who are you working for?” has become more of a question for me than it used to be, because I used to just do it because I liked it. I still do it because I like it.\nMore recently, I’ve been thinking about work as part of our hyper-mediated culture, where every single thing you do you have to comment on: Did you like that? How much did you like it? How much do you like yourself today? You’re constantly assessing yourself in this self-made surveillance culture that we’re in. It’s exhausting. That to me is work, to be constantly reporting how well you’re doing and how well that taxi ride went. The assessment and putting things in ranks has become really out of control.\nPatel: So you’re talking to the editor of Pitchfork. [laughs]\nAnderson: I know. Well, I have to say one thing about press: I appreciate when I read it for other people, and I like to read about what’s going on, but my life improved one thousand percent about 10 years ago when I stopped reading absolutely anything about myself. I try to stay out of the heavily mediated world that is always grinding out opinion, even though I really appreciate good writing; the worst review I ever got, which was about around the time I stopped reading these books, was the best-written one. So I wrote to this journalist. I said, “You are wasting your time doing this stuff. Write a novel.” Five years later, I got a novel in the mail from this guy—and it was really, really good.",
      "author": "Pitchfork",
      "published_date": "2023-05-11",
      "word_count": 625,
      "fetch_timestamp": "2025-08-20T08:52:05.815079",
      "metadata": {
        "char_count": 3624,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:52:05.815074"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/laurie-anderson-united-states-live/",
      "source": "pitchfork",
      "artist_name": "Laurie Anderson",
      "title": "Laurie Anderson: United States Live",
      "content": "---\ntitle: Laurie Anderson: United States Live\nauthor: Jesse Dorris\nurl: https://pitchfork.com/reviews/albums/laurie-anderson-united-states-live/\nhostname: pitchfork.com\ndescription: Read Jesse Dorris’ review of the album.\nsitename: Pitchfork\ndate: 2021-07-04\ntags: ['sunday review']\n---\nOn January 25, 1983, Reagan delivered a rousing State of the Union to a country reeling from a recession. He bid for inspiration. “As surely as America’s pioneer spirit made us the industrial giant of the 20th century,” he said, “the same pioneer spirit today is opening up on another vast front of opportunity, the frontier of high technology.” He had, he said, “a vision not only of what the world around us is today, but what we as a free people can make it be tomorrow.” Six weeks later, in the premiere of his blockbuster “Evil Empire Speech,” he told an audience of the newly-ascendant Christian Right, “Any objective observer must hold a positive view of American history.” It was, he said, “a history that has been the story of hopes fulfilled and dreams made into reality.” Much of the country loved his shiny hair and avuncular brand of authoritarianism. They believed what he said.\nIn-between these two speeches, on February 7th, 1983, the performance artist Laurie Anderson had an opening night of a new show at the Brooklyn Academy of Music. She spiked her hair with Vaseline and pulled on a suit like she was ready for business. The overall effect was somewhere between Albert Einstein and Grace Jones. She gathered her trusty violin—various states of violins, really, some with neon inside them and others strung with prerecorded cassette tape the bow could activate—and a vocoder and other mechanical wonders, many made by her own hands. She had thousands of slides and videos and a crew to run them. A small band of fixtures of the Downtown scene, including the Love of Life Orchestra’s Peter Gordon and David Van Tieghem, was ready to accompany her. An audience primed by recent theatrical epics like Philip Glass’ Einstein on the Beach sat ready to be wowed. They believed in her. In the darkened auditorium, Anderson took the stage. She pointed to a map of America projected behind her. She asked: “Can you tell me where I am?” Then she turned to a mic plugged into a Harmonizer that dragged her voice way down into what she named her “voice of authority.” Her male voice said: “Do you want to go home?”\nAnd so began Laurie Anderson’s own state of the union. The record of this eight-hour, two-night show—1984’s four-and-a-half-hour box set, United States Live—is a gesamtkunstwerk, a bold federation of hobbyist tinkering and scientific wizardry, sound sculpture and rock music, gender and social studies, philosophy and linguistics. With performance chops equal to the Gipper’s, Anderson untangled Reagan’s knot of tech and hope and power and wove together an alternative form of patriotism, one that centers disorientation and finds authenticity in imagination. Along the way, she created an American masterpiece.",
      "author": "Jesse Dorris",
      "published_date": "2021-07-04",
      "word_count": 489,
      "fetch_timestamp": "2025-08-20T08:52:05.855566",
      "metadata": {
        "char_count": 3024,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:52:05.855560"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/laurie-anderson-kronos-quartet-landfall/",
      "source": "pitchfork",
      "artist_name": "Laurie Anderson",
      "title": "Laurie Anderson / Kronos Quartet: Landfall",
      "content": "---\ntitle: Laurie Anderson / Kronos Quartet: Landfall\nauthor: Jenn Pelly\nurl: https://pitchfork.com/reviews/albums/laurie-anderson-kronos-quartet-landfall/\nhostname: pitchfork.com\ndescription: Laurie Anderson’s collaboration with the San Francisco-based string quartet presents a powerful, elegiac cycle of songs that show how human memory can be stronger than catastrophe.\nsitename: Pitchfork\ndate: 2018-02-27\n---\n“How many people can do everything?” asked Lou Reed in 2003. He was explaining to the television host Charlie Rose why Laurie Anderson was the “absolute perfect person” to be NASA’s first artist-in-residence. (She would also be its last.) By then, Anderson had been a visual artist, filmmaker, and unlikely pop musician. She once read David Bowie’s mind; she hung suspended upside-down over Coney Island; she taught her dog to play piano. With the folks at NASA, Anderson toured the Hubble Space Telescope and met astronauts and nanotechnologists, ultimately producing a poem called The End of the Moon, which she recited between violin interludes. Formally and conceptually grappling with colossal forces of the unknown, The End of the Moon is a fitting precedent to Anderson’s gripping collaboration with the revolutionary Kronos Quartet—a string quartet who also once worked with NASA and have in their four-decade career, you could say, done everything.\nBoth Anderson, a consummate New Yorker, and Kronos Quartet, from San Francisco, have been prolific interrogators of American power since the 1970s. In classical music, Kronos challenged the dominance of European-American composers, investigating world music, rock, and jazz; at times, they have played with projections of Occupy and the Arab Spring behind them, or collaborated with leftist historian Howard Zinn. In a 2014 interview, Kronos founder David Harrington said, “Of all the string quartets in the world, I’m intending to have the largest F.B.I. file.” But the greatest link between Anderson and Harrington might be their abilities to see the future.\nHarrington dreamed of collaborating with Anderson for decades. But it was not until after the release of Anderson’s 2010 LP Homeland that Landfall began to take shape, first as a traveling live performance and now as a 30-track album of epic sweep. Composed by Anderson and featuring her spoken word, Landfall is a cycle of songs that observe the devastating wake of Hurricane Sandy through her eyes. Though much of Landfall was written before the third costliest storm in U.S. history ravaged the East Coast in October of 2012, Sandy dominates this intense work. It is the sound of a quintessential New Yorker processing a New York tragedy, salvaging something from the sad wreckage, internalizing the debris of a creative life, showing how human memory can be stronger than catastrophe.\nThe elegiac tracks of Landfall, most no longer than two or three minutes, are episodic fragments that can cut off abruptly, like photographs with torn or water-damaged edges. This gives Landfall a momentum and a grace that’s slightly askew. There is a celestial scope to these pieces, as if Anderson has composed a new cosmos where lies are not hidden, but rather laid bare; where we can decipher what is real. Anderson’s lucid spoken word combines with the quartet’s weeping elegance to portray the gravity of disaster, of seismic motion, of ominous anticipation, all with a gentle immediacy. By “Our Street Is a Black River,” Anderson begins her story: “From above, Sandy was a huge swirl that looked like the galaxies,” she states, and in her iconic way, she continues, “whose names”—pause—“I didn’t know.”",
      "author": "Jenn Pelly",
      "published_date": "2018-02-27",
      "word_count": 563,
      "fetch_timestamp": "2025-08-20T08:52:05.895372",
      "metadata": {
        "char_count": 3632,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:52:05.895366"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/17579-moses-sumney-o-superman-laurie-anderson-cover/",
      "source": "pitchfork",
      "artist_name": "Laurie Anderson",
      "title": "Moses Sumney: \"O Superman\" (Laurie Anderson Cover)",
      "content": "---\ntitle: Moses Sumney: \"O Superman\" (Laurie Anderson Cover)\nauthor: Andy Beta\nurl: https://pitchfork.com/reviews/tracks/17579-moses-sumney-o-superman-laurie-anderson-cover/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2015-07-16\n---\nIn *How to Wreck a Nice Beach—*Dave Tompkins' fascinating history of how the vocoder transformed from WWII encrypting device to funky futuristic enabler—there is a chapter that opens with Laurie Anderson's \"O Superman\", one of the most peculiar songs to ever dominate the Pazz & Jop critics poll and Top of the Pops. \"The song takes place on an answering machine imagined,\" Tompkins writes, \"a disembodied voice addressing a room that was less empty than just withholding presence.\" He wonders what Alan Turing, forefather of artificial intelligence, would have made of \"these Laurie Andersons in a vocoder—arms, petrochemical, electronic and military—as if false security and comfort were indivisible.\" The haunting remove of her synthesized vocal conjures \"Daisy\" as sung by HAL 9000 on the surface of planet Hoth, with the looming potential of a nuclear winter in Reagan's early '80s America.-=-=-=-\nIt might be one of those songs that is too daunting to tackle. So what is so striking about Moses Sumney's rendition of \"O Superman\" (which appears on the recent Moogfest Vol. 1 EP) is how warm, humid, and human it all sounds. It was the only direction Sumney could take \"O Superman\". The original voices a detached, mechanized future that seems too real now, even if the notion of an answering machine—much less an outgoing message that says \"I’m not home right now\"—feels quaint in light of our phones never being far from our bodies, regardless of where home is.\nSumney’s exhalations sound more like Roger Troutman of Zapp, but even run through the plastic tubing of the vocoder, Sumney’s staggering vocals emerge intact. Handclaps echo, his voice multiplies into a gospel choir that moans and lurches on loop. It all wobbles and melts into mewls and noise, but not before Sumney susses out the warm core of the original’s nuclear-armed embrace.",
      "author": "Andy Beta",
      "published_date": "2015-07-16",
      "word_count": 325,
      "fetch_timestamp": "2025-08-20T08:52:05.927848",
      "metadata": {
        "char_count": 2091,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:52:05.927844"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/14317-homeland/",
      "source": "pitchfork",
      "artist_name": "Laurie Anderson",
      "title": "Laurie Anderson: Homeland",
      "content": "---\ntitle: Laurie Anderson: Homeland\nauthor: Brian Howe\nurl: https://pitchfork.com/reviews/albums/14317-homeland/\nhostname: pitchfork.com\ndescription: The Downtown NYC fixture's first album in a decade is an exquisite state-of-the-union dispatch from a darkly comic conscience.\nsitename: Pitchfork\ndate: 2010-06-21\n---\nLaurie Anderson's 40-year career bucks classification, incorporating performance art, music, spoken word, video, and more. To mention John Zorn, Lou Reed, and Philip Glass only glosses her collaborations with the American avant-garde. She's also crossed over in interesting and unexpected ways, whether voicing a singing tot in The Rugrats Movie*,* or hitting #2 on the 1981 UK Singles Chart with \"O Superman (For Massenet)\", a doomsday anthem combining the vocoder with an aria from Le Cid. That angelic, robotic voice is often reprised on Homeland, her first new album in a decade, which fans will welcome as an heir to her definitive performance piece, United States. It's also a perfect starting point; an exquisite state-of-the-union dispatch as only Anderson, America's darkly comic conscience, can provide.\nA songful yet distressed Neo-Romantic mode anchors forays into techno, jazz, drone, and minimal electronics. Top-notch guests like Zorn, Antony, and Kieran Hebden add their unique perspectives to Anderson's probing keyboards and violins. The music is spacious, mercurial, and thoroughly conceived. Anderson's vocals hover between speech and song, polemics and poetry, apocalyptic and redemptive fervors. And that's as far as generalizations will go. Homeland teems with the same variety and sprit as the U.S. itself.\nThese songs have been developing live for years, so naturally, Iraq and Wall Street loom large. The persistence of those quandaries makes the material feel timely, even oracular, a quality for which Anderson is known. \"O Superman\" gained fresh attention after 9-11 for its images of American planes drawing ominously nearer. (On a lighter note, its vocals predicted everything from Imogen Heap's \"Hide and Seek\" to the ongoing Auto-Tune craze.) She's still broadcasting from the day after tomorrow. The organic house track \"Only an Expert\" schematically details the hubris of authorities who consolidate power by creating problems only they can solve. Had the album been delayed a little longer, a verse about the BP oil leak would have fit perfectly alongside the global warming controversy and the banking bailout.\n\"Only an Expert\" makes a pervasive, subtle theme momentarily explicit: How shared illusions about security and plenitude perpetuate a predictable cycle of cultural, environmental, and existential crises. But this threatens to make the album sound punitive, when somehow, Anderson's wrath feels compassionate. As \"Falling\" would have it, \"Americans, unrooted, blow with the wind/ But they feel the truth if it touches them.\" It's confrontational and beautiful, the grim tidings leavened with empathetic portraiture. \"Transitory Life\" is haunting and cunningly crafted. When Anderson sings that her dead grandmother \"made herself a bed inside my ear/ Every night I hear,\" the Tuvan throat singer from the song's intro reappears, the formless cries suddenly given a narrative role.\nBut the epic \"Another Day in America\" is the album's huge, dark heart. Anderson's voice is pitched down and slowed-- she becomes her character on the cover, a slapstick figure of male authority-- over lingering strings and keyboards. The oration is a vortex of visionary proclamations, pointed fables, downbeat jokes. It makes palpable not only all the pathos and superstition of the American psyche, but the weight of time passing away-- another diminishing resource. Every malfunction of the status quo, Anderson implies, is a chance to start over, instead of rushing to rebuild what always breaks down. Her pessimism might not be comforting, but as oil continues to poison the Gulf of Mexico, it feels awfully prescient.",
      "author": "Brian Howe",
      "published_date": "2010-06-21",
      "word_count": 598,
      "fetch_timestamp": "2025-08-20T08:52:05.959922",
      "metadata": {
        "char_count": 3969,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:52:05.959918"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/10455-big-science/",
      "source": "pitchfork",
      "artist_name": "Laurie Anderson",
      "title": "Laurie Anderson: Big Science",
      "content": "---\ntitle: Laurie Anderson: Big Science\nauthor: Joshua Klein\nurl: https://pitchfork.com/reviews/albums/10455-big-science/\nhostname: pitchfork.com\ndescription: It was ahead of its time back in 1982, but now Laurie Anderson's debut (and especially its centerpiece \"O Superman\") sounds just right for a world gone totally wrong.\nsitename: Pitchfork\ndate: 2007-08-02\n---\n\"In September 2001, I was on tour and played 'O Superman' at Town Hall in New York City,\" writes Laurie Anderson in the liner notes to her newly reissued Big Science. \"The show was one week after 9/11, and as I sang, 'Here come the planes/ They're American planes,' I suddenly realized I was singing about the present.\"\n\"Suddenly?\" Methinks Anderson is being a touch disingenuous. On the night of September 11, 2001, Anderson was performing at the Park West in Chicago. The air was heavy with dread, confusion, and anger. Waiting for the show to begin, the crowd was talking amongst itself, conversations running the gamut between those three poles. Anderson herself had allegedly spent much of the morning on the phone with her partner Lou Reed, who was back in New York-- and supposedly sitting on the roof of their building watching the Twin Towers burn-- though she made nary a mention of the day's events once she started performing.\nThe crowd was dead silent throughout, but when Anderson began \"O Superman\" you could hear the room shift as the already menacing song took on new layers of eerily contemporary meaning. \"Hello? Is anybody home? Well, you don't know me, but I know you. And I've got a message to give to you. Here come the planes. So you better get ready.\" The lyrics chimed out like an answering machine message sent to the future, picked up several decades too late.\nThat song's mix of politics, Zen-like aphorism, and sentimentalism hit like a punch to the gut as the nation stood on the precipice of the unknown, and the toll the collapse of the Twin Towers would truly take on this country-- and the world-- hadn't quite settled in. So: \"suddenly?\" No, surely Anderson recognized the renewed power of her (sole) unlikely hit well before she made it home to New York City. Then again, the almost mystically timeless song was in a way always about the shifting \"present.\" Anderson writes that \"O Superman (For Massenet)\" was inspired by a composition from Jules Massenet's opera Le Cid, \"O Souverain\", which in turn reminded Anderson of Napoleon's fall at Waterloo. She had also taken into account the bungled U.S. rescue mission in Tehran. It's a song of military arrogance, failure and the price we all pay, recorded for a modest $500 with an NEA grant. In 1981, it went to No. 2 in the UK.\nBig Science comprises songs from Anderson's also quite prescient United States project, a multimedia performance art piece cum opera (\"It seemed like everyone I knew was working on an opera,\" she recalls) that depicted America on the brink of digital revolution and capitalist nirvana, where the dollar trumped tradition and the apocalypse-- cultural, political, technological-- loomed large. In fact, given its themes and presentation, much of Big Science sounds every bit about \"the present\" as \"O Superman\" does, and its idiosyncratic execution (with stylistic nods to the minimalists and pal William S. Burroughs) has helped the disc weather the passage of time remarkably well. It's less a document of the early 1980s than it is a dark glimpse of the future recorded at the dawn of the Reagan era.",
      "author": "Joshua Klein",
      "published_date": "2007-08-02",
      "word_count": 583,
      "fetch_timestamp": "2025-08-20T08:52:05.994945",
      "metadata": {
        "char_count": 3485,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:52:05.994941"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "Laurie Anderson",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-20\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nRap\nStar Line\nChance the Rapper\nBy\nAlphonse Pierre\nAugust 20, 2025\nRock\nLove Is Like\nMaroon 5\nBy\nLinnie Greene\nAugust 20, 2025\nExperimental\nKhadim\nMark Ernestus’ Ndagga Rhythm Force\nBy\nRae-Aila Crumble\nAugust 20, 2025\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-20",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-20T08:52:06.474086",
      "metadata": {
        "char_count": 7698,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:52:06.474074"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/",
      "source": "pitchfork",
      "artist_name": "Laurie Anderson",
      "title": "The Pitchfork Review: All of the Latest Episodes",
      "content": "---\ntitle: The Pitchfork Review: All of the Latest Episodes\nauthor: Condé Nast\nurl: https://pitchfork.com/podcast/the-pitchfork-review/\nhostname: pitchfork.com\ndescription: Listen to every episode of Pitchfork’s podcast for music fans and obsessives.\nsitename: Pitchfork\ndate: 2024-01-11\ntags: ['web']\n---\nBrought to you by the music critics at Pitchfork, The Pitchfork Review is a show for music fans and obsessives who can’t wait to talk about the latest releases. Co-hosted by Pitchfork editor-in-chief Puja Patel and Reviews Editor Jeremy D. Larson, this podcast pulls back the curtain on our reviews and scores, dives deep into new music, and gives an expert guide to what’s exciting, what’s great, and what’s just plain terrible.\nListen to every episode of Pitchfork’s podcast for music fans and obsessives.\nRelated Articles\nThe Origins and Influence of Brian Eno’s Pioneering Album Ambient 1: Music for Airports\nIn the latest episode of Pitchfork’s podcast, our critics revisit the legendary producer’s classic 1978 LP, which was recently featured in our Sunday Review series.\nBy Pitchfork\nJeff Tweedy on Rock Criticism, the Pitfalls of Music Snobbery, and His New Book\nThe musician and author discusses World Within a Song, in which he writes about 50 songs that rearranged his brain, Wilco’s new album, and more.\nBy Pitchfork\nThe 2023 Music Grab Bag: Trends, Scandals, and Theories\nIn this episode of the Pitchfork Review podcast, our critics talk about the rise of the musical theater girlie, the fall of the 1975’s Matty Healy, and more. Plus: Alvvays’ Molly Rankin reveals the song she wishes she wrote.\nBy Pitchfork\nThe Best, Worst, and Most Surprising Albums of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about some of their faves from our 50 Best Albums of 2023 list and lament a few of the year’s biggest disappointments.\nBy Pitchfork\nWhy the Replacements’ Tim Is the Best Reissue of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about the revelatory new version of the beloved rock band’s 1985 LP. Plus, Replacements bassist Tommy Stinson reveals his perfect-10 album.\nBy Pitchfork\nBreaking Down Bad Bunny’s New Album and the Future of Puerto Rican Rap and Reggaeton\nIn this episode of The Pitchfork Review podcast, our critics dissect Bad Bunny’s latest and highlight a few new queer artists from Puerto Rico who are taking the island’s music to exciting new places.\nBy Pitchfork\nDebating the Best Songs of 2023, Part Two\nIn this episode of the Pitchfork Review podcast, our critics battle it out over some of their favorite songs of the year, by artists including Troye Sivan, Kendrick Lamar, Big Thief and more. Plus: Devendra Banhart tells us all about his dream collaboration.\nBy Pitchfork\nDebating the Best Songs of 2023, Part One\nIn this episode of the Pitchfork Review podcast, our critics take sides and discuss which tracks by some of 2023’s most exciting artists deserve a spot on our upcoming year-end lists.\nBy Pitchfork\nThe Good, the Bad, and the Swiftie of Taylor’s Eras Tour Concert Film\nIn this episode of The Pitchfork Review podcast, our critics wade through the ups and downs of the pop superstar’s new record-breaking live movie.\nBy Pitchfork\nWhat Drake Is Doing Wrong—and How He Can Fix It\nIn this episode of the Pitchfork Review podcast, our critics talk about what made them care about Drake in the first place, why his new album For All the Dogs is so frustratingly mid, and what he should do next.\nBy Pitchfork",
      "author": "Condé Nast",
      "published_date": "2024-01-11",
      "word_count": 579,
      "fetch_timestamp": "2025-08-20T08:52:06.526268",
      "metadata": {
        "char_count": 3506,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:52:06.526263"
      }
    },
    {
      "url": "https://pitchfork.com/features/",
      "source": "pitchfork",
      "artist_name": "Laurie Anderson",
      "title": "Music Articles & Features",
      "content": "---\ntitle: Music Articles & Features\nauthor: Condé Nast\nurl: https://pitchfork.com/features/\nhostname: pitchfork.com\ndescription: Longform and in-depth analysis about the most exciting and important music being released today\nsitename: Pitchfork\ndate: 2025-08-14\ntags: ['web']\n---\nDekmantel Is a Dance Festival Shedding Light on the Underground\nWe touched down in Amsterdam for the 2025 edition of the left-of-center electronic festival and came back with some thoughts about live sets, drum heads, speaker cabinets, bass fiends, techno lords, and the simple power of naming some club-ready bangers.\nBy Jeremy D. Larson\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nNight Out 2025: Pitchfork and Them’s Showcase for the Future of Queer Music\nBy Olivier LafontantPhotography by Dillon Edlin\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nWhat Happened at Pitchfork’s Bladee Zine Launch\nBy PitchforkPhotography by Caroline Friedman\nA Rare Interview With Bladee, the Mystic Oracle of Internet Rap\nBy Meaghan GarveyPhotography by Jason Nocito\nHighlights From Pitchfork’s 2024 Year in Music Club Night\nBy PitchforkPhotography by Sam Wachs\nHighlights From Pitchfork and Thought Enthusiast’s Year in Music Panel\nBy PitchforkPhotography by Sam Wachs\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 18 Best Moments From Pitchfork Music Festival 2024\nBy Boutayna Chokrane, Nina Corcoran, and Heven Haile\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nHow Waxahatchee Made the Album of Her (Second) Life\nBy Andy CushPhotography by Bobby Doherty\nChasing the Goblin With Mabe Fratti, the Guatemalan Cellist at the Heart of Mexico City’s Avant-Rock Scene\nBy Philip SherburnePhotography by Filip Preis",
      "author": "Condé Nast",
      "published_date": "2025-08-14",
      "word_count": 347,
      "fetch_timestamp": "2025-08-20T08:52:06.807257",
      "metadata": {
        "char_count": 2280,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:52:06.807250"
      }
    }
  ],
  "total_articles": 10,
  "total_words": 5987,
  "extracted_at": "2025-08-20T08:52:06.807655",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/laurie-anderson-amelia/",
    "https://pitchfork.com/features/podcast/words-of-wisdom-from-kim-gordon-and-laurie-anderson/",
    "https://pitchfork.com/reviews/albums/laurie-anderson-united-states-live/",
    "https://pitchfork.com/reviews/albums/laurie-anderson-kronos-quartet-landfall/",
    "https://pitchfork.com/reviews/tracks/17579-moses-sumney-o-superman-laurie-anderson-cover/",
    "https://pitchfork.com/reviews/albums/14317-homeland/",
    "https://pitchfork.com/reviews/albums/10455-big-science/",
    "https://pitchfork.com/reviews/albums/",
    "https://pitchfork.com/features/podcast/",
    "https://pitchfork.com/features/"
  ]
}