{
  "artist_name": "Amy Winehouse",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/21214-amy-the-original-soundtrack/",
      "source": "pitchfork",
      "artist_name": "Amy Winehouse",
      "title": "Amy Winehouse: AMY: The Original Soundtrack",
      "content": "---\ntitle: Amy Winehouse: AMY: The Original Soundtrack\nauthor: Jia Tolentino\nurl: https://pitchfork.com/reviews/albums/21214-amy-the-original-soundtrack/\nhostname: pitchfork.com\ndescription: AMY was a compassionate and horrifying Amy Winehouse documentary chronicling her brief, doomed arc through superstardom. The soundtrack is a mix of album cuts and live material, and it fails to capture the frightening intensity that Winehouse projected or to tell a new version of her story.\nsitename: Pitchfork\ndate: 2015-11-06\n---\nThere are several ways one might construct a soundtrack for AMY, the compassionate and horrifying Amy Winehouse documentary chronicling her brief, doomed arc through superstardom. The obvious choice would be to make the soundtrack 100% Amy, whether through covers (the tactic of the soundtrack for the Nina Simone documentary What Happened, Miss Simone?) or through Winehouse's own voice. But in the AMY: The Original Soundtrack, Amy Winehouse is actually outnumbered: her 11 B-sides are broken up evenly by 11 snippets of film score, with the balance tipped by one exceedingly unnecessary trip-hop track, originally released in 1995.\nThis is not for lack of material. Winehouse began her public singing career at age 16 with the National Youth Jazz Orchestra, performing and recording regularly for the next decade until her death. She's already had one posthumous compilation album (2011's poorly named, respectability-minded Lioness: Hidden Treasures), but if the tracks available on YouTube are any indication—let alone the unreleased professional recordings that her still-active fanbase lists and obsesses over on message boards—there are plenty of demos, live versions, and discarded mixes left. AMY: The Original Soundtrack, however, contains only one true \"new\" recording. \"We're Still Friends\", performed live at the Union Chapel in 2006, shows Winehouse on the cusp between her peak and downfall; the recording is precise and elegant, and she wears her strung-out voice like a crown.\nThe rest of the soundtrack is a mix of album cuts and live recordings, compiled primarily as signposts for the documentary's plot. There is no raw audio on the soundtrack whatsoever; it's much glossier than the film itself, which heavily relies on rough footage and successfully illuminates Winehouse outside her press narrative as a result. In AMY, it's arresting to watch her so unguarded, putting her makeup on in a bar bathroom before a gig, giving a tour of her apartment in character as a haughty maid. Her talent flames into incandescence and out of it; her flesh shrinks into bone. She's frequently captured singing in the film, from \"Happy Birthday\" at a friend's house to that gruesome final show in Belgrade, where she was essentially walking dead. The collage is forceful, and in context you barely notice that the film is scored at all.\nThe soundtrack, then, serves as your reminder. Antonio Pinto, who wrote the music for both City of God and City of Men, even has the opening track. It's a minimal, mournful minute of piano. \"This is sad, remember,\" the song says. \"What's about to happen is very, very solemn.\" But could there be anything that requires saying less?",
      "author": "Jia Tolentino",
      "published_date": "2015-11-06",
      "word_count": 498,
      "fetch_timestamp": "2025-08-20T08:19:54.899047",
      "metadata": {
        "char_count": 3200,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:19:54.899024"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/17295-at-the-bbc/",
      "source": "pitchfork",
      "artist_name": "Amy Winehouse",
      "title": "Amy Winehouse: At The BBC",
      "content": "---\ntitle: Amy Winehouse: At The BBC\nauthor: Douglas Wolk\nurl: https://pitchfork.com/reviews/albums/17295-at-the-bbc/\nhostname: pitchfork.com\ndescription: This CD/DVD gathers 48 minutes' worth of tracks from on-stage and in-the-studio broadcasts, including two otherwise unreleased titles, and an hour-long documentary built around a 22-minute set filmed shortly after the release of *Back to Black*.\nsitename: Pitchfork\ndate: 2012-12-11\n---\nEverybody wants a new Amy Winehouse album as good as Back to Black. It would be nice if, for instance, it turned out that the British soul revivalist had completed or at least sketched out another jewel of a record during the turbulent last four years of her life. But she didn't: there was her collaboration with Mark Ronson on \"Valerie\", and the new song-and-a-half that turned up on last year's Lioness: Hidden Treasures, which was otherwise stocked with alternate versions, earlier outtakes, and covers. A live album that lived up to what she could do at her best would be welcome, too. But her post-Back to Black gigs were relatively few and, by all accounts, mostly pretty dodgy.\nSo-- perhaps a set of radio recordings, then? That's something, right? At the BBC cherrypicks 48 minutes' worth of tracks from live-on-stage and live-in-the-studio broadcasts. It adds two otherwise unreleased titles to the Winehouse discography: covers of the standards \"I Should Care\" and \"Lullaby of Birdland\", from the latter of which Winehouse borrowed a bit for her own \"October Song\". And it's sequenced in order of her albums' original release rather than in order of the performances-- all the Frank songs, then all the Back to Black songs, then the other stuff. That covers up for the fact that only two tracks here were recorded in the rocky 2007-2011 period: a blaring \"Just Friends\" and a stripped-down \"Love Is a Losing Game\", both from 2009. It also provides an excuse to lead the album with a 2004 take of \"Know You Now\" that's a marked improvement on the Frank recording.\nWinehouse always had a tendency to over sing on stage, though. Especially when she had a big audience to project toward, it was too easy for her to overindulge in the vocal tics-- the slurred consonants, the hyper-articulated melisma, the extravagant ornaments, the imitations of Billie Holiday's timbre-- that she could restrain on her better studio recordings, and it often led her to mangle her own lyrics. (She pronounces the final word of \"F%#k Me Pumps\" here as \"pwuuuups.\") The most effective performances here are the most intimate ones, especially on the attached DVD-- an hour-long documentary built around a 22-minute set filmed shortly after the release of Back to Black, just Winehouse, a guitarist and a bassist playing inside a little Irish church.\nThe versions of Winehouse's repertoire that turn up on At the BBC's audio disc, though, are almost all sloppier than their studio counterparts, and she rarely manages to reveal anything we didn't already know about her songs. And every time she garbles a phrase or pointedly mentions her vices, it's a stinging reminder that she spent the better part of her too-brief career making her audience complicit in her self-destruction. This set isn't devoid of interest, but it's not in any way another great Amy Winehouse album, or even another good one. We're never going to get that.",
      "author": "Douglas Wolk",
      "published_date": "2012-12-11",
      "word_count": 547,
      "fetch_timestamp": "2025-08-20T08:19:54.930702",
      "metadata": {
        "char_count": 3360,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:19:54.930697"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/10900-frank/",
      "source": "pitchfork",
      "artist_name": "Amy Winehouse",
      "title": "Amy Winehouse: Frank",
      "content": "---\ntitle: Amy Winehouse: Frank\nauthor: Douglas Wolk\nurl: https://pitchfork.com/reviews/albums/10900-frank/\nhostname: pitchfork.com\ndescription: Originally released in the UK four years ago and subsequently dissed by the artist herself, Amy Winehouse's debut finally lands on U.S. shores.\nsitename: Pitchfork\ndate: 2007-11-14\n---\nThe self-destructive tortured-artist routine was bullshit when Kurt Cobain did it, it was bullshit when Elliott Smith did it, and it's bullshit now. As anyone who's seen the video of Amy Winehouse desperately finger-fumbling her way through \"Back to Black\" at the MTV Europe Video Music Awards knows, her look-how-messed-I-am public persona is now screwing up her art something fierce. So instead of a new record, Americans are now getting a modified version of Frank, her first album, originally released four years ago and subsequently dissed by the artist herself. Its two weakest links, \"Know You Now\" and a pointless cover of standard \"Moody's Mood for Love\", have been yanked out of the original running order and appended as hidden penalty tracks.\nWinehouse has a hell of a voice, even when she imitates her favorite jazz vocalists-- especially Billie Holiday-- much too closely. (Just in case anybody misses the idea that she's supposed to be a jazz singer who's somehow stumbled into a neo-soul record, Frank begins with a little fragment of Winehouse scat-singing, and the chorus of \"October Song\" doesn't just namedrop Sarah Vaughan but lifts its melody from \"Lullaby of Birdland\".) None of her songs here are as indelible as \"Rehab\" or as cutting as \"You Know I'm No Good\"-- and the best are co-written with Nas and Fugees collaborator Salaam Remi-- but you can hear the development of the high-powered songwriter she turned into on Back to Black in the snarky character sketch \"F*** Me Pumps\" and in the way the sharp-nailed ballad \"You Sent Me Flying\" breaks into a Soul II Soul beat halfway through. And although she hasn't quite nailed the 1972 vibe of her later record (despite some corny vintage-vinyl sound effects), a couple of her stylistic experiments pay off, especially the high-drama soul loop that underpins \"In My Bed\".\nBut Winehouse's slow public wreck isn't just an unfortunate thing that's happening to someone who happens to be a star, it's part of her act, and has been from the get-go-- which means it makes her audience complicit in it. Her favorite lyrical topic, even on her debut, is loving not wisely but too well; on \"Amy Amy Amy\", she's gently wagging a finger at herself about her fondness for bad-news boys. And her deliberate affectation of Holiday's unmistakable vocal tics can't help but suggest the narrative we're supposed to buy into: \"Great singer, tragically destroyed by her unhappy private life and bad habits, who turned her pain into universal art.\" (What are we as her audience supposed to do? Stage an intervention? Well, we can at least think very carefully about what our participation in that narrative means. And who are we to say we wish she'd stop going on about how she doesn't need any help and get some goddamn help already? Not vultures, that's who.) Winehouse is good enough that she was worth paying attention to for her music alone before her drama started ruining it, but in the light of her subsequent career, Frank comes off as the first chapter in the Romantic myth of the poet who feels too deeply and ends up killing herself for her audience's entertainment. And that is some bullshit.",
      "author": "Douglas Wolk",
      "published_date": "2007-11-14",
      "word_count": 576,
      "fetch_timestamp": "2025-08-20T08:19:54.962225",
      "metadata": {
        "char_count": 3490,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:19:54.962221"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/10032-back-to-black/",
      "source": "pitchfork",
      "artist_name": "Amy Winehouse",
      "title": "Amy Winehouse: Back to Black",
      "content": "---\ntitle: Amy Winehouse: Back to Black\nauthor: Joshua Klein\nurl: https://pitchfork.com/reviews/albums/10032-back-to-black/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2007-03-28\n---\n\"They tried to make me go to rehab,\" wails Amy Winehouse on the opening track and first single from her second album Back to Black. It's not typical pop song fodder, but Winehouse isn't a typical pop singer. If she winds up as popular in the U.S. as she is at home in the UK, it'll be despite her reluctance to embrace the monotonous realities of promotional mechanics. Oh, she'll talk, but there's no guarantee what she'll say. (Our favorite is her heckling of Bono at last year's Q Awards: \"Shut up, I don't give a fuck!\") She'll be scheduled to perform, but there's no guarantee what she'll do, or even if she'll make it through the show. And she'll sing about her problems, but she won't give a shit what you think of them.\nIf this makes Winehouse read a little like Lily Allen, that's not far off the mark. Both are larger-than-life singers who've found perfect vehicles for their outsized personalities. In Allen's case, it's a cocktail of pop, reggae, and hip-hop, with a cigarette in hand; for Winehouse, it's soul, jazz, and blues with a bottle of booze. Both pay tribute to their influences, with Winehouse's lyrics featuring shout-outs to Ray Charles, Donny Hathaway, and Slick Rick, and the two even share a producer: Mark Ronson, who's also worked with everyone from Sean Paul and Macy Gray to Ghostface and Rhymefest.\nBut Winehouse is anything but a Lily Allen doppelgänger. After all, soul and jazz music are typically considered the province of grownups, and while Winehouse could be accused of slipping on these styles like costumes, she imbues her music with a surprisingly genuine soulfulness.\nRonson's sneaky production provides most of the album's wit: The old school backdrop to \"Me & Mr. Jones\" is especially winking against couplets like \"What kind of fuckery is this? You made me miss the Slick Rick gig.\" But Winehouse's zingers (in that same song she tells her subject \"'side from Sammy you're my best black Jew\") and profane interjections (the title track begins \"He left no time to regret/ Kept his dick wet\") are only an occasional thing as she travels a well-worn lyrical path to both clinical and romantic rehabilitation.\nSongs like \"Love Is a Losing Game\" are full of regret, even if Winehouse refuses to wallow entirely in self-pity. However, as one might expect following the declaration of \"Rehab\", Winehouse does spend much of Back to Black on the defensive, trying to explain why she's stayed with the same guy who's done her wrong, or, in the case of \"Wake Up Alone\", why her ex gives her the night sweats (\"I drip for him tonight,\" Winehouse less delicately puts it).\nIt's one of the eternal themes of soul music, here spiced up with post-modern production where less forceful personalities might have gone with strictly retro emulation. The references to girl groups, northern soul, and ska are there, but no one would confuse these approximations (split evenly between Ronson and Salaam Remi, who produced Winehouse's since-disowned debut) with the real thing.\nFortunately, Winehouse has been blessed by a brassy voice that can transform even mundane sentiments into powerful statements. She may be heartbroken, but she uses that ache, twisting the emotional scars to suit her songs-- and if she often seems like the masochistic recipient of each knife twist, so be it. It's not until the album's final track, \"He Can Only Hold Her\", that Winehouse finally switches from first person to third, the \"I\"s and \"me\"s giving way to \"he\"s and \"she\"s, suggesting that she's finally become an objective observer, able to see her personal issues for what they are. \"He tries to pacify her, 'cause what's inside never dies,\" she sings, and we can only assume from this new vantage that Winehouse has moved on.",
      "author": "Joshua Klein",
      "published_date": "2007-03-28",
      "word_count": 656,
      "fetch_timestamp": "2025-08-20T08:19:54.993175",
      "metadata": {
        "char_count": 3930,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:19:54.993171"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "Amy Winehouse",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-20\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nRap\nStar Line\nChance the Rapper\nBy\nAlphonse Pierre\nAugust 20, 2025\nRock\nLove Is Like\nMaroon 5\nBy\nLinnie Greene\nAugust 20, 2025\nExperimental\nKhadim\nMark Ernestus’ Ndagga Rhythm Force\nBy\nRae-Aila Crumble\nAugust 20, 2025\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-20",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-20T08:19:55.476393",
      "metadata": {
        "char_count": 7698,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:19:55.476381"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/",
      "source": "pitchfork",
      "artist_name": "Amy Winehouse",
      "title": "The Pitchfork Review: All of the Latest Episodes",
      "content": "---\ntitle: The Pitchfork Review: All of the Latest Episodes\nauthor: Condé Nast\nurl: https://pitchfork.com/podcast/the-pitchfork-review/\nhostname: pitchfork.com\ndescription: Listen to every episode of Pitchfork’s podcast for music fans and obsessives.\nsitename: Pitchfork\ndate: 2024-01-11\ntags: ['web']\n---\nBrought to you by the music critics at Pitchfork, The Pitchfork Review is a show for music fans and obsessives who can’t wait to talk about the latest releases. Co-hosted by Pitchfork editor-in-chief Puja Patel and Reviews Editor Jeremy D. Larson, this podcast pulls back the curtain on our reviews and scores, dives deep into new music, and gives an expert guide to what’s exciting, what’s great, and what’s just plain terrible.\nListen to every episode of Pitchfork’s podcast for music fans and obsessives.\nRelated Articles\nThe Origins and Influence of Brian Eno’s Pioneering Album Ambient 1: Music for Airports\nIn the latest episode of Pitchfork’s podcast, our critics revisit the legendary producer’s classic 1978 LP, which was recently featured in our Sunday Review series.\nBy Pitchfork\nJeff Tweedy on Rock Criticism, the Pitfalls of Music Snobbery, and His New Book\nThe musician and author discusses World Within a Song, in which he writes about 50 songs that rearranged his brain, Wilco’s new album, and more.\nBy Pitchfork\nThe 2023 Music Grab Bag: Trends, Scandals, and Theories\nIn this episode of the Pitchfork Review podcast, our critics talk about the rise of the musical theater girlie, the fall of the 1975’s Matty Healy, and more. Plus: Alvvays’ Molly Rankin reveals the song she wishes she wrote.\nBy Pitchfork\nThe Best, Worst, and Most Surprising Albums of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about some of their faves from our 50 Best Albums of 2023 list and lament a few of the year’s biggest disappointments.\nBy Pitchfork\nWhy the Replacements’ Tim Is the Best Reissue of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about the revelatory new version of the beloved rock band’s 1985 LP. Plus, Replacements bassist Tommy Stinson reveals his perfect-10 album.\nBy Pitchfork\nBreaking Down Bad Bunny’s New Album and the Future of Puerto Rican Rap and Reggaeton\nIn this episode of The Pitchfork Review podcast, our critics dissect Bad Bunny’s latest and highlight a few new queer artists from Puerto Rico who are taking the island’s music to exciting new places.\nBy Pitchfork\nDebating the Best Songs of 2023, Part Two\nIn this episode of the Pitchfork Review podcast, our critics battle it out over some of their favorite songs of the year, by artists including Troye Sivan, Kendrick Lamar, Big Thief and more. Plus: Devendra Banhart tells us all about his dream collaboration.\nBy Pitchfork\nDebating the Best Songs of 2023, Part One\nIn this episode of the Pitchfork Review podcast, our critics take sides and discuss which tracks by some of 2023’s most exciting artists deserve a spot on our upcoming year-end lists.\nBy Pitchfork\nThe Good, the Bad, and the Swiftie of Taylor’s Eras Tour Concert Film\nIn this episode of The Pitchfork Review podcast, our critics wade through the ups and downs of the pop superstar’s new record-breaking live movie.\nBy Pitchfork\nWhat Drake Is Doing Wrong—and How He Can Fix It\nIn this episode of the Pitchfork Review podcast, our critics talk about what made them care about Drake in the first place, why his new album For All the Dogs is so frustratingly mid, and what he should do next.\nBy Pitchfork",
      "author": "Condé Nast",
      "published_date": "2024-01-11",
      "word_count": 579,
      "fetch_timestamp": "2025-08-20T08:19:55.528831",
      "metadata": {
        "char_count": 3506,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:19:55.528827"
      }
    },
    {
      "url": "https://pitchfork.com/features/afterword/8011-appreciation-amy-winehouse/",
      "source": "pitchfork",
      "artist_name": "Amy Winehouse",
      "title": "Amy Winehouse",
      "content": "---\ntitle: Amy Winehouse\nauthor: Jess Harvell\nurl: https://pitchfork.com/features/afterword/8011-appreciation-amy-winehouse/\nhostname: pitchfork.com\ndescription: Following her death at age 27, a look at the soul singer's music and troubled life.\nsitename: Pitchfork\ndate: 2011-07-23\ncategories: ['features']\n---\nAmy Winehouse passed away on Saturday, and public reaction to the news says quite a bit about the arc of her short career, most of it very sad and some of it downright ugly. While distraught, not even her fans seemed particularly surprised that Winehouse died. Perhaps that's specific to this case, or perhaps it's simply because, in the history of pop music, the early death of the quick-rising phenomenon has become depressingly common-- especially if that phenom also happens to be an addict. While every artist wants to reach an audience, it's only a select few who discover they're emotionally hard enough to withstand the machinery of celebrity on a massive scale. Some opt out entirely; some get hard, quick.\nAnd some, like Winehouse, crash in an awful fashion. Her talent made her a celebrity in her early 20s, a time when most of us are struggling to find our way without the handicap of intense media scrutiny. We live in an era when pursuing stardom for its own sake is an icky-- and, at times, impossible to look away from-- reality. So it may be difficult for certain people to understand why someone like Winehouse could view such attention as not only an impediment to her music but an actual emotional burden. She never seemed like someone secretly proud of her excesses, who wanted her every failing recorded for posterity or at least YouTube. But the cameras seemed to find her every time she was being humanly imperfect anyway.\nWinehouse was one of the first new stars to have each personal foible and public fuck-up mercilessly picked apart 24/7 online and in the papers and on TV-- a din of constant criticism that had more to do with schadenfreude than anything resembling journalism. But whatever her feelings on the media's gaze, it's also pointless to speculate on the reasons why Winehouse became a very public addict and an intermittent musician after the success of her 2006 breakthrough Back to Black. \"Instant celebrity\" and the attendant stress is one possibility out of millions. Whatever drove her to hard drugs and all the bad decisions that come with them, though, it's undeniable that she spent the last four years courting death, and making records became less important than trying to avoid overdoses, jail time, severe health risks, and paparazzi lenses.\nWhen a video of Winehouse smoking crack started making the blog rounds in 2008, it marked a decisive and depressing turning point in her public profile. She began by being hailed as a musical up-and-comer of great skill, a breakout star in an idiom that didn't get much pop radio airplay at the time, a trend-setter, the voice that launched a thousand torch singers under 25. For millions who never needed to hear a note of her music, she quickly became just another \"entertainingly\" self-destructive celebrity, someone who could have worked in any art form or none at all. For Winehouse's fans, that was the extra-cruel twist to an already lamentable tale: Here was a singer and songwriter of immense gifts being equated with some talent-free reality TV star found reeling on cocaine outside a Hollywood club. And plus hey: Aren't all addicts deserving of empathy rather than derision, talented and talent-free alike, especially if the only harm they seem to be causing is to themselves?\nIt's clear that Winehouse wanted to turn things around. There were reports she was working on a new album. Recently, a \"comeback\" tour (for an artist \"gone\" less than three years) was planned. But addiction and the mindset that comes with it is not something that can be conquered on demand, in order to fit a tour schedule or keep to a recording budget. The tour was abandoned after a handful of shows ended messily or worse. Fans held out hope, but a triumphant return from a clean-and-sober Winehouse still seemed like a fairly far-off possibility in 2011.\nI wanted to get all of that out of the way up front, because I don't want Winehouse's tragic final days to be the final takeaway from this appreciation. It's impossible to discuss her life and work honestly while glossing the self-destructive parts because those parts took up half of a career that lasted only eight years. But it was the music that first made Winehouse a star, no mean feat at a time when acts with no. 1 singles can have zero profile outside of pop itself. And it's the music, ultimately, that Winehouse should be remembered for.\nIt's also inappropriate to sweep aside the dark stuff because those bleaker feelings found their way into Winehouse's songwriting from the very beginning. She was one of the great spoonful-of-sugar acts in modern pop, a singer able to turn personal anguish into songs more pleasurable than painful. It was an approach she took from the classic soul and R&B that critics sometimes claimed she appropriated on only a surface level, writing singles that sound buoyant and strong-willed until you unpack the lyrics. It was only then you realized that \"Rehab\" is uncommonly blunt and uninterested in self-deception in its depiction of someone who knows they're numbing themselves to compensate for a feeling of intense isolation. Or that \"Tears Dry on Their Own\" is uncommonly nuanced and free of self-pity in the way it explores the weakness of not being able to let go of a relationship, a subject that reduces too many singers of both genders into simps.\nWinehouse was never one for \"light\" subject matter. In another genre-- say, confessional coffee-shop folk-- her most self-lacerating moments might have come off too maudlin to bear. But the songs have a confidence gleaned from Motown and a swagger learned from rap that makes all the difference. Even down and out, she could still throw down, kick it out. It was the attitude and self-possession she exuded on tape that remains startling, whatever her extra-musical activities of the last few years.\nBorn in 1983, Winehouse was a product of the 1990s musically. She came of age as a listener just as hip-hop became inescapably pop. From it, you suspect she learned not only an appreciation of old-school sonics but an attitude-- a way to make the feel of classic soul and jazz resonate for a modern audience. She was swept up into the industry before she was even out of her teens. It's easy to assume her label groomers heard that voice and assumed they had another slick supper-club style singer they could sell to an audience who'd been holding their noses since new jack swing came in. But if Winehouse was smitten with the style and brassiness of 60s girl groups, she also knew that hewing to their hand-holding innuendo and era-enforced cuteness would make her an indie curio or a nostalgia trip for pop snobs. On the other hand, if you merged the craft of 60s pop and soul with something sardonic and self-revealing and totally candid, you might have something too personal to be easily dismissed as mimicry.\nIt's possible Winehouse wasn't consciously thinking about any of this. But it's also true that she named her first album Frank. Released in 2003, when Winehouse was just 20, it's musically uneven to say the least; half perfectly realized fusion of modern attitude and antique musicianship, half undercooked pastiche of various \"classy\" styles, all of it a little too genteel. You can hear the career plans her label had concocted-- jazz festivals full of ballad singers, upscale night clubs where things never got too loud, ample pockets of downtempo fans-- cracking under Winehouse's own ideas about her direction.\nIf the music occasionally recalls the antiseptic dead-end of acid jazz, few London divas chasing the Straight No Chaser crowd would have titled a song \"Fuck Me Pumps\", even if the song itself was a neo-soul tsk-tsk critique of fashion-and-money-obsessed young women. Winehouse's don't-give-a-fuck boldness made her feel closer to contemporary R&B than the \"so-and-so rerecords the classic songbook\" crowd, even if her sound had almost zero to do with the Neptunes-esque digital crunch that ruled the radio at the time.\nThree years later, Back to Black hit as a gutsy statement of intent. Winehouse and producers Salaam Remi and Mark Ronson unified sound and vision, ditching the sometimes soft-focus backing tracks of Frank for something tougher, richer, more immediate. Back to Black is so well constructed that it's actually hard to guess who brought what to the studio. Remi was the established hip-hop producer; Ronson was the retro-obsessed jack-of-all-trades. Ronson's work certainly suggests a guy who put in many hours studying the classic backing units of the 60s, but it's only the kick of the drums on tracks like the Remi-credited \"He Can Only Hold Her\" that suggests a guy who came up in the world of loops rather than roadhouse-trained bands. The trio's work meshes so well that you'd suspect there was one creative hand at work until you checked the liner notes. Much of that cohesiveness may be credited to backing band the Dap-Kings, a group that had already proven themselves old hands at recreating vintage soul and could switch between the tenderness of Hi Records and the knock of DJ Premier with ease.\nStill, it's Winehouse's songwriting and voice-- her point-blank self-recrimination and her slyly withering humor-- that defines the album. Dozens of retro-soul albums are released every year. The ones without Winehouse's force of personality and pure skill tend to sink from view immediately. With support from the most sympathetic collaborators around, Winehouse was both technically more assured and more unrepentantly individual than most. \"Rehab\" remains one of the strangest bits of pop self-criticism of the last decade, and it's hard to imagine any hit-seeker writing those down-but-defiant verses, or trying to sell them with Winehouse's strange mix of boldness and introversion. It's no mere imitation.\nThat's what makes Winehouse's loss so acute from a musical standpoint, and it's what the legions of trend-grabbers and American Idol hopefuls essaying her songs never quite get. She could do a straight, tearful ballad like \"Love is a Losing Game\", something you could imagine any number of singers adequately covering. But in Winehouse's best songs, there's always something odd, pained, and ineluctably personal in lyric and voice alike. Record execs will likely be grateful that Winehouse's brief success opened up a lucrative market for \"real\" music. Listeners can lament the fact that we lost someone who understood that \"realness\" is a sham without the candor and distinctiveness to back up the chops.",
      "author": "Jess Harvell",
      "published_date": "2011-07-23",
      "word_count": 1789,
      "fetch_timestamp": "2025-08-20T08:19:55.552761",
      "metadata": {
        "char_count": 10831,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:19:55.552756"
      }
    },
    {
      "url": "https://pitchfork.com/features/",
      "source": "pitchfork",
      "artist_name": "Amy Winehouse",
      "title": "Music Articles & Features",
      "content": "---\ntitle: Music Articles & Features\nauthor: Condé Nast\nurl: https://pitchfork.com/features/\nhostname: pitchfork.com\ndescription: Longform and in-depth analysis about the most exciting and important music being released today\nsitename: Pitchfork\ndate: 2025-08-14\ntags: ['web']\n---\nDekmantel Is a Dance Festival Shedding Light on the Underground\nWe touched down in Amsterdam for the 2025 edition of the left-of-center electronic festival and came back with some thoughts about live sets, drum heads, speaker cabinets, bass fiends, techno lords, and the simple power of naming some club-ready bangers.\nBy Jeremy D. Larson\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nNight Out 2025: Pitchfork and Them’s Showcase for the Future of Queer Music\nBy Olivier LafontantPhotography by Dillon Edlin\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nWhat Happened at Pitchfork’s Bladee Zine Launch\nBy PitchforkPhotography by Caroline Friedman\nA Rare Interview With Bladee, the Mystic Oracle of Internet Rap\nBy Meaghan GarveyPhotography by Jason Nocito\nHighlights From Pitchfork’s 2024 Year in Music Club Night\nBy PitchforkPhotography by Sam Wachs\nHighlights From Pitchfork and Thought Enthusiast’s Year in Music Panel\nBy PitchforkPhotography by Sam Wachs\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 18 Best Moments From Pitchfork Music Festival 2024\nBy Boutayna Chokrane, Nina Corcoran, and Heven Haile\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nHow Waxahatchee Made the Album of Her (Second) Life\nBy Andy CushPhotography by Bobby Doherty\nChasing the Goblin With Mabe Fratti, the Guatemalan Cellist at the Heart of Mexico City’s Avant-Rock Scene\nBy Philip SherburnePhotography by Filip Preis",
      "author": "Condé Nast",
      "published_date": "2025-08-14",
      "word_count": 347,
      "fetch_timestamp": "2025-08-20T08:19:55.834801",
      "metadata": {
        "char_count": 2280,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:19:55.834792"
      }
    },
    {
      "url": "https://pitchfork.com/features/lists-and-guides/",
      "source": "pitchfork",
      "artist_name": "Amy Winehouse",
      "title": "Lists & Guides",
      "content": "---\ntitle: Lists & Guides\nauthor: Condé Nast\nurl: https://pitchfork.com/features/lists-and-guides/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2025-08-06\ntags: ['web']\n---\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nThe 62 Best Albums of 2023 So Far\nBy Dylan Green, Anna Gaca, Jeremy D. Larson, Sam Sodomsky, and Cat Zhang\nThe 48 Most Anticipated Albums of Fall 2023\nBy Madison Bloom, Nina Corcoran, Allison Hussey, Hattie Lindert, Evan Minsker, Jazz Monroe, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres\n17 Artists on Their All-Time Favorite Rap Songs\nBy Andy Cush, Jayson Greene, Clover Hope, and Alphonse Pierre\nThese Queens Can Sing: The 15 Best Songs by Today’s Drag Performers\nBy Julianne Escobedo Shepherd\nThe 30 Best Queer Music Movies\nBy Eric Torres, Nadine Smith, Tatiana Lee Rodriguez, Michelle Hyun Kim, and Emma Madden\nThe 46 Most Anticipated Albums of Summer 2023\nBy Alphonse Pierre, Madison Bloom, Evan Minsker, Eric Torres, Allison Hussey, Nina Corcoran, Jazz Monroe, Marc Hogan, and Matthew Ismael Ruiz\nThe 30 Best Music Festivals of 2023\nBy Evan Minsker, Jazz Monroe, Allison Hussey, Madison Bloom, Nina Corcoran, Eric Torres, and Matthew Strauss\nThe 43 Most Anticipated Albums of Spring 2023\nBy Jazz Monroe, Evan Minsker, Allison Hussey, Eric Torres, Nina Corcoran, Madison Bloom, and Matthew Strauss\nThe 34 Most Anticipated Albums of 2023\nBy Jazz Monroe, Rob Arcand, Marc Hogan, Eric Torres, Allison Hussey, Nina Corcoran, and Matthew Strauss\nThe 34 Most Anticipated Albums of Fall 2022\nBy Rob Arcand, Madison Bloom, Jane Bua, Nina Corcoran, Heven Haile, Allison Hussey, Evan Minsker, Jazz Monroe, Quinn Moreland, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres\nThe 37 Most Anticipated Albums of Summer 2022\nBy Madison Bloom, Nina Corcoran, Allison Hussey, Evan Minsker, Quinn Moreland, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres",
      "author": "Condé Nast",
      "published_date": "2025-08-06",
      "word_count": 410,
      "fetch_timestamp": "2025-08-20T08:19:56.124298",
      "metadata": {
        "char_count": 2614,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:19:56.124291"
      }
    },
    {
      "url": "https://pitchfork.com/features/5-10-15-20/",
      "source": "pitchfork",
      "artist_name": "Amy Winehouse",
      "title": "5-10-15-20",
      "content": "---\ntitle: 5-10-15-20\nauthor: Condé Nast\nurl: https://pitchfork.com/features/5-10-15-20/\nhostname: pitchfork.com\ndescription: Talking to our favorites artists about the music of their lives, five years at a time\nsitename: Pitchfork\ndate: 2025-08-01\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\n5-10-15-20\nTalking to our favorite artists about the music of their lives, five years at a time\nAll\nLists & Guides\n5-10-15-20\nInterview\nLongform\nCover Story\nRising\nInteractives\nPodcast\n5-10-15-20\nCardo Got Wings on the Music That Made Him\nBy\nSerge Selenou\nAugust 1, 2025\n5-10-15-20\nHaruomi Hosono on the Music That Made Him\nBy\nJoshua Minsoo Kim\nJune 18, 2025\n5-10-15-20\nDJ Koze on the Music That Made Him\nBy\nLaura Snapes\nApril 8, 2025\n5-10-15-20\nAdam Scott on the Music That Made Him\nBy\nJeremy D. Larson\nMarch 21, 2025\n5-10-15-20\nMax Richter on the Music That Made Him\nBy\nJazz Monroe\nSeptember 4, 2024\n5-10-15-20\nLiz Phair on the Music That Made Her\nBy\nJill Mapes\nNovember 20, 2023\n5-10-15-20\nJohn Mulaney on the Music That Made Him\nBy\nEvan Minsker\nOctober 19, 2023\n5-10-15-20\nBlonde Redhead’s Kazu Makino on the Music That Made Her\nBy\nNina Corcoran\nOctober 2, 2023\n5-10-15-20\nBlack Thought on the Music That Made Him\nBy\nRyan Leas\nAugust 22, 2023\n5-10-15-20\nThe Music That Made Cosmic Bluesman Lonnie Holley\nBy\nMadison Bloom\nMarch 27, 2023\n5-10-15-20\nDJ Premier on the Music That Made Him\nBy\nDylan Green\nDecember 12, 2022\n5-10-15-20\nFreddie Gibbs on the Music That Made Him\nBy\nDylan Green\nNovember 17, 2022\n5-10-15-20\nBabyface on the Music That Made Him\nBy\nClover Hope\nOctober 3, 2022\n5-10-15-20\nBeth Orton on the Music That Made Her\nBy\nAllison Hussey\nSeptember 8, 2022\n5-10-15-20\nJazz Innovator Vijay Iyer on the Music That Made Him\nBy\nNate Chinen\nJune 28, 2022\n5-10-15-20\nThe Neptunes’ Chad Hugo on the Music That Made Him\nBy\nAlphonse Pierre\nJune 14, 2022\n5-10-15-20\nThe Music That Made Cyndi Lauper\nBy\nJill Mapes\nJune 8, 2022\n5-10-15-20\nThe Music That Made R&B Rebel Swamp Dogg\nBy\nMadison Bloom\nApril 26, 2022\n5-10-15-20\nLavender Country’s Patrick Haggerty on the Music That Made Him\nBy\nAllison Hussey\nMarch 15, 2022\n5-10-15-20\nJuliette Lewis on the Music That Made Her\nBy\nQuinn Moreland\nFebruary 15, 2022\n5-10-15-20\nMichael Stipe on the Music That Made Him\nBy\nRyan Dombal\nNovember 10, 2021\n5-10-15-20\nTori Amos on the Music That Shaped Her Life\nBy\nEric Torres\nNovember 1, 2021\n5-10-15-20\nElvis Costello on the Music of His Life\nBy\nMadison Bloom\nNovember 30, 2020\n5-10-15-20\nAimee Mann on the Music That Made Her\nBy\nEric Torres\nNovember 24, 2020\n5-10-15-20\nThe Music That Made Beverly Glenn-Copeland\nBy\nJesse Dorris\nNovember 5, 2020\n5-10-15-20\nThrowing Muses’ Kristin Hersh on the Music That Made Her\nBy\nPhilip Sherburne\nOctober 28, 2020\n5-10-15-20\nThe Music That Made Miranda July\nBy\nQuinn Moreland\nOctober 20, 2020\n5-10-15-20\nTom Morello on the Music of His Life\nBy\nMatthew Ismael Ruiz\nSeptember 10, 2020\n5-10-15-20\nThe Music That Made Conor Oberst\nBy\nSam Sodomsky\nAugust 21, 2020\n5-10-15-20\nThe Music That Made Laraaji\nBy\nIsabelia Herrera\nAugust 5, 2020\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-01",
      "word_count": 545,
      "fetch_timestamp": "2025-08-20T08:19:56.275987",
      "metadata": {
        "char_count": 3216,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:19:56.275982"
      }
    }
  ],
  "total_articles": 10,
  "total_words": 7266,
  "extracted_at": "2025-08-20T08:19:56.276414",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/21214-amy-the-original-soundtrack/",
    "https://pitchfork.com/reviews/albums/17295-at-the-bbc/",
    "https://pitchfork.com/reviews/albums/10900-frank/",
    "https://pitchfork.com/reviews/albums/10032-back-to-black/",
    "https://pitchfork.com/reviews/albums/",
    "https://pitchfork.com/features/podcast/",
    "https://pitchfork.com/features/afterword/8011-appreciation-amy-winehouse/",
    "https://pitchfork.com/features/",
    "https://pitchfork.com/features/lists-and-guides/",
    "https://pitchfork.com/features/5-10-15-20/"
  ]
}