{
  "artist_name": "John Lennon",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/music/rock/john-lennon-yoko-ono-one-to-one-john-yoko-doc-trailer-watch-1235921027/",
      "source": "billboard",
      "artist_name": "John Lennon",
      "title": "John Lennon and Yoko Ono Fall in Love With New York in First ‘One to One: John & Yoko’ Doc Trailer",
      "content": "---\ntitle: John Lennon and Yoko Ono Fall in Love With New York in First ‘One to One: John & Yoko’ Doc Trailer\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/rock/john-lennon-yoko-ono-one-to-one-john-yoko-doc-trailer-watch-1235921027/\nhostname: billboard.com\ndescription: John Lennon and Yoko Ono fall in love with New York and plan charity concert in first 'One to One: John & Yoko' doc trailer: watch.\nsitename: Billboard\ndate: 2025-03-13\ncategories: ['Rock']\ntags: ['genre rock, movie, Music News']\n---\nJohn Lennon and Yoko Ono were never shy about sharing their love story with the cameras. The late Beatle and his wife/Plastic Ono Band co-leader are center stage in the first trailer for One to One: John & Yoko, an upcoming documentary from Oscar-winning director Kevin Macdonald that tells the story of a life-changing, fast-moving 18-month period in the couple’s lives in the early 1970s.\nThe two-minute clip opens with audio of Lennon calling someone named Howard, in which the woman on the other end begins to spell out the singer’s name only to realize who she’s talking to. “You’re a member of the Beatles?” she asks. “That’s right, yeah,” Lennon answers nonchalantly. From there, the footage explodes into a collage of images of bombs falling in the Vietnam war and the couple preparing for a charity show as Lennon says, “good morning, folks. Have you had your breakfast yet,” accompanied by, yes, footage of the pop icon having his bowl of morning cereal.\nTrending on Billboard\nWe see a flip-book of footage of John and Yoko leaning into their new lives in the city, shopping for clothes and goofing around with friends as Yoko says, “the Flower Generation is over, but we can start all over again, right?,” which leads into a famous image of the couple from behind throwing up raised fists as the Statue of Liberty hovers on the horizon.\nThe movie is a chronicle of the couple’s new life in New York post-Beatles in 1972, following them as they move into an apartment in Greenwich Village and prepare for their One to One Concerts, a two-show all-star charity event for children with special needs that they threw at Madison Square Garden in August 1972. It was the only full-length performance by Lennon in the wake of the Fab Four’s split two years earlier and in addition to the Plastic Ono Band it featured sets by Stevie Wonder, Sha Na Na and Roberta Black, among others.\nAsked by a reporter at the time why they were doing the free shows, Lennon said, “to change the apathy that the youth have.” The couple’s only child, musician Sean Ono Lennon — seen in clips as a toddler — produced and remixed the concert audio for the movie, with the trailer ending with footage of Lennon , wearing his signature tinted round eyeglasses, performing his signature hit “Imagine” at the concerts.\nThe film also features newly transferred and restored footage from that era along with previously unseen and unheard items from the couple’s personal archives, including phone calls and home movies recorded and filmed by Lennon and Ono during the 18 months the couple lived in a cramped Greenwich Village apartment in the early 1970s.\n“How would you like to be remembered?” a reporter asks Lennon at one point. “Just as two lovers,” he responds. The movie will be released exclusively in IMAX on April 11 and in wider release on April 18 and then stream later this year on Max.\nWatch the One to One trailer below.",
      "author": "Gil Kaufman",
      "published_date": "2025-03-13",
      "word_count": 578,
      "fetch_timestamp": "2025-08-20T18:06:41.508917",
      "metadata": {
        "char_count": 3427,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T18:06:41.508899"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/sean-lennon-reflects-on-yoko-ono-life-after-john-lennon-she-never-has-moved-on-1235845210/",
      "source": "billboard",
      "artist_name": "John Lennon",
      "title": "Sean Lennon Reflects on Yoko Ono’s Life After John Lennon: ‘She Never Has Moved On’",
      "content": "---\ntitle: Sean Lennon Reflects on Yoko Ono’s Life After John Lennon: ‘She Never Has Moved On’\nauthor: Tyler Jenke\nurl: https://www.billboard.com/music/music-news/sean-lennon-reflects-on-yoko-ono-life-after-john-lennon-she-never-has-moved-on-1235845210/\nhostname: billboard.com\ndescription: Sean also touched upon his mother's presence on 1973's 'Mind Games' album, recorded in the midst of John's lost weekend period.\nsitename: Billboard\ndate: 2024-12-05\ncategories: ['Music News']\ntags: ['John Lennon, Sean Lennon, yoko ono']\n---\nSean Lennon has reflected on the impact that John Lennon‘s passing had upon his mother, Yoko Ono.\nOn Sunday (Dec. 8), Sean and the rest of his family will mark the 44th anniversary of father John’s death in New York City in 1980. Viewed by many as another example of ‘the day the music died’, Lennon’s untimely passing has had an impact on countless individuals throughout the world. No more have felt that impact, Sean says, than his mother.\nSpeaking to BBC Radio 6 Music about the recent Grammy-nominated expanded box set of John’s 1973 Mind Games album, Sean touched on his parents’ relationship around the record’s creation. At the time of Mind Games’ writing, John was in the midst of the 18-month ‘lost weekend’ period in which he was separated from Ono.\n“A lot of people said like, ‘Yoko wasn’t around for this record, why are they featuring her in the booklet’ or something,” Lennon began. “And I think there’s a lot of history, there’s a lot of assumptions made about that time period because they were sort of on their way towards that famous separation that people called The Lost Weekend.\n“But the truth is, even when they were apart they were always talking, so I don’t think they ever really broke up, all his stuff was still in the apartment with my mum, it’s not like they had a real separation. And on top of it, all my dad was thinking about was her.\nTrending on Billboard\n“You look at the album cover, it’s a collage of my mum literally the size of a mountain, and he’s this little tiny thing sort of fading into the background” he continued. “And I think it’s clear what his view of my mum was in his life. She was monumental, obviously. And the whole album is about her.”\nSpeaking about his mother directly, Sean claimed that she “never has moved on from that relationship” since John’s passing, but agreed that the recent Mind Games release was something of a “love letter” to his parents.\n“I’ve never put it that way but I would say it’s my best effort to try to be a good son,” Sean replied.",
      "author": "Tyler Jenke",
      "published_date": "2024-12-05",
      "word_count": 428,
      "fetch_timestamp": "2025-08-20T18:06:41.561786",
      "metadata": {
        "char_count": 2547,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:06:41.561779"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/handwritten-letter-from-john-lennon-eric-clapton-heading-auction-1235840203/",
      "source": "billboard",
      "artist_name": "John Lennon",
      "title": "Handwritten Letter from John Lennon to Eric Clapton Heading to Auction",
      "content": "---\ntitle: Handwritten Letter from John Lennon to Eric Clapton Heading to Auction\nauthor: Tyler Jenke\nurl: https://www.billboard.com/music/music-news/handwritten-letter-from-john-lennon-eric-clapton-heading-auction-1235840203/\nhostname: billboard.com\ndescription: The eight-page draft letter features John Lennon urging Eric Clapton to join a new band he was putting together.\nsitename: Billboard\ndate: 2024-11-27\ncategories: ['Music News']\ntags: ['ERIC CLAPTON, John Lennon']\n---\nA handwritten letter which sees John Lennon pitching a new band to Eric Clapton is going under the auctioneer’s hammer.\nThe eight-page letter, which is dated Sept. 29, 1971, is a draft of the final version which was sent to Clapton that same year. Helmed by International Autograph Auctions Europe SL, the missive will go to auction on Dec. 5 for an expected sale of €100,000 – €150,000 (approximately $104,000 – $157,000), with bidding registrations open now.\nThe contents of the letter show the beginnings of what could have been an interesting chapter in the story of rock music, with Lennon asking Clapton to form a new band.\n“You must know by now that Yoko and I rate your music and yourself very highly, always have,” the letter begins. As Lennon continues, he touches on Clapton’s then-current dark period, which was marred by heroin addiction and a retreat from public appearances.\nTrending on Billboard\n“Eric, I know I can bring out something great, in fact greater in you that had been so far evident in your music,” Lennon adds. “I hope to bring out the same kind of greatness in all of us, which I know will happen if/when we get together.”\nThe letter ultimately pitches the idea of Clapton performing as part of the prospective band, which would have included previous Plastic Ono Band members Klaus Voorman, Jim Keltner, Nicky Hopkins, and Phil Spector. “And of course we had YOU!!! in mind as soon as we decided,” it continues.\nBy the time of the letter’s writing, Clapton had previously performed as part of the Plastic Ono Band, appearing as part of the iterations of the group that existed between September and December 1969.\n“Please don’t be frightened, I understand paranoia, only too well,” Lennon adds to the expectedly-hesitant at the close of his letter. “I think it could only do good for you to work with people who love and respect you, and that’s from all of us.”\nUltimately, Clapton would turn down Lennon’s offer of joining the nascent band of “superstars”.\nThe draft of the letter also includes numerous corrections and edits, though it’s unknown what the final version that was sent to Clapton looked like. This isn’t the first time the letter has gone up for sale, however, with a 2012 auction expecting the item to sell for a total of $30,000.",
      "author": "Tyler Jenke",
      "published_date": "2024-11-27",
      "word_count": 448,
      "fetch_timestamp": "2025-08-20T18:06:41.613355",
      "metadata": {
        "char_count": 2759,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T18:06:41.613347"
      }
    },
    {
      "url": "https://www.billboard.com/culture/product-recommendations/john-and-paul-a-love-story-in-songs-where-to-buy-online-1235951083/",
      "source": "billboard",
      "artist_name": "John Lennon",
      "title": "‘John & Paul: A Love Story in Songs’ Takes a Closer Look at The Beatles’ Songwriting Duo",
      "content": "---\ntitle: ‘John & Paul: A Love Story in Songs’ Takes a Closer Look at The Beatles’ Songwriting Duo\nauthor: Rudie Obias\nurl: https://www.billboard.com/culture/product-recommendations/john-and-paul-a-love-story-in-songs-where-to-buy-online-1235951083/\nhostname: billboard.com\ndescription: 'John & Paul: A Love Story in Songs' follows John Lennon and Paul McCartney’s relationship in songwriting. Here's how to find and buy the book online.\nsitename: Billboard\ndate: 2025-04-21\ncategories: ['Product Recommendations']\ntags: ['Amazon, NOADS, Product Recommendations']\n---\nAll products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\nWith massive hits such as “I Want to Hold Your Hand,” “She Loves You,” “Can’t Buy Me Love,” “A Hard Day’s Night” and more, The Beatles have been a timeless and classic rock band spanning generations of fans. Songwriters John Lennon and Paul McCartney fueled the music, and a new biography takes a closer look at their deep and complicated relationship.\nOn sale for $20.88 (regularly $32) on Amazon, John & Paul: A Love Story in Songs follows Lennon and McCartney’s relationship as songwriters, lyricists and bandmates in The Beatles. Author Ian Leslie drew from tunes, film footage and recordings to paint a picture of two musicians working together to create some of the greatest songs of the 20th century.\nIf you’re an Amazon Prime member, you can order now, and John & Paul: A Love Story in Songs will be delivered to your home in less than two days once it’s released thanks to Prime Delivery.\nNot a member? Sign up for a 30-day free trial to take advantage of all that Amazon Prime has to offer, including access to Prime Video, Prime Gaming and Amazon Photos; fast, free shipping in less than two days with Prime Delivery; in-store discounts at Whole Foods Market; access to exclusive shopping events — such as Prime Day and Black Friday — and much more. Learn more about Amazon Prime and its benefits here.\nThe memoir is also available at BookShop.org for $29.76, while John & Paul: A Love Story in Songs is buyable at Barnes & Noble priced also at $29.\nIn addition, John & Paul: A Love Story in Songs is available as an Audible audiobook, which is only $0.99 for subscribers only.\nIf you’re not a subscriber, you can sign up for a 30-day free trial. But right now, Audible has a new promotion that gives new subscribers three months of service for just $0.99 per month. You’ll receive one credit for any audiobook on Audible. But act fast and sign up now — this deal ends on Wednesday, April 30.\nThroughout their careers in music, Lennon (who died in 1980) and McCartney have seven Grammy Awards as songwriters in The Beatles, including best performance by a vocal group for “A Hard Day’s Night,” album of the year for “Revolver” and “Sgt. Pepper’s Lonely Hearts Club Band” and others.\nWant more? For more product recommendations, check out our roundups of the best Xbox deals, studio headphones and Nintendo Switch accessories.",
      "author": "Rudie Obias",
      "published_date": "2025-04-21",
      "word_count": 510,
      "fetch_timestamp": "2025-08-20T18:06:42.367977",
      "metadata": {
        "char_count": 3141,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T18:06:42.367971"
      }
    }
  ],
  "total_articles": 4,
  "total_words": 1964,
  "extracted_at": "2025-08-20T18:06:42.368312",
  "urls_processed": [
    "https://www.billboard.com/music/rock/john-lennon-yoko-ono-one-to-one-john-yoko-doc-trailer-watch-1235921027/",
    "https://www.billboard.com/music/music-news/sean-lennon-reflects-on-yoko-ono-life-after-john-lennon-she-never-has-moved-on-1235845210/",
    "https://www.billboard.com/music/music-news/handwritten-letter-from-john-lennon-eric-clapton-heading-auction-1235840203/",
    "https://www.billboard.com/culture/product-recommendations/john-and-paul-a-love-story-in-songs-where-to-buy-online-1235951083/"
  ]
}