{
  "artist_name": "50 Cent",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/music/rb-hip-hop/50-cent-street-fighter-movie-balrog-1236008598/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "50 Cent Is Taking ‘No Days Off’ to Star in Upcoming ‘Street Fighter’ Movie",
      "content": "---\ntitle: 50 Cent Is Taking ‘No Days Off’ to Star in Upcoming ‘Street Fighter’ Movie\nauthor: Michael Saponara\nurl: https://www.billboard.com/music/rb-hip-hop/50-cent-street-fighter-movie-balrog-1236008598/\nhostname: billboard.com\ndescription: 50 Cent has been cast in the upcoming 'Street Fighter' movie. He's set to play the role of Balrog.\nsitename: Billboard\ndate: 2025-06-26\ncategories: ['R&B/Hip-Hop']\ntags: ['genre hiphop, movies and TV, Music News']\n---\n50 Cent is heading back to the silver screen, as the G-Unit mogul — born Curtis Jackson — is slated to star in the upcoming Street Fighter movie.\nAccording to The Hollywood Reporter, 50 will be joining a star-studded cast that includes Jason Momoa, Noah Centineo, country singer Orville Peck and WWE superstar Roman Reigns (Joe Anoa’i).\n50 Cent is slated to play the role of Balrog, a former boxer who serves as the feisty security guard of the movie’s villain. THR’s sources claim that 50 has been training for the role and the 49-year-old is set to perform his own stunts.\nTrending on Billboard\n“No Days off, Let’s work all roads lead to Shreveport Boom,” 50 wrote to Instagram earlier this week when celebrating the new role.\nTony Yayo, Uncle Murda, Royce Da 5’9 and former NBA star Quentin Richardson hopped into the comment to salute 50’s grind in the film world.\nA fan chimed in: “Boxer and a goon for Bison? This has 50 written all over it!”\n50 Cent’s been busy in recent years when it comes to his Hollywood endeavors. He’s going to star in the upcoming horror film SkillHouse, which hits theaters in July, and Deon Taylor’s upcoming Free Agents film. 50 also notched roles in Boneyard and The Expendables 4.\nKitao Sakuri is on board as director of Street Fighter, with production scheduled to kick off in Australia in August. Street Fighter, which began as an arcade game in the 1980s, had its most recent release with Street Fighter 6 arriving in 2023.",
      "author": "Michael Saponara",
      "published_date": "2025-06-26",
      "word_count": 317,
      "fetch_timestamp": "2025-08-20T16:21:48.586731",
      "metadata": {
        "char_count": 1924,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:48.586719"
      }
    },
    {
      "url": "https://www.billboard.com/music/rb-hip-hop/50-cent-dave-blunts-diss-1236028321/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "50 Cent Threatens to Push Dave Blunts Down a Flight of Stairs, Blunts Responds With Vulgar Diss",
      "content": "---\ntitle: 50 Cent Threatens to Push Dave Blunts Down a Flight of Stairs, Blunts Responds With Vulgar Diss\nauthor: Mackenzie Cummings-Grady\nurl: https://www.billboard.com/music/rb-hip-hop/50-cent-dave-blunts-diss-1236028321/\nhostname: billboard.com\ndescription: 50 Cent threatened to push Dave Blunts down a flight of stairs on Instagram, prompting Blunts to respond with a scathing diss.\nsitename: Billboard\ndate: 2025-07-23\ncategories: ['R&B/Hip-Hop']\ntags: ['genre hiphop']\n---\n50 Cent threatened to push Dave Blunts down a flight of stairs on Instagram, prompting Blunts to respond with a scathing diss track.\nSeemingly unprompted, 50 Cent shared a since-deleted photo of Blunts on his Instagram on Sunday (July 20), writing: “Ye this ya manz, if I catch him im pushing down the stairs.”\nDave didn’t let that insult slide, and targeted 50 Cent’s 2011 film All Things Fall Apart in a response on Instagram. 50 Cent had lost significant weight during his time on that film. “I been going to the gym and been locked in on my health journey the world is watching me lose weight but you lost all that weight for that weak ass movie and nobody watched that shit,” Dave captioned a photo of 50 from the movie.\nIn a separate post on Monday (July 21), Blunts then hit the studio to record an official diss record aimed at the Power mogul.\n“Curtis Jackson wanna diss me, n—a must be smoking on Fent,” Blunts raps in the clip. “Heard ya baby mama caught a c—mshot, nine times, that’s 50 Cent/ And I just got in the rap game but I’m ’bout as big as it gets/ Why the f—k is this old n—a mad, ’cause his baby mama eating s—t.”\nTrending on Billboard\nElsewhere on the track, he spits: “Heard ya baby mama eat excrement, heard your baby mama eat poop/N—a’s telling me I should back down, but that’s not what I’m ’bout to do/Curtis Jackson is a actor, nah, he ain’t really ’bout to shoot/Curtis Jackson really don’t want no drama.”\n50 Cent has yet to respond to the diss. Check out the posts below.",
      "author": "Mackenzie Cummings-Grady",
      "published_date": "2025-07-23",
      "word_count": 340,
      "fetch_timestamp": "2025-08-20T16:21:48.637320",
      "metadata": {
        "char_count": 1984,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:48.637314"
      }
    },
    {
      "url": "https://www.billboard.com/pro/50-cent-ex-lawsuit-salt-n-pepa-sean-kingston-music-law-news/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "50 Cent Ex-Girlfriend Lawsuit, UMG v. Salt-N-Pepa, Sean Kingston Fraud Case & More Music Law News",
      "content": "---\ntitle: 50 Cent Ex-Girlfriend Lawsuit, UMG v. Salt-N-Pepa, Sean Kingston Fraud Case & More Music Law News\nauthor: Bill Donahue\nurl: https://www.billboard.com/pro/50-cent-ex-lawsuit-salt-n-pepa-sean-kingston-music-law-news/\nhostname: billboard.com\ndescription: 50 Cent files a lawsuit against his ex, UMG hits back at Salt-N-Pepa, Sean Kingston's mom wants leniency and more in this music law news recap.\nsitename: Billboard\ndate: 2025-07-22\ncategories: ['Legal News']\ntags: ['lawsuit, Legal, The Legal Beat']\n---\n50 Cent Ex-Girlfriend Lawsuit, UMG v. Salt-N-Pepa, Sean Kingston Fraud Case & More Music Law News\nIn this week's Legal Beat newsletter, 50 Cent sues his ex over life rights, UMG fires back over Salt-N-Pepa's masters, Sean Kingston's mom begs for mercy and much more.\nTHE BIG STORY: 50 Cent hasn’t released an album since 2014. Maybe he’s just been too busy with litigation?\nIn his latest legal battle, the rapper’s G-Unit Books is accusing ex-girlfriend Shaniqua Tompkins of violating a “life rights” agreement by posting a series of “tell-all” Instagram videos. The lawsuit, filed last week, says the company paid Tompkins $80,000 in 2007 in return for “all rights to exploit her life story” — a deal they explicitly say was meant to protect the rapper’s reputation.\n“Jackson purchased these rights to preserve them for use in future biographical or autobiographical projects, but also in part because he was concerned that Tompkins would attempt to monetize their history and his name,” the rapper’s lawyers wrote. “His concerns were ultimately proven correct.”\nTo say that 50 Cent is familiar with the court system would be something of an understatement.\nTrending on Billboard\nThe rapper is currently embroiled in litigation with the producers of a horror movie in which he plays the starring role, and his liquor brand just won court approval to seize the Connecticut home of a former exec who stole money from the company. Last year, he sued another ex-girlfriend for defamation over her abuse accusations; before that, he spent years battling with Rémy Martin over accusations that his cognac brand copied the company’s bottle design.\nPerhaps the most notable? A 2022 lawsuit in which he accused a Miami medical spa of falsely suggesting that he’d had penis surgery. In his court papers, the rapper said the owner of the spa exploited an innocent photo he’d “graciously agreed” to take with her to imply that he was a client — and, more startlingly, that he had received penile enhancement.\nAll that action doesn’t come cheap: Last year, 50 Cent claimed he’d spent an astronomical $24 million in legal fees during his career. But he also didn’t express regret about doing so: “When they agitate me, I’ll send the f–king lawyers.”\nStay with Billboard for all the updates on 50 Cent’s latest case against Tompkins — and for any new litigation that comes next.\nYou’re reading The Legal Beat, a weekly newsletter about music law from Billboard Pro, offering you a one-stop cheat sheet of big new cases, important rulings and all the fun stuff in between. To get the newsletter in your inbox every Tuesday, go subscribe here.\nOther top stories this week…\nTERMINATION BATTLE – Universal Music Group (UMG) fired back at a lawsuit from Salt-N-Pepa that seeks to win back control of their masters through copyright law’s termination right, arguing that the case is legally invalid because the pioneering hip-hop duo was not actually a party to its 1986 record deal. The motion cited a ruling that rejected an earlier class action against UMG that sought to terminate copyrights en masse — and pointedly noted that Salt-N-Pepa’s lawyers worked on that same earlier case.\nJANE’S LITIGATION – Members of Jane’s Addiction sued frontman Perry Farrell for allegedly attacking guitarist Dave Navarro onstage at a Boston concert last year, claiming the assault cost them millions by forcing the cancellation of the rest of their reunion tour and derailing plans for a new album. Hours later, Farrell filed his own suit, claiming he was actually the victim in the viral scuffle after years of “bullying” by his bandmates.\nANTITRUST ARRAIGNMENT – Tim Leiweke, the live entertainment mogul and former CEO of Oak View Group, surrendered to authorities and pleaded not guilty to a federal criminal antitrust charge over allegations of bid-rigging. Prosecutors say Leiweke conspired to rig the bidding for the construction and management of the Moody Center Arena, a $338 million, 19,000-seat facility in Austin.\nGO EASY ON ME – Rapper Sean Kingston’s mother (Janice Turner) pleaded with a federal judge for a light prison sentence following the mom-son duo’s convictions for running a fraudulent scheme to effectively steal high-end cars, jewelry and other luxury goods. A pre-sentencing report says she should spend at least five years in prison, but her lawyers argued that such a lengthy term was “wholly unnecessary” for a woman who was a “pillar in her community.”\nBUFFETT ESTATE FIGHT – Jimmy Buffett’s widow Jane argued in new court filings that her late husband’s longtime business manager (Rick Mozenter) is improperly using her inheritance to bankroll his legal battle for control of the singer-songwriter’s $275 million estate. The filing came amid ongoing litigation in which each side is trying to oust the other from their roles as co-trustees of the star’s hefty estate, which includes a stake in his successful island-themed hospitality company, Margaritaville.\nLIZZO LAWSUIT – Lawyers for Lizzo’s company asked a judge to dismiss a harassment and discrimination lawsuit filed by former tour wardrobe designer Asha Daniels, calling it an “absurd” case that “makes a mockery of true victims.” The motion comes months after a judge dismissed Lizzo herself from the case, which is separate from a more high-profile case filed by three backup dancers over similar accusations.\nABUSE SETTLEMENT – Shia LaBeouf reached a confidential settlement to end a lawsuit filed by FKA Twigs that accused the actor of subjecting her to a “living nightmare” of abuse during their romantic relationship. The former couple’s powerhouse lawyers — Bryan Freedman for Twigs and Shawn Holley for LaBeouf — confirmed the agreement in a joint statement: “Committed to forging a constructive path forward, we have agreed to settle our case out of court.”\nBIGGIE BIGGIE BIGGIE – The Notorious B.I.G.’s estate reached a settlement with Target, Nordstrom and other retailers that allegedly sold unauthorized canvas prints of the famed “King of New York” photo snapped just days before the legendary rapper’s death.\nNO CHARGES – U.K. police announced that Irish rap group Kneecap would not be criminally charged for shouting “Free Palestine” and “‘F— Keir Starmer” during its politically-charged set at the Glastonbury Festival last month. Local police said there was “insufficient evidence to provide a realistic prospect of conviction for any offence.”\nBEACH BRAWL – Backstreet Boys member Brian Littrell filed a lawsuit against a Florida sheriff’s office for allegedly refusing to take action against trespassers at his oceanfront home’s private beach. The case cited body camera footage in which a police officer allegedly told a trespasser that he “doesn’t agree with private beaches” and called Littrell’s police reports “lunacy.”",
      "author": "Bill Donahue",
      "published_date": "2025-07-22",
      "word_count": 1165,
      "fetch_timestamp": "2025-08-20T16:21:48.694284",
      "metadata": {
        "char_count": 7322,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:48.694278"
      }
    },
    {
      "url": "https://www.billboard.com/pro/50-cent-lawsuit-ex-girlfriend-instagram-videos/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "50 Cent Sues Ex-Girlfriend Over ‘Tell-All’ Instagram Videos, Claims He Owns Her Life Rights",
      "content": "---\ntitle: 50 Cent Sues Ex-Girlfriend Over ‘Tell-All’ Instagram Videos, Claims He Owns Her Life Rights\nauthor: Rachel Scharf\nurl: https://www.billboard.com/pro/50-cent-lawsuit-ex-girlfriend-instagram-videos/\nhostname: billboard.com\ndescription: 50 Cent filed a lawsuit against his ex-girlfriend Shaniqua Tompkins' “tell-all” Instagram videos that supposedly violate a life rights agreement.\nsitename: Billboard\ndate: 2025-07-18\ncategories: ['Legal News']\ntags: ['lawsuit, Legal']\n---\n50 Cent Sues Ex-Girlfriend Over ‘Tell-All’ Instagram Videos, Claims He Owns Her Life Rights\nThe rapper says in the lawsuit that Shaniqua Tompkins signed away her life story to him in exchange for $80,000 in 2007.\n50 Cent is suing Shaniqua Tompkins, his ex-girlfriend and mother of his child Marquise Jackson, over a series of “tell-all” Instagram videos that supposedly violate a life rights agreement she signed in 2007.\nThe rapper (Curtis Jackson) initiated the legal action on Thursday (July 17) via his publishing company G-Unit Books. The lawsuit alleges that Tompkins, who dated 50 Cent between the 1990s and mid-2000s, sold her life rights to G-Unit Books in 2007 in exchange for $80,000 and a percentage of future royalties from related projects.\n“Jackson purchased these rights to preserve them for use in future biographical or autobiographical projects, but also in part because he was concerned that Tompkins would attempt to monetize their history and his name,” reads the complaint. “His concerns were ultimately proven correct.”\nTrending on Billboard\nAccording to the lawsuit, Tompkins’ $80,000 deal granted G-Unit Books the exclusive rights to publicize or exploit her life story. But after Tompkins went viral with an Instagram post commenting on the criminal trial of Sean “Diddy” Combs in June, she allegedly began to blatantly breach the life rights contract by posting a series of “tell-all” videos to the social media platform.\nThe lawsuit says these videos, which are collectively over two hours long, focus mostly on Tompkins’ relationship with 50 Cent. Topics have included the rapper’s infamous 2000 shooting and his long-running feud with Combs.\n“Tompkins’ actions are an attempt to exploit her 15 minutes of fame for commercial gain, even though she is contractually prohibited from doing so,” write lawyers for G-Unit Books.\nThis conduct has supposedly harmed G-Unit Books by “diminishing the value of the exclusive rights it acquired and undermining its ability to develop and market future works based on those rights,” the lawsuit says.\n50 Cent’s publishing company is seeking at least $1 million in damages from Tompkins and a legal injunction forcing her to stop posting these videos, as well as to remove the content she’s already uploaded.\nA rep for 50 Cent declined to comment on the lawsuit. Tompkins did not immediately return a request for comment on the allegations Friday (July 18).",
      "author": "Rachel Scharf",
      "published_date": "2025-07-18",
      "word_count": 444,
      "fetch_timestamp": "2025-08-20T16:21:48.747924",
      "metadata": {
        "char_count": 2908,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:48.747918"
      }
    },
    {
      "url": "https://www.billboard.com/music/rb-hip-hop/50-cent-action-pluto-tv-50th-birthday-1236012648/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "50 Cent Launches His Own Action Channel on Pluto TV: ‘This Is the Next Big Step’",
      "content": "---\ntitle: 50 Cent Launches His Own Action Channel on Pluto TV: ‘This Is the Next Big Step’\nauthor: Michael Saponara\nurl: https://www.billboard.com/music/rb-hip-hop/50-cent-action-pluto-tv-50th-birthday-1236012648/\nhostname: billboard.com\ndescription: The 50 Cent Action channel has officially launched on Pluto TV. Even on his 50th birthday, the G-Unit mogul's still making deals.\nsitename: Billboard\ndate: 2025-07-06\ncategories: ['R&B/Hip-Hop']\ntags: ['genre hiphop, Music News']\n---\n50 Cent adds another victory for the green light gang and a birthday gift in the form of another lucrative deal. Coinciding with the G-Unit head’s 50th birthday on Sunday (July 6), the 50 Cent Action channel has officially launched on Pluto TV.\nIn partnership with Lionsgate, 50 Cent Action will stream a free lineup of cinematic thrillers and blockbuster series personally curated by the rap and film mogul.\nCelebrating 50’s birthday weekend, 50 Cent Action launches with a Curtis Collection of movies starring Curtis “50 Cent” Jackson, including Freelancers, Righteous Kill, Fire with Fire, Set Up, Blood Out and Caught in the Crossfire.\nTrending on Billboard\n“I’m excited to bring 50 Cent Action to Pluto TV. Building on the channel’s success, this is the next big step — and launching on my birthday makes it even bigger,” 50 Cent said in a statement to Billboard. “I’ve partnered with Lionsgate to deliver nonstop, high-powered entertainment, and now even more fans can watch for free.”\nLaunched in 2013 and based in Los Angeles, Pluto TV is a streaming service owned by Paramount with over 350 channels. Before landing on Pluto TV, 50 Cent Action is available on Roku, LG, Prime Video, Sling TV and DIRECTV.\nThe grind never stops for 50 as he continues to build his film empire. The Queens legend has also been cast in Street Fighter, where he’ll play the role of Balrog, who’s a former boxer playing the security guard for the movie’s main villain.\nThere are more roles on the way, as 50 will also star in a horror film titled SkillHouse, which hits theaters in July, and Deon Taylor’s upcoming Free Agents.",
      "author": "Michael Saponara",
      "published_date": "2025-07-06",
      "word_count": 337,
      "fetch_timestamp": "2025-08-20T16:21:48.796654",
      "metadata": {
        "char_count": 2100,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:48.796649"
      }
    },
    {
      "url": "https://www.billboard.com/music/rb-hip-hop/50-cent-reacts-diddy-verdict-bad-man-1236012652/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "50 Cent Reacts to Diddy Verdict: ‘That Boy a Bad Man’",
      "content": "---\ntitle: 50 Cent Reacts to Diddy Verdict: ‘That Boy a Bad Man’\nauthor: Michael Saponara\nurl: https://www.billboard.com/music/rb-hip-hop/50-cent-reacts-diddy-verdict-bad-man-1236012652/\nhostname: billboard.com\ndescription: 50 Cent didn't hold back with his reaction to Diddy's sex trafficking and racketeering case, calling the mogul \"a bad man.\"\nsitename: Billboard\ndate: 2025-07-02\ncategories: ['R&B/Hip-Hop']\ntags: ['genre hiphop, Music News, nsfs']\n---\n50 Cent has been relentless with his trolling of Diddy throughout the Bad Boy mogul’s federal sex trafficking and racketeering trial, and the Queens legend reacted to Sean Combs’ mixed verdict on Wednesday morning (July 2) after the news was announced.\n“Diddy beat the [RICO], that boy a bad man,” 50 wrote to Instagram alongside an AI-generated photo of himself smiling. “He like the Gay John Gotti.”\nJohn Gotti was a New York City mobster who eventually headed the Gambino crime family. After years of dodging legal woes, they caught up with him when he was arrested on multiple counts of racketeering in 1990 and convicted in 1992. He passed away in prison in 2002.\nDiddy’s verdict found him guilty of illegal prostitution, but he evaded more serious charges for sex trafficking and racketeering, which would have had him facing a much heavier sentence. Combs has been held without bond since his arrest in September 2024, and his attorney Marc Agnifilo voiced that his client should be released from detention immediately.\nFans chimed in about the verdict in 50’s comment section. “I know you’re a little upset lol,” one person assumed. Another claimed that “this [is] the worst morning of the year for 50!”\nCombs is now awaiting a sentencing hearing for his charges, which carry a range of no time behind bars to a maximum of 20 years.\nPresident Donald Trump previously said he’s “look at the facts” when it came to a potential Diddy pardon, but 50 Cent made sure that mogul-turned-politician — who was convicted on 34 felony charges in May 2024 — saw some of the criticism Combs has had for him during his political run over the years.\n“[Diddy] said some really bad things about Trump, it’s not ok. I’m gonna reach out so he knows how I feel about this guy,” 50 Cent wrote in a since-deleted post to Instagram caught by Rolling Stone. “Donald doesn’t take well to disrespect, and doesn’t forget who chooses to go against him. While working tirelessly to make America great again there is no room for distraction. He would consider pardoning anyone who was being mistreated not Puffy Daddy.”\nCombs’ eight-week trial came to a close on Wednesday (July 2), with the mixed verdict being read in New York federal court. Judge Subramanian is expected to make a decision soon on whether Diddy will be released.",
      "author": "Michael Saponara",
      "published_date": "2025-07-02",
      "word_count": 453,
      "fetch_timestamp": "2025-08-20T16:21:48.844841",
      "metadata": {
        "char_count": 2767,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:48.844836"
      }
    },
    {
      "url": "https://www.billboard.com/music/rb-hip-hop/ja-rule-roasts-50-cent-concert-video-1236011231/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "Ja Rule Roasts Longtime Enemy 50 Cent Over Concert Video: ‘Ain’t Nobody Coming to See You’",
      "content": "---\ntitle: Ja Rule Roasts Longtime Enemy 50 Cent Over Concert Video: ‘Ain’t Nobody Coming to See You’\nauthor: Mackenzie Cummings-Grady\nurl: https://www.billboard.com/music/rb-hip-hop/ja-rule-roasts-50-cent-concert-video-1236011231/\nhostname: billboard.com\ndescription: Ja Rule clowned his longtime foe 50 Cent after a video circulated allegedly showing a low concert turnout for the G-Unit leader.\nsitename: Billboard\ndate: 2025-06-30\ncategories: ['R&B/Hip-Hop']\ntags: ['genre hiphop, Music News']\n---\nJa Rule clowned his longtime foe 50 Cent after a video circulated allegedly showing a low concert turnout for the G-Unit leader.\nOn Monday (June 30), Ja hopped on X to respond to a fan who had antagonized the rapper by showing that one of 50 Cent’s UK tour dates is entirely sold out. The Final Lap tour date was part of a special 2-for-1 offer the G-Unit leader offered in London. Ja clowned him for even having such an offer, which prompted the fan to post a screenshot of the sold-out date.\n“You sure bout that???” Ja wrote alongside a video of a crowd that didn’t fill the whole floor. “Ain’t nobody coming to see you Otis… I mean Curtis.”\nWhen reached by Billboard, a rep for 50 Cent said of the video: “Like all of Jackson’s other tour dates, this show was completely sold out.”\nTrending on Billboard\nJa’s trolling should come as no surprise considering he and 50 Cent have been at odds for years. Most recently, 50 claimed that he bought tickets to one of Ja’s shows to make sure seats would be left empty.\n“I did [buy Ja Rule’s tickets]. They were cheap tickets,” he told Big Boy back in December. “The tickets were very affordable. They were on StubHub. I bought the first four rows.”\nHe added: “I looked at it and said, ‘I just want you to feel like you gotta reach the people, four or five rows back…It wasn’t that big of a sacrifice. I’ve bought things that mean less to me. That was fun, watching the show and seeing the spaces are empty because they were reserved for someone else.”\nCheck out the clip below.\nUPDATE: This article was updated with a quote from 50 Cent’s team.",
      "author": "Mackenzie Cummings-Grady",
      "published_date": "2025-06-30",
      "word_count": 356,
      "fetch_timestamp": "2025-08-20T16:21:48.897476",
      "metadata": {
        "char_count": 2091,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:48.897470"
      }
    },
    {
      "url": "https://www.billboard.com/pro/50-cent-lawsuit-skillhouse-horror-movie-shakedown-producers/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "50 Cent’s Lawsuit Over ‘SkillHouse’ Horror Movie Is a ‘Shakedown,’ Producers Say",
      "content": "---\ntitle: 50 Cent’s Lawsuit Over ‘SkillHouse’ Horror Movie Is a ‘Shakedown,’ Producers Say\nauthor: Bill Donahue\nurl: https://www.billboard.com/pro/50-cent-lawsuit-skillhouse-horror-movie-shakedown-producers/\nhostname: billboard.com\ndescription: 50 Cent's lawsuit over his starring role in the upcoming horror movie \"Skillhouse\" is a baseless \"shakedown,\" the producers said in a legal response.\nsitename: Billboard\ndate: 2025-06-13\ncategories: ['Legal News']\ntags: ['Legal, movies']\n---\n50 Cent’s Lawsuit Over ‘SkillHouse’ Horror Movie Is a ‘Shakedown,’ Producers Say\nFifty wants a judge to stop the premiere of SkillHouse - a horror flick where he's the star - but the movie's producers now say the rapper clearly approved the project.\nThe producers of a horror movie starring 50 Cent are blasting the rapper’s “baseless” lawsuit aimed at blocking its release, calling it a “last-minute shakedown.”\nFifty (Curtis Jackson) sued earlier this year to stop the premiere of SkillHouse, an upcoming horror movie in which he plays a big role, over claims that he never signed off. He claimed producer Ryan Kavanaugh had not paid him “a dime” and he had “no creative input.”\nBut in a scathing response on Thursday, Kavanaugh’s attorneys say the rap star “time and time again” gave his clear approval for the project – and that he cannot now “kneecap the film on the eve of its release.”\nTrending on Billboard\n“After almost three years of acknowledging his agreement to appear in the film, Jackson seeks to enjoin SkillHouse from its impending theatrical release,” Kavanaugh’s lawyers write. “This is a baseless and last-minute shakedown.”\nSet for release July 11, SkillHouse is billed as a “social media nightmare,” in which ten influencers are kidnapped and forced to compete in a “deadly showdown” where “every like, share, and follow is a fight for survival.” While 50 Cent has the top billing, the movie also stars actual creators (Bryce Hall and Hannah Stocking) with huge followings on TikTok, Instagram and YouTube.\nFifty filed his lawsuit in April, claiming he filmed the movie back in 2022 without a formal contract because he trusted that one would be signed later. But he says it never was — and that the producers cannot use his name and likeness without one.\n“Defendants have billed Jackson as the star and producer of the film [and] have shamelessly and deceptively marketed the film as a ‘50 Cent Movie’ and ‘produced by 50 Cent,’ when it is nothing of the sort,” his lawyers wrote at the time.\nBut in Thursday’s response, attorneys for Kavanaugh and the movie’s production company say they have “a mountain of documentary evidence” that he did, in fact, agree to appear in and promote SkillHouse – including a tweet in which he bragged that it would “elevate horror to another level.” And they say 50 cannot “come close” to showing the kind of permanent damage that would necessitate an injunction blocking the movie’s premiere.\n“Jackson cannot show irreparable harm from being associated with a well-received film he repeatedly touted his involvement in,” write Kavanaugh’s lawyers. “Moreover, he certainly cannot show an urgent need for action by the court when he, for almost three years, has known about (and approved) what he now contends is misappropriation.”\nAn attorney for 50 Cent did not immediately return a request for comment.",
      "author": "Bill Donahue",
      "published_date": "2025-06-13",
      "word_count": 536,
      "fetch_timestamp": "2025-08-20T16:21:48.951460",
      "metadata": {
        "char_count": 3349,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:48.951454"
      }
    },
    {
      "url": "https://www.billboard.com/music/rb-hip-hop/50-cent-trolls-donald-trump-elon-musk-rift-1235997042/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "50 Cent Trolls Elon Musk Over Donald Trump Rift: ‘He Really Don’t Give a F—‘",
      "content": "---\ntitle: 50 Cent Trolls Elon Musk Over Donald Trump Rift: ‘He Really Don’t Give a F—‘\nauthor: Michael Saponara\nurl: https://www.billboard.com/music/rb-hip-hop/50-cent-trolls-donald-trump-elon-musk-rift-1235997042/\nhostname: billboard.com\ndescription: 50 Cent has continued to troll Donald Trump and Elon Musk on social media since their falling out.\nsitename: Billboard\ndate: 2025-06-11\ncategories: ['R&B/Hip-Hop']\ntags: ['genre hiphop, Music News']\n---\n50 Cent is never one to shy away from controversy, and he threw himself into the middle of the highly publicized rift between President Donald Trump and Elon Musk.\n50’s taken his social media game to another level since figuring out how to use AI-generated images, and he posted another two on Tuesday (June 10) featuring him in conversation with Trump and the Tesla founder.\nThe G-Unit boss has been complimentary of Trump in the past and he mocked Musk for his alleged eye injury. “So what happened with Elon, heard he let some punk punch him in the face,” he wrote in the caption alongside an AI photo of him and the president on the golf course.\nTrending on Billboard\nMusk has claimed that the eye injury came from a playful tussle with his 5-year-old son. 50 followed up with an AI picture of the Queens rap legend on a plane talking to Musk.\n“Hey man I think you should talk to Donald. I know you don’t give a f—, but he really don’t give a f—,” he added.\nTrump and the tech mogul’s feud escalated earlier in June after Musk announced he was leaving his post as part of the government following the president’s approval of a Republican-supported tax bill that cuts electric vehicle tax credits and will impact Musk’s Tesla company.\nThe feud spilled over onto X and got ugly when Musk slammed Trump and tied him to associating with convicted pedophile Jeffrey Epstein. However, when the dust settled, Musk admitted he regretted some of his actions. “I regret some of my posts about President @realDonaldTrump last week,” he wrote. “They went too far.”\n50 has been attempting to get Trump’s attention after the president said he’d “consider” potentially pardoning Diddy if he’s convicted on sex trafficking and racketeering charges.\nBeing the king of petty that he is, 50 posted clips from the past featuring Diddy condemning Donald Trump. “[Diddy] said some really bad things about Trump, it’s not ok. I’m gonna reach out so he knows how I feel about this guy,” 50 Cent wrote in a since-deleted post to IG captured by Rolling Stone. “Donald doesn’t take well to disrespect, and doesn’t forget who chooses to go against him. While working tirelessly to make America great again there is no room for distraction. He would consider pardoning anyone who was being mistreated not Puffy Daddy.”",
      "author": "Michael Saponara",
      "published_date": "2025-06-11",
      "word_count": 455,
      "fetch_timestamp": "2025-08-20T16:21:48.998752",
      "metadata": {
        "char_count": 2749,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:48.998747"
      }
    },
    {
      "url": "https://www.billboard.com/video/does-jay-z-still-have-beef-with-50-cent-billboard/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "Does Jay-Z Still Have Beef With 50 Cent? | Billboard News",
      "content": "---\ntitle: Does Jay-Z Still Have Beef With 50 Cent? | Billboard News\nauthor: Katie Cao\nurl: https://www.billboard.com/video/does-jay-z-still-have-beef-with-50-cent-billboard/\nhostname: billboard.com\ndescription: 50 Cent & Jay-Z may still have beef due to a theory that Jay-Z tried to keep 50 from performing at the 2022 Super Bowl halftime show.\nsitename: Billboard\ndate: 2024-12-06\ncategories: ['Videos']\ntags: ['bbnews, Billboard, billboard news']\n---\n50 Cent and Jay-Z still have beef? Fif discussed his theory that Jay-Z tried to keep him from performing at the 2022 Super Bowl halftime show with Dr. Dre and Snoop. Keep watching to see what 50 Cent has to say about their issues.\n50 Cent:\nOur culture’s competitive, but I think when it goes past the music itself to blocking things in business, then I don’t understand that.\nTetris Kelly:\n50 Cent and Jay-Z still got beef? Always known to speak his mind, the legendary Queens rapper discusses his theory that Jay-Z tried to keep him from performing at the 2022 Super Bowl halftime show with Dr. Dre and Snoop. While appearing on Cam’ron’s new interview podcast, ‘Talk to Flee,’ the conversation turns to 50’s longtime rival Jay-Z. Cam’ron asks 50 to address the rumors of Jay-Z going to Dre and Em to get 50 off the show.\n50 Cent:\nOur culture’s competitive, but I think when it goes past the music itself to blocking things in business, then I don’t understand that. Right now, he’s not even competing for a slot. He doesn’t have a new song out that he wants to be top 10 and he’s still competing. It doesn’t make sense. What are we competing for? What’s the goal?\nTetris Kelly:\nAt the time of making this video, Jay-Z has yet to respond to 50’s comments. Can’t we all just get along? Here’s to hoping these rap icons squash this decades-old beef. Keep it locked here at Billboard for more hip-hop news.",
      "author": "Katie Cao",
      "published_date": "2024-12-06",
      "word_count": 316,
      "fetch_timestamp": "2025-08-20T16:21:49.248990",
      "metadata": {
        "char_count": 1858,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:49.248983"
      }
    },
    {
      "url": "https://www.billboard.com/video/cardi-b-50-cent-react-donald-trump-winning-2024-election-billboard/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "Cardi B, 50 Cent & More React to Donald Trump Winning 2024 Presidential Election | Billboard News",
      "content": "---\ntitle: Cardi B, 50 Cent & More React to Donald Trump Winning 2024 Presidential Election | Billboard News\nauthor: Katie Cao\nurl: https://www.billboard.com/video/cardi-b-50-cent-react-donald-trump-winning-2024-election-billboard/\nhostname: billboard.com\ndescription: After Donald Trump won the 2024 election, Cardi B, 50 Cent & more in the hip-hop community have reacted. Keep watching to see what they had to say.\nsitename: Billboard\ndate: 2024-11-06\ncategories: ['Videos']\ntags: ['bbnews, Billboard, billboard news']\n---\nAfter Donald Trump won the 2024 U.S. presidential election, Cardi B, 50 Cent and more within the hip-hop community have reacted. Keep watching to see what they had to say.\nTetris Kelly:\nDonald J. Trump has been re-elected as America’s 47th president, and the hip-hop community is reacting. Cardi B posted on her IG story, “I hate y’all bad.” 50 Cent posted on his page, “I don’t care how the fight goes, I’m leaving with the winner sh*t. I still don’t know what’s going on. Congratulations!” Joe Budden took it to Twitter saying, “If Trump wins, I’m egging Cyber Trucks.” And over at ‘The Breakfast Club,’ Charlamagne Tha God had this to say.\nCharlamagne tha God:\nDonald Trump is now all of our president again. I don’t want to fight anyone. I don’t want to argue with anyone, because at the end of the day we are all Americans.\nTetris Kelly:\nIn the upcoming days, there will be more reactions flooding in, but no matter where you lean politically, make sure to take some time to check in on friends, loved ones and, most importantly, yourself.",
      "author": "Katie Cao",
      "published_date": "2024-11-06",
      "word_count": 253,
      "fetch_timestamp": "2025-08-20T16:21:49.290749",
      "metadata": {
        "char_count": 1569,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:49.290744"
      }
    },
    {
      "url": "https://www.billboard.com/video/50-cent-rejects-donald-trumps-offer-of-3-million-to-perform-at-rally-billboard/",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "50 Cent Rejects Donald Trump’s $3 Million Offer to Perform at Rally | Billboard News",
      "content": "---\ntitle: 50 Cent Rejects Donald Trump’s $3 Million Offer to Perform at Rally | Billboard News\nauthor: Katie Cao\nurl: https://www.billboard.com/video/50-cent-rejects-donald-trumps-offer-of-3-million-to-perform-at-rally-billboard/\nhostname: billboard.com\ndescription: 50 Cent spills on why he rejected Donald Trump’s offer of $3 million to perform at his rally. Keep watching to see what he had to say.\nsitename: Billboard\ndate: 2024-10-29\ncategories: ['Videos']\ntags: ['bbnews, Billboard, billboard news']\n---\n50 Cent spills on why he rejected Donald Trump’s offer of $3 million to perform at his rally. Keep watching to see what he had to say.\nInterviewer 1:\nHe wanted you to perform “Many Men” at the RNC, too right?\n50 Cent:\nYeah, and he offered me $3 million.\nTetris Kelly”\nDonald Trump wanted 50 Cent to perform at his MAGA rally at Madison Square Garden and reportedly offered him 3 million dollars. 50 told The Breakfast Club that wasn’t the only time Trump rang him up.\n50 Cent:\nThis past Sunday.\nInterviewer 1:\n$3 million. And they offered you money for the Republican National Convention too, right?\nInterviewer 2:\nYou turned it down?\n50 Cent:\nYeah, I didn’t even go for it, but I’ve been talking to them about that kind of stuff.\nInterviewer 1:\nCould you see “Many Men” being a Republican anthem?\nTetris Kelly:\nCould you see “Many Men” being a Republican anthem? But in the end, 50 just doesn’t want to be involved in politics.\n50 Cent:\nI’m afraid of politics, bro. I do not like it.\nInterviewer 2:\nYou don’t gang bang with politics.\n50 Cent:\nNo gang bang with politics. You know it’s because when you get involved, no matter how you feel, someone passionately disagrees with you.\nInterviewer 3:\nThat’s everything though. I mean politics is worse, but that’s every day.\nTetris Kelly:\nWe have reached out to Donald Trump for comment. Find more at Billboard.com.",
      "author": "Katie Cao",
      "published_date": "2024-10-29",
      "word_count": 308,
      "fetch_timestamp": "2025-08-20T16:21:49.334268",
      "metadata": {
        "char_count": 1872,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:49.334263"
      }
    },
    {
      "url": "https://www.billboard.com/artist/50-cent/chart-history/hsi",
      "source": "billboard",
      "artist_name": "50 Cent",
      "title": "50 Cent | Biography, Music & News | Billboard",
      "content": "---\ntitle: 50 Cent | Biography, Music & News | Billboard\nauthor: Wp-Block-Co-Authors-Plus-Coauthors Is-Layout-Flow\nurl: https://www.billboard.com/artist/50-cent/\nhostname: billboard.com\ndescription: The Queens superstar transformed industry clout for the post-2000s and cemented himself as one of the genre's definitive contemporary artists. From his uber-classic 2003 debut Get Rich or Die Tryin…\nsitename: Billboard\ndate: 2005-05-02\n---\nCandy Shop\n50 Cent Featuring Olivia\n21 Questions\n50 Cent Featuring Nate Dogg\nCrack A Bottle\nEminem, Dr. Dre & 50 Cent\nHate It Or Love It\nThe Game Featuring 50 Cent\nMagic Stick\nLil' Kim Featuring 50 Cent\nDown On Me\nJeremih Featuring 50 Cent\nHow We Do\nThe Game Featuring 50 Cent\nAyo Technology\n50 Cent Featuring Justin Timberlake & Timbaland\nOutta Control (Remix)\n50 Cent Feat. Mobb Deep\nThe Woo\nPop Smoke Featuring 50 Cent & Roddy Ricch\nYou Don't Know\nEminem, 50 Cent, Lloyd Banks & Ca$his\nEncore\nEminem, Dr. Dre & 50 Cent\nMy Life\n50 Cent Featuring Eminem & Adam Levine\nBaby By Me\n50 Cent Featuring Ne-Yo\nStraight To The Bank\n50 Cent\nBest Friend\n50 Cent & Olivia\nRight There\nNicole Scherzinger Featuring 50 Cent\nCan't Leave 'Em Alone\nCiara Featuring 50 Cent\nUP!\nLoveRance Featuring IamSu & Skipper or 50 Cent\nSo Seductive\nTony Yayo Featuring 50 Cent\nRemember The Name\nEd Sheeran Featuring Eminem & 50 Cent\nHustler's Ambition\n50 Cent\nMJB Da MVP\nMary J. Blige Featuring The Game & 50 Cent\nNew Day\n50 Cent Featuring Dr. Dre & Alicia Keys\nHands Up\nLloyd Banks Featuring 50 Cent\nWestside Story\nThe Game Featuring 50 Cent\nStill Will\n50 Cent Featuring Akon",
      "author": "Wp-Block-Co-Authors-Plus-Coauthors Is-Layout-Flow",
      "published_date": "2005-05-02",
      "word_count": 267,
      "fetch_timestamp": "2025-08-20T16:21:49.773055",
      "metadata": {
        "char_count": 1587,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:21:49.773048"
      }
    }
  ],
  "total_articles": 13,
  "total_words": 5547,
  "extracted_at": "2025-08-20T16:21:49.773542",
  "urls_processed": [
    "https://www.billboard.com/music/rb-hip-hop/50-cent-street-fighter-movie-balrog-1236008598/",
    "https://www.billboard.com/music/rb-hip-hop/50-cent-dave-blunts-diss-1236028321/",
    "https://www.billboard.com/pro/50-cent-ex-lawsuit-salt-n-pepa-sean-kingston-music-law-news/",
    "https://www.billboard.com/pro/50-cent-lawsuit-ex-girlfriend-instagram-videos/",
    "https://www.billboard.com/music/rb-hip-hop/50-cent-action-pluto-tv-50th-birthday-1236012648/",
    "https://www.billboard.com/music/rb-hip-hop/50-cent-reacts-diddy-verdict-bad-man-1236012652/",
    "https://www.billboard.com/music/rb-hip-hop/ja-rule-roasts-50-cent-concert-video-1236011231/",
    "https://www.billboard.com/pro/50-cent-lawsuit-skillhouse-horror-movie-shakedown-producers/",
    "https://www.billboard.com/music/rb-hip-hop/50-cent-trolls-donald-trump-elon-musk-rift-1235997042/",
    "https://www.billboard.com/video/does-jay-z-still-have-beef-with-50-cent-billboard/",
    "https://www.billboard.com/video/cardi-b-50-cent-react-donald-trump-winning-2024-election-billboard/",
    "https://www.billboard.com/video/50-cent-rejects-donald-trumps-offer-of-3-million-to-perform-at-rally-billboard/",
    "https://www.billboard.com/artist/50-cent/chart-history/hsi"
  ]
}