{
  "artist_name": "Melissa Etheridge",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/media/podcasts/melissa-etheridge-concert-womens-prison-behind-the-setlist-podcast-1235746589/",
      "source": "billboard",
      "artist_name": "Melissa Etheridge",
      "title": "Melissa Etheridge on Why Her Concert at a Women’s Prison Was So Unique",
      "content": "---\ntitle: Melissa Etheridge on Why Her Concert at a Women’s Prison Was So Unique\nauthor: Glenn Peoples\nurl: https://www.billboard.com/media/podcasts/melissa-etheridge-concert-womens-prison-behind-the-setlist-podcast-1235746589/\nhostname: billboard.com\ndescription: Melissa Etheridge reflects on her concert at a women's prison on this episode of Billboard's 'Behind the Setlist' podcast.\nsitename: Billboard\ndate: 2024-08-05\ncategories: ['Podcasts']\ntags: ['Music News']\n---\n“This is a setlist that I have never done anywhere,” Melissa Etheridge tells Billboard’s Behind the Setlist podcast of the performance captured in her new live album, I’m Not Broken: Live from Topeka Correction Facility.\n“Unexpected Rain” is “a deep track on a deep album, The Awakening,” she says. “I rarely do ‘Unexpected Rain.’ I rarely do ‘The Shadow of a Black Crow,’ which is about addiction. I rarely do ‘Into the Dark.’ I rarely do ‘Love Will Live.’ They were very, very specific to what I wanted to speak about.”\nIt was a unique concert in more ways than one.\nTrending on Billboard\nEtheridge’s performance before 2,500 inmates at the women’s prison in Topeka, Kan., was recorded for two-part docuseries I’m Not Broken for the streaming platform Paramount+. The two-time Grammy winner says she had wanted to perform at a prison for decades. Etheridge grew up in Leavenworth, Kans., within eyeshot of the prison where country great Johnny Cash performed in 1970. The 7-year-old Etheridge couldn’t hear the performance from outside the prison walls, but was struck by accounts of the show. “We just had the newspaper article, and at that point I read it, and was like, ‘Wow, prisons must be a place of great entertainment, and someday I’m gonna grow up and play a prison.'”\nThe idea came up again when she switched management a decade ago. About five years ago, her management team began reaching out to the penitentiary to see if a performance would be feasible. Once the idea was approved and Etheridge was given a green light by Paramount, she brought on board a production company, Shark Pig.\nThe Topeka concert included many deep cuts because the filmmakers asked Etheridge to choose songs based on themes — such as trauma, motherhood, hope, redemption and consequence — that the series would address. At the concert, Etheridge introduced each song by talking about the specific themes.\nThe often racuous show included many of Etheridge’s better known songs, too. The show opens with “American Girl,” a non-single track from her 1993 album Yes, I Am. The set closed with her biggest hits: “Come to My Window” and “I’m The Only One” from Yes, I Am, and “Bring Me Some Water” and “Like the Way I Do” from her 1988 debut.\nI’m Not Broken also captures Etheridge’s process for writing a song specifically for the concert. “A Burning Woman” was informed by her correspondence and conversation with five of the inmates. The women opened up about their circumstances, how they ended up in prison and their lives during incarceration.\n“We sat down in the prison library, and we all spoke,” Etheridge recalls, “and just hearing their stories, laughing, talking, crying, whatever you know we did, was so powerful to me that it couldn’t help but humanize them, because they are human.”\nListen to the entire interview with Melissa Etheridge in the embedded Spotify player below, or go to Spotify, Apple Podcasts, Amazon Music, iHeart or Everand.",
      "author": "Glenn Peoples",
      "published_date": "2024-08-05",
      "word_count": 550,
      "fetch_timestamp": "2025-08-20T17:14:31.586918",
      "metadata": {
        "char_count": 3419,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T17:14:31.586910"
      }
    },
    {
      "url": "https://www.billboard.com/pro/melissa-etheridge-failed-cannabis-business-legal-dispute/",
      "source": "billboard",
      "artist_name": "Melissa Etheridge",
      "title": "Melissa Etheridge’s Failed Cannabis Startup Left Business Partners in ‘Ruin,’ Complaint Says",
      "content": "---\ntitle: Melissa Etheridge’s Failed Cannabis Startup Left Business Partners in ‘Ruin,’ Complaint Says\nauthor: Bill Donahue\nurl: https://www.billboard.com/pro/melissa-etheridge-failed-cannabis-business-legal-dispute/\nhostname: billboard.com\ndescription: Melissa Etheridge's failed cannabis startup has led to a legal battle with former business partners who say she “abandoned them.\"\nsitename: Billboard\ndate: 2024-07-19\ncategories: ['Legal News']\ntags: ['Legal, marijuana']\n---\nMelissa Etheridge’s Failed Cannabis Startup Left Business Partners in ‘Ruin,’ Complaint Says\nEtheridge's business partners say they've been \"left with nothing\" after the singer and her wife allegedly bailed on their California weed business.\nMelissa Etheridge is facing a legal battle over her brief foray into the cannabis business, filed by two business partners in Northern California who claim that the singer “abandoned them” and left them in “financial ruin.”\nThe Grammy-winning songwriter, who rose to stardom in the 1990s with hits like “Come to My Window” and “I’m The Only One,” announced in 2019 that she would launch Etheridge Farms, which aimed to bring the benefits of cannabis to middle-aged women. “They’re looking to cannabis, and I want Etheridge Farms to be right there to answer what they’re looking for,” the singer said at the time.\nBut five years later, her former business partners now claim that Etheridge and her wife effectively torpedoed the company by refusing to support it. In a legal petition filed July 9 and obtained by Billboard, Josephine and D’Angelo Roberto say they’ve been “left with nothing.”\nTrending on Billboard\n“The Robertos trusted the Etheridges and invested their life’s work into the businesses,” writes attorney Christopher Frost of the law firm Frost LLP, representing the Robertos. “Unfortunately, their hard work did not end in a success story, but rather betrayal and abandonment.”\nThe filing is a demand for arbitration, which initiates a litigation-like case that will play out similar to a lawsuit. But such cases, often required under corporate operating agreements, are decided by an arbitrator behind closed doors rather than by a judge in an open courtroom.\nRepresentatives for the Etheridges, including their attorney who received the arbitration demand, did not return repeated requests for comment on the dispute. Attorneys for the Robertos declined to comment.\nA Budding Partnership\nThe Robertos (nicknamed Jozee and Cricket) say they met Etheridge and her wife Linda Wallem-Etheridge via mutual friends in Northern California in 2017, and that the foursome then hatched a plan to launch a series of cannabis businesses, including Etheridge Farms and Etheridge Botanicals. In a 2019 article in San Jose’s Mercury News, the singer said she had been inspired in part by using cannabis amid a battle with breast cancer in the 2000s.\n“I came out of chemotherapy saying, I want to be an advocate for this, I believe in this as medicine so deeply,” she told the Mercury News. “I started looking around California going, OK, what do I need to do — I want to be part of this — I actually turned to my friends and said, I want to be the face of cannabis.” In that same article, Jozee was quoted as saying that the Etheridges “genuinely share the same values that Cricket and I share about health and wellbeing.”\nAccording to legal filings, the group secured a rental lease in 2018 on a large facility in Soquel, Calif. to manufacture and distribute their products, and also locked down important regulatory licenses for that property.\nThe plan, according to the Robertos, was for the couple to contribute their extensive cannabis industry expertise and work on product development, while the Etheridges would use their celebrity status to promote the business, seek outside investors, and continue to support the business financially.\nLeft High and Dry?\nBut while the Robertos say they “devoted every ounce of their money, time and attention” to the businesses, they claim the Etheridges failed to do the same. They say she failed to promote the business, and then stopped supporting the business financially. According to legal filings, by 2020 that allegedly included failing to pay the rent at the Soquel facility as promised; when the landlord finally booted them, the Robertos say it cost the business crucial regulatory licenses that had been tied to that property.\n“Despite their persistent efforts, following the Etheridges’ complete lack of engagement and financial support to the Etheridge entities, the LLC sales and performance eventually withered away,” attorneys for the couple write in the demand for arbitration.\nThe alleged breakdown in the business came amid great personal tragedy for Etheridge. In May 2020, the singer announced that Beckett Cypher, her son with former partner Julie Cypher, had died from causes related to opioid addiction. Months later, the singer launched the Etheridge Foundation to advocate for and support research into new treatments for opioid addiction.\nThose tragic events are not directly mentioned in the new legal filings, but attorneys for the Robertos allude to them in making their case.\n“The Etheridges suffered personal losses for which the Robertos have much empathy,” the couple’s lawyers write in their filing earlier this month. “However, notwithstanding these personal losses and given the challenges faced by the parties, the Etheridges ultimately decided to let all of the joint ventures ‘die on the vine,’ stopped covering expenses that they promised to pay, and left the Robertos in a much worse situation.”\nIn technical terms, the demand for arbitration accuses the Etheridges of breaching their fiduciary duty to the companies; breaching their contract with the Robertos; violating legal promises they made to the couple; and making fraudulent and negligent misrepresentations.\nThe pair are seeking an undetermined amount of damages, but say they’re entitled to at least $3 million: “The Robertos have not pursued this action and are not proceeding to arbitration for fame or fortune or as a vendetta,” their lawyers write. “Rather, they simply seek compensation for the suffering they have had to endure and the financial ruin they have experienced due to the Etheridges abandoning them.”",
      "author": "Bill Donahue",
      "published_date": "2024-07-19",
      "word_count": 981,
      "fetch_timestamp": "2025-08-20T17:14:31.642828",
      "metadata": {
        "char_count": 6291,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T17:14:31.642822"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/melissa-etheridge-im-not-broken-clip-performing-at-prisons-1235725720/",
      "source": "billboard",
      "artist_name": "Melissa Etheridge",
      "title": "Melissa Etheridge Recalls Performing in Prisons as a 12-Year-Old in ‘I’m Not Broken’ Clip",
      "content": "---\ntitle: Melissa Etheridge Recalls Performing in Prisons as a 12-Year-Old in ‘I’m Not Broken’ Clip\nauthor: Rania Aniftos\nurl: https://www.billboard.com/music/music-news/melissa-etheridge-im-not-broken-clip-performing-at-prisons-1235725720/\nhostname: billboard.com\ndescription: Melissa Etheridge is documenting her special concert at Topeka Correctional Facility in a new two-part series, Melissa Etheridge: I’m Not Broken.\nsitename: Billboard\ndate: 2024-07-08\ncategories: ['Music News']\ntags: ['documentary, Music News']\n---\nMelissa Etheridge is documenting her special concert to uplift the incarcerated women at Topeka Correctional Facility in a new two-part series, Melissa Etheridge: I’m Not Broken.\nIn a preview clip shared exclusively with Billboard, the rock icon recalls performing at prisons as a child. “When I was 12 years old, I had just played the guitar and I had been writing folk songs. It’s 1973, and we played the VA Center, which was interesting,” she revealed. “Then, we had been asked to do the show at the federal penitentiary. When I sang, that audience made me feel like a female Johnny Cash. It was electric. Then, I played the state penitentiary, then I played the women’s penitentiary. It’s so funny to come here to prison and say, ‘This is my favorite prison and I had such a great experience here.’ But it really was.”\nShe continued, “Going inside those walls as a 12 year old was informative to me as a child.”\nTrending on Billboard\nPremiering July 9 on Paramount+, the docuseries will follow Etheridge as she plans to bring happiness to the Topeka Correctional Facility after receiving letters from some of its residents. Eventually, Etheridge writes an original song in their honor and performs it for them at the facility, which is located in her hometown in Kansas. The show will also touch on how many of the residents struggle with substance abuse issues, something Etheridge has a personal connection to. The “I’m the Only One” singer lost her son Beckett to an opioid addiction in 2020, when he was just 21 years old.\nWatch the clip from I’m Not Broken exclusively via Billboard below.",
      "author": "Rania Aniftos",
      "published_date": "2024-07-08",
      "word_count": 333,
      "fetch_timestamp": "2025-08-20T17:14:31.691474",
      "metadata": {
        "char_count": 2125,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T17:14:31.691468"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/melissa-etheridge-talks-sperm-donor-david-crosby-more-kids-1235723449/",
      "source": "billboard",
      "artist_name": "Melissa Etheridge",
      "title": "Melissa Etheridge Says Sperm Donor David Crosby Taught Her About ‘Generosity’: ‘We’re Still Finding Kids… Out in the World’",
      "content": "---\ntitle: Melissa Etheridge Says Sperm Donor David Crosby Taught Her About ‘Generosity’: ‘We’re Still Finding Kids… Out in the World’\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/music-news/melissa-etheridge-talks-sperm-donor-david-crosby-more-kids-1235723449/\nhostname: billboard.com\ndescription: Melissa Etheridge paid tribute to late friend/sperm donor David Crosby, who helped her and her ex conceive their children, and maybe sired more kids.\nsitename: Billboard\ndate: 2024-07-02\ncategories: ['Music News']\ntags: ['Music News, Pop, rock']\n---\nMelissa Etheridge is forever thankful for the gift of life that late friend David Crosby bestowed on her and ex Julie Cypher when he agreed to be a sperm donor for the couple in the 1990s. In an interview with People to promote her new docuseries Melissa Etheridge: I’m Not Broken — which premieres on Paramount+ on July 9 — Etheridge, 63, says that in addition to being the biological dad to her daughter Bailey and late son Beckett, Crosby “really taught me about generosity.”\n“The situation was special with my partner at the time because she had been adopted and she wanted her children to know who their biological father was,” Etheridge says of Cypher. “So we weren’t going to go to a sperm bank because she wanted them to know.” That led them to Crosby, who died in 2023 at 81 and seemed up for the task with no strings attached.\nTrending on Billboard\n“To me, I didn’t want someone who wanted to be a father,” the singer said of Crosby, who was also a father to sons James and Django and daughters Erika and Donovan. “I didn’t want all of a sudden my children to have… ‘Oh, there’s dad.’ And who am I? That sort of thing”; Bailey is now 27 and Beckett died of an opioid overdose in 2020 at 21.\nIn fact, it was Crosby’s wife, Jan Dance, who suggested he help the couple out, and according to Etheridge, they weren’t the only ones who were subject to his generosity.\n“They had just had help having their son and they appreciated that. They wanted to pay it forward,” Etheridge said. “We’re still finding kids from David Crosby out in the world. My daughter’s like, ‘I have another half-sister.'” The key, she said, was that Crosby was happy to donate sperm, but did not need to be a hands-on father to Etheridge’s kids, which is why the relationship worked.\n“That’s what really made it clear for me, was that he was willing to say, ‘Yeah, I was the biological father,'” Etheridge said of Crosby. “And my kids call him bio dad, so he’s the biological father, but they didn’t need a relationship with him.”\nWhen the Byrds, Crosby, Stills & Nash founder died Etheridge paid loving tribute to the rocker. “I am grieving the loss of my friend [and] Beckett and Bailey’s biological father, David,” she wrote at the time. “He gave me the gift of family. I will forever be grateful to him, [son] Django, and [wife] Jan. His music and legacy will inspire many generations to come. A true treasure.”",
      "author": "Gil Kaufman",
      "published_date": "2024-07-02",
      "word_count": 502,
      "fetch_timestamp": "2025-08-20T17:14:31.741250",
      "metadata": {
        "char_count": 2955,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T17:14:31.741244"
      }
    },
    {
      "url": "https://www.billboard.com/culture/tv-film/melissa-etheridge-im-not-broken-docuseries-trailer-1235704068/",
      "source": "billboard",
      "artist_name": "Melissa Etheridge",
      "title": "Melissa Etheridge Docuseries ‘I’m Not Broken’ to Highlight Singer’s Concert for Women in Prison",
      "content": "---\ntitle: Melissa Etheridge Docuseries ‘I’m Not Broken’ to Highlight Singer’s Concert for Women in Prison\nauthor: Hannah Dailey\nurl: https://www.billboard.com/culture/tv-film/melissa-etheridge-im-not-broken-docuseries-trailer-1235704068/\nhostname: billboard.com\ndescription: Melissa Etheridge has announced a new docuseries highlighting her recent concert for women in prison. Get the details.\nsitename: Billboard\ndate: 2024-06-10\ncategories: ['TV/Film']\ntags: ['Country, documentary, Music News']\n---\nAfter putting together a special concert to lift up incarcerated women, Melissa Etheridge is further amplifying her message of self-worth with a new docuseries titled I’m Not Broken — the release date of which was announced Monday (July 10), along with a new trailer.\nPremiering July 9 on Paramount+, the two-part series will follow the country superstar as she plans a way to bring happiness to the Topeka Correctional Facility after receiving letters from a few of its residents. The mission turns into Etheridge writing an original song in their honor and performing it for them at the facility, which is located in her hometown in Kansas.\n“If you’re ever feeling down, my friends, I want you to remember that you are the only you,” she tells the crowd of women from onstage in the trailer.\nTrending on Billboard\nThe show will also touch on how many of the residents struggle with substance abuse issues, something Etheridge has a personal connection to. The “I’m the Only One” singer lost her son Beckett to an opioid addiction in 2020, when he was just 21 years old.\n“Additionally, the docuseries explores themes of female incarceration, redemption, substance abuse, generational trauma, grief and healing,” reads a release. “With female incarceration rates up 700 percent since 1980, Etheridge bonds with the women through the conduit of music as an act of empathy, understanding and hope.”\nBefore dropping on Paramount+, Melissa Etheridge: I’m Not Broken will make its world premiere at the 2024 Tribeca Film & TV Festival this month. Tickets are available for purchase on the event’s website.\nWatch the trailer for I’m Not Broken starring Melissa Etheridge below.",
      "author": "Hannah Dailey",
      "published_date": "2024-06-10",
      "word_count": 329,
      "fetch_timestamp": "2025-08-20T17:14:31.788435",
      "metadata": {
        "char_count": 2174,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T17:14:31.788430"
      }
    }
  ],
  "total_articles": 5,
  "total_words": 2695,
  "extracted_at": "2025-08-20T17:14:32.644553",
  "urls_processed": [
    "https://www.billboard.com/media/podcasts/melissa-etheridge-concert-womens-prison-behind-the-setlist-podcast-1235746589/",
    "https://www.billboard.com/pro/melissa-etheridge-failed-cannabis-business-legal-dispute/",
    "https://www.billboard.com/music/music-news/melissa-etheridge-im-not-broken-clip-performing-at-prisons-1235725720/",
    "https://www.billboard.com/music/music-news/melissa-etheridge-talks-sperm-donor-david-crosby-more-kids-1235723449/",
    "https://www.billboard.com/culture/tv-film/melissa-etheridge-im-not-broken-docuseries-trailer-1235704068/"
  ]
}