{
  "artist_name": "Taylor Swift",
  "source": "guardian",
  "articles": [
    {
      "url": "https://www.theguardian.com/music/2025/aug/14/taylor-swift-travis-kelce-new-heights-podcast-interview-summary-eight-things-we-learned-the-life-of-a-showgirl",
      "source": "guardian",
      "artist_name": "Taylor Swift",
      "title": "Eight things we learned from Taylor Swift and Travis Kelce’s marathon New Heights podcast",
      "content": "---\ntitle: Eight things we learned from Taylor Swift and Travis Kelce’s marathon New Heights podcast\nauthor: Sian Cain\nurl: https://www.theguardian.com/music/2025/aug/14/taylor-swift-travis-kelce-new-heights-podcast-interview-summary-eight-things-we-learned-the-life-of-a-showgirl\nhostname: theguardian.com\ndescription: If you don’t have a spare two hours to listen to Swift talking about The Life of a Showgirl on her boyfriend’s podcast, we did it for you\nsitename: The Guardian\ndate: 2025-08-14\ncategories: ['Music']\ntags: ['Taylor Swift,Music,Travis Kelce,Culture']\n---\nHow Travis and Taylor got together\nTwo years ago, American footballer Travis Kelce famously used the New Heights podcast – which he hosts with his brother Jason – to announce that he wanted to date Taylor Swift. This was after he failed to get her attention at her Eras tour show at Arrowhead Stadium, home to his team, the Kansas City Chiefs. Somehow, it worked: he managed to get the girl.\nSwift has now shed some light on how she felt about this approach.\n“It was such a wild, romantic gesture to just be like, ‘I want to date you’,” she said, looking at Kelce. But he “never did any proper logistical planning” to meet her at Arrowhead, she joked. He didn’t even contact her management. “[He thought] because he knows the elevator lady, that he could talk to her about just getting down to my dressing room. That’s how it works in 1973!”\nAs someone who is “genuinely terrified to open my DMs”, she said Kelce’s blunt announcement intrigued her.\n“This felt more like I was in an 80s John Hughes movie and he was just standing outside of my window with a boombox being like, ‘I want to date you! Do you want to go on a date with me? I made you a friendship bracelet’ … I was like, if this guy isn’t crazy – which is a big if – this is sort of what I’ve been writing songs about wanting to happen to me since I was a teenager.”\nShe described Travis as “a vibe booster in everyone’s life that he’s in. He’s like a human exclamation point.”\nHow they handle attention about their relationship\nJason Kelce asked how his brother and Swift deal with the intense public speculation about their relationship, including the numerous theories going around online. (“I’m way too invested,” Jason said.)\n“I don’t see a lot of things,” Swift said. “I’ve been in the music industry for 20 years. It’s pretty hard to hurt my feelings at this point.”\nTravis Kelce said he’d learned from his girlfriend “how to be a pro about it”.\n“There’s still some wacko theories from the beginning that I was like, ‘Oh no, how is she handling this,’” he said. “The last thing I wanted to do was screw this up.”\nFinding humour in it helped, Swift added: “It’s at a point where … my name can be in the actual headline and it can still be none of my business.”\nThe similarities between being a pro footballer and a pop star\nPart of Swift’s preparation for her three-hour shows on the Eras tour was repeatedly running full speed on a treadmill while singing the entire show. She said Eras required “a lot of physical therapy” and “a lot of being in a state of perpetual discomfort”, including aching feet and plenty of blisters.\nShe saw similarities in Travis’ career: “I’m not getting hit by huge 300-pounders, but the heels …”\n“When I saw the recovery station in the hotel room after [the Eras show], with the toe-spacers … I’m telling you, dude, the similarities were crazy,” Kelce said. “I was like, ‘Oh my gosh. She does more than I do.’ … We related on how much torture we put our bodies through.”\nTaylor sent her mother to buy back her master recordings\nSwift signed with her first label, Big Machine, at 15, giving them the rights to her master recordings. In 2019, label head Scott Borchetta sold her first six albums to music executive and Swift foe Scooter Braun, who then sold them to the private equity firm Shamrock Capital for a reported $300m.\nTo regain control over her catalogue after the sale to Braun – and to devalue his investment – Swift embarked on a project to rerecord the albums, rebranding each one as “(Taylor’s Version)” and adding new tracks.\nAnd in May, the singer bought back the master recordings to all six albums, giving her control over her entire catalogue for the first time.\nOn the podcast, Swift revealed she had been saving to buy back her catalogue since she was a teenager – and “it really ripped my heart out of my chest” each time it was sold.\nWhen the Eras tour ended, she sent her mother and brother to negotiate on her behalf with Shamrock Capital, not lawyers, because she wanted to convey the emotion involved.\n“‘[These are] my handwritten diary entries from my whole life; these are the songs I wrote about every phase of my life’ … Rather than send lawyers or management in a big crew, I sent my mom and my brother,” Swift said, crying. “They told them what this meant for me, they told them the whole story of all the times we’ve tried to buy it, all the times it’s fallen through.”\nShe cried again as she recalled her mother telling her Shamrock had agreed to sell: “I just, like, very dramatically hit the floor … I started bawling my eyes out.”\nShe ran to Travis crying to tell him the news, while he was playing video games. “He thought something was wrong; I started absolutely heaving. I had no power in my legs to support myself.”\nShe said an unexpected bonus of the “Taylor’s Version” rerecords was raising awareness among musicians about what they might be signing away. “I have so many new artists come up to me now and say, ‘Hey, I didn’t even know this was a thing.’”\nTaylor Swift really loves coming up with the Easter eggs\nPerhaps the biggest thing that separates Swifties from the rest of the population is their appetite for Swift’s Easter eggs – hints she drops about her future music or deep-cut callbacks to past songs. (Sorry, Swifties, everyone else is either bewildered or mildly exasperated by this.) For The Life of a Showgirl, for example, she left the stage at her final performance on the Eras tour by walking down an orange tunnel – the colour theme for her 12th album – and has peppered in references to both orange and the number 12 on her social media.\n“People are like, ‘The Easter eggs thing is getting a little Zodiac killer at this point.’ I’m like, as long as they like it, ya know?” Swift said. But: “I’m never gonna plant an Easter egg that ties back to my personal life. It’s always gonna be towards music.”\nShe said her favourite was the 2022 commencement speech she gave at NYU, while receiving an honorary doctorate. Swift says she planted “so many lyrical Easter eggs in that speech” that hinted to Midnights, released later that year.\n“I love numerology, I love math stuff, I love dates, that stuff I just find really fun,” she said.\nShe might be on your baking blog\nSwift revealed that “my hobbies could be categorised as hobbies you could have had in the 1700s.” She likes sewing, painting, cooking and has “a different baking obsession every six months”.\n“I’m the luckiest man in the world,” Travis said.\nThe couple are currently both “very deep in a sourdough obsession that has taken over my life,” Swift said, adding: “I’m really talking about bread 60% of the time. It’s become a huge, huge factor … I’m on sourdough blogs! There’s a whole community of us!”\n“There are a lot of people hoping that you’re on their blog,” Travis joked, to which Swift replied, “Oh, I’m on your blog. Girl, I’m on your blog.”\nTravis Kelce really likes otters\nThe internet agreed Kelce was officially a good guy when a dig through his old tweets turned up this charming nugget from 2011: “I just gave a squirle [sic] a peice [sic] of bread and it straight smashed all of it!!!! I had no idea they ate bread like that!! Haha #crazy.”\nIn between sourdough blogs, Travis shows her videos of wild otters, Swift said.\n“I want a wild otter so bad,” Travis said. “I just want to find these little creatures and be their friend.”\nSwift said: “He wants one specifically whose life he saved and who knows he saved its life … He doesn’t want to go up to an otter and take it from its mother. He wants to see an otter who is like, ‘My paw’s caught in a shell. And he’s like, ‘I got you.’ And then the otter’s like, ‘Thank you forever’, with its little paws.”\n“And then I bring him anchovies every couple months,” Travis said.\nOh, and Swift has a new album coming\nThe Life of a Showgirl is out 3 October, with Swift revealing it is inspired by everything that happened behind the scenes while she was on the Eras tour.\nTravis shared his review: “It’s so much fun … I know there are only 12 bangers. It is a lot more upbeat and a lot more fun pop excitement. I think it’s a complete 180 from a lot of the songs on Tortured Poets, for sure.”\n“Life is more upbeat,” Swift said, laughing.",
      "author": "Sian Cain",
      "published_date": "2025-08-14",
      "word_count": 1572,
      "fetch_timestamp": "2025-08-20T15:48:07.147534",
      "metadata": {
        "char_count": 8796,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:48:07.147514",
        "access_status": "ok",
        "paywall": false
      }
    },
    {
      "url": "https://www.theguardian.com/music/2025/aug/14/taylor-swift-the-life-of-a-showgirl-album-details-release-date-3-october",
      "source": "guardian",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift reveals details of The Life of a Showgirl ahead of October release: ‘Infectiously joyful and wild’",
      "content": "---\ntitle: Taylor Swift reveals details of The Life of a Showgirl ahead of October release: ‘Infectiously joyful and wild’\nauthor: Sian Cain\nurl: https://www.theguardian.com/music/2025/aug/14/taylor-swift-the-life-of-a-showgirl-album-details-release-date-3-october\nhostname: theguardian.com\ndescription: Swift appears on her boyfriend Travis Kelce’s New Heights podcast to discuss the new album, which features Sabrina Carpenter and will come out on 3 October\nsitename: The Guardian\ndate: 2025-08-13\ncategories: ['Music']\ntags: ['Taylor Swift,Music,Culture,Pop and rock']\n---\nTaylor Swift has revealed more details about her upcoming album, The Life of a Showgirl, which includes a collaboration with Sabrina Carpenter on the title track and will be released 3 October.\nThe singer shared the cover and track listing for The Life of a Showgirl on Wednesday night, timed for her appearance on her boyfriend Travis Kelce’s podcast New Heights, which he hosts with his brother, the former fellow professional footballer Jason Kelce.\nThe Life of a Showgirl has 12 tracks – a nod to this being her 12th album – and includes a cover of George Michael’s 1987 song Father Figure.\nSwift told the Kelce brothers that the album was recorded in Europe while she was on her global Eras tour and is inspired by her life while spending two years on the road. The Eras tour became the first billion-dollar tour in history and ended up making more than US$2bn over 21 months.\n“This album is about what was going on behind the scenes in my inner life during this tour, which was so exuberant and electric and vibrant,” she said. “I’m so proud of it. And it comes from the most infectiously joyful, wild, dramatic place I was in in my life, so that effervescence has come through on this record. So as you said, bangers.”\nUnlike her previous album, The Tortured Poets Department, she would not be dropping a second surprise album right afterwards, she said. “There are no other songs coming … with Tortured Poets Department, I was like, ‘Here is a data dump of everything I have thought, felt, experienced in two or three years. Here’s 31 songs.’ This is 12. There’s not a 13th, there’s not other ones coming. This is the record I’ve been wanting to make for a very long time.”\nThe track listing is:\n-\nThe Fate of Ophelia\n-\nElizabeth Taylor\n-\nOpalite\n-\nFather Figure\n-\nEldest Daughter\n-\nRuin the Friendship\n-\nActually Romantic\n-\nWi$h Li$t\n-\nWood\n-\nCancelled!\n-\nHoney\n-\nThe Life of a Showgirl featuring Sabrina Carpenter\nThe album marks the return of Max Martin and Shellback, the Swedish producers who worked on Swift’s albums Red, 1989 and Reputation. Swift called the two men “geniuses” and credited them for working on her favourite of her songs including Shake It Off and Blank Space.\nFans have long speculated that her next songs will draw on Swift’s relationship with Kelce, which they revealed publicly in 2023.\n“Every single song is on this album for hundreds of reasons. You couldn’t take one out and it be the same album, you couldn’t add one. It is just right. That focus and that kind of discipline with creating an album and keeping the bar really high is something I have wanted to do for a very long time,” Swift said.\n“I tend to love to write lots and lots of music, so it’s a temptation to release lots of music,” she added. “But I wanted to do an album that was so focused on quality and the theme and everything fitting together like a perfect puzzle that these 12 songs for my 12th album – I feel we achieved that.”\nHer main goals, she said, were “melodies that were so infectious that you’re almost angry at it” and lyrics that were “just as vivid but crisp and focused and completely intentional.”\nSwift is known for dropping hints and clues for her fans before album announcements and her 12th album was no different. On Monday night on Instagram, Taylor Nation – a branch of Swift’s official marketing team – shared a carousel of 12 images from the Eras Tour, writing in the caption: “Thinking about when she said ‘See you next era … ’” Soon after, a countdown to 12.12am eastern time on 12 August appeared on her website, which was transformed to a glittering orange.\nAt 12.12am Swift’s website briefly crashed, before reappearing with scant details about The Life of a Showgirl.\nThe 35-year-old is among the world’s bestselling musicians, selling an estimated 200m records globally, and she holds the record for most No 1 albums in the US by a female artist in history.\nHer last album, 2024’s The Tortured Poets Department, set a streaming record on Spotify – 300m in one day and 1bn in five – and made her the first artist in history to secure the top 14 spots on the Billboard Hot 100.",
      "author": "Sian Cain",
      "published_date": "2025-08-13",
      "word_count": 809,
      "fetch_timestamp": "2025-08-20T15:48:07.170742",
      "metadata": {
        "char_count": 4693,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:48:07.170737",
        "access_status": "ok",
        "paywall": false
      }
    },
    {
      "url": "https://www.theguardian.com/music/2025/aug/12/taylor-swift-new-album-announcement-countdown-new-heights-podcast-the-life-of-a-showgirl",
      "source": "guardian",
      "artist_name": "Taylor Swift",
      "title": "Taylor Swift announces new album The Life of a Showgirl",
      "content": "---\ntitle: Taylor Swift announces new album The Life of a Showgirl\nauthor: Sian Cain\nurl: https://www.theguardian.com/music/2025/aug/12/taylor-swift-new-album-announcement-countdown-new-heights-podcast-the-life-of-a-showgirl\nhostname: theguardian.com\ndescription: Singer announced her 12th album at 12.12am on 12 August after a countdown, mysterious posts and teasing an appearance on her boyfriend Travis Kelce’s New Heights podcast\nsitename: The Guardian\ndate: 2025-08-12\ncategories: ['Music']\ntags: ['Taylor Swift,Music,Culture,Pop and rock']\n---\nTaylor Swift has announced her next album, The Life of a Showgirl.\nSwift is known for dropping hints and clues for her fans ahead of announcements and this one was no different. On Monday night, a countdown to 12.12am eastern time on 12 August appeared on her website, transformed to a glittering orange.\nOn Instagram, Taylor Nation – a branch of Swift’s official marketing team – shared a carousel of 12 images from the Eras Tour, writing in the caption: “Thinking about when she said ‘See you next era … ’”\nIt was also announced that Swift will appear on her partner Travis Kelce’s podcast New Heights on Wednesday. Eagle-eyed Swifties noticed the silhouette of Swift was taken from her Variety Directors on Directors appearance, which premiered on 12 December 2022. The Variety recording was connected to All Too Well: The Short Film, which was released on 12 November 2021.\nAt 12.12am Swift’s website briefly crashed, before reappearing with scant details about The Life of a Showgirl. The album has no confirmed release date. Swift’s website states that it will be shipped before 13 October, with the caveat: “**THIS IS NOT THE RELEASE DATE, OFFICIAL RELEASE DATE TO BE ANNOUNCED**.”\nThe New Heights podcast later shared a clip of Swift’s appearance, in which she opens a briefcase and takes out a blurred vinyl. “This is my brand new album, The Life of a Showgirl,” she said, while Kelce’s brother and co-host Jason screamed.\nThe 35-year-old is among the world’s bestselling musicians, selling an estimated 200m records globally and holds the record for most No 1 albums in the US by a female artist in history. Her global Eras tour became the first billion-dollar tour in history, selling 2.4m tickets in a single day, and made more than US$2bn over 21 months. Forbes estimated Swift earned $10m-$13m (£8m-£10m) a night.\nHer last album, 2024’s The Tortured Poets Department, set a streaming record on Spotify – 300m in one day and 1bn in five – and made her the first artist in history to secure the top 14 spots on the Billboard Hot 100.\nIn May, Swift bought back the master recordings to her first six albums, giving her control over her entire catalogue for the first time. The singer signed with her first label, Big Machine, in 2005, at the age of 15, giving them the rights to her master recordings. In 2019, label head Scott Borchetta sold those six albums to music executive Scooter Braun, who sold them to the private equity firm Shamrock Capital for a reported $300m.\nTo regain control over her catalogue after the sale to Braun – and to devalue his investment – Swift embarked on a project to rerecord all six albums, rebranding each one as “(Taylor’s Version)” and adding “From the Vault” tracks from the original songwriting sessions that hadn’t made it on to the original albums.\n“I almost stopped thinking it could ever happen, after 20 years of having the carrot dangled and then yanked away,” she wrote in a letter to fans in May, after buying her catalogue back from Shamrock Capital. “But that’s all in the past now. All of the music I’ve ever made … now belongs … to me.”\nReputation and Swift’s self-titled debut album, from 2006, are the only albums not to be rerecorded, with fans speculating as to their possible release dates for years.\nDespite the project now being essentially redundant, it is likely both will have a Taylor’s Version released anyway as Swift remains one of the biggest and most lucrative musical acts in the history of music.",
      "author": "Sian Cain",
      "published_date": "2025-08-12",
      "word_count": 662,
      "fetch_timestamp": "2025-08-20T15:48:07.187226",
      "metadata": {
        "char_count": 4026,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T15:48:07.187222",
        "access_status": "ok",
        "paywall": false
      }
    }
  ],
  "total_articles": 3,
  "total_words": 3043,
  "extracted_at": "2025-08-20T15:48:07.187513",
  "urls_processed": [
    "https://www.theguardian.com/music/2025/aug/14/taylor-swift-travis-kelce-new-heights-podcast-interview-summary-eight-things-we-learned-the-life-of-a-showgirl",
    "https://www.theguardian.com/music/2025/aug/14/taylor-swift-the-life-of-a-showgirl-album-details-release-date-3-october",
    "https://www.theguardian.com/music/2025/aug/12/taylor-swift-new-album-announcement-countdown-new-heights-podcast-the-life-of-a-showgirl"
  ]
}