{
  "artist_name": "Tupac Shakur",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/pro/tupac-shakur-murder-suspect-wants-charges-dismissed-why/",
      "source": "billboard",
      "artist_name": "Tupac Shakur",
      "title": "Here’s Why Tupac Shakur Murder Suspect Wants His Charges Dismissed By Supreme Court",
      "content": "---\ntitle: Here’s Why Tupac Shakur Murder Suspect Wants His Charges Dismissed By Supreme Court\nauthor: Bill Donahue\nurl: https://www.billboard.com/pro/tupac-shakur-murder-suspect-wants-charges-dismissed-why/\nhostname: billboard.com\ndescription: Tupac Shakur murder suspect Duane “Keffe D” Davis wants his charges dismissed by the Nevada Supreme Court -- here's why.\nsitename: Billboard\ndate: 2025-07-30\ncategories: ['Legal News']\ntags: ['genre hiphop, Legal, murder, Trial']\n---\nHere’s Why Tupac Shakur Murder Suspect Wants His Charges Dismissed By Supreme Court\nThe man accused of orchestrating the 1996 Las Vegas drive-by shooting that killed the rap legend has taken his case to Nevada's top court. Here's why.\nDuane “Keffe D” Davis, the man facing a looming murder trial over the 1996 killing of Tupac Shakur in Las Vegas, is now asking the Nevada Supreme Court to toss out the charges.\nMonths after a judge allowed the case to proceed to trial, Davis’ lawyers are urging the state’s top court to overturn that decision – arguing that prosecutors lack any hard evidence and are instead relying on decades-old statements that should be off-limits.\n“This prosecution has captured worldwide attention,” writes defense attorney Carl Arnold in the Tuesday court filing, obtained by Billboard. “The global public is watching how Nevada upholds due process, fairness, and the rule of law in one of the most closely scrutinized criminal proceedings in recent memory.”\nThe drive-by shooting that killed Tupac and the subsequent murder of rival Notorious B.I.G. have for decades been two of music’s great unsolved mysteries. But in September 2023, Davis was arrested in September 2023 and charged with first-degree murder over allegations that he orchestrated the Shakur slaying.\nTrending on Billboard\nThe 62-year-old, a former Crips gang leader from Los Angeles, had repeatedly admitted involvement in the killing, including in a 2019 tell-all memoir in which he says he obtained the gun and handed it to his nephew, Orlando “Baby Lane” Anderson, who allegedly pulled the trigger. Anderson has since died, as have others who were allegedly in the car.\nSince his arrest, Davis has pleaded not guilty and repeatedly maintained his innocence, including by publicly arguing that did not write the book: “They can’t even place me out here,” he told ABC in a March jailhouse interview.\nIn January, his lawyers moved to have the charges thrown out, arguing that the state was planning an “illegal trial” that would violate his client’s constitutional rights: “They need to have something else, a gun, a witness, something else that puts this gentleman, those three co-conspirators in the car,” Arnold argued during a court hearing.\nBut weeks later, Clark County District Court Judge Carli Kierny denied that motion, allowing the case to move ahead toward a courtroom showdown. A jury trial is currently scheduled for February 2026.\nAppealing that ruling on Tuesday, lawyers for Davis again cite a lack of concrete evidence to support the decades-delayed charges. They say the case is built only on his purported confessions, including during interviews with investigators in which Davis was promised immunity. Outside those statements, they say prosecutors have no real proof.\n“Nevada law is unambiguous: a conviction cannot rest solely on an uncorroborated extrajudicial statement,” Arnold writes. “The State has offered nothing to corroborate the trustworthiness of Mr. Davis’s alleged statements, and nothing independently connecting him to the murder itself.”\nSuch arguments are sometimes made on appeal after a trial has already been held, seeking to overturn a conviction. But lawyers for Davis say top court must jump in now, warning that post-trial appeals could add years to a case that has already seen “extraordinary delay.”\n“Although Mr. Davis was not charged until 2023, the prosecution arises from a homicide that occurred in 1996—nearly three decades ago,” his lawyers say. “The Court should exercise its discretion to hear the petition on the merits now—before the damage is done.”",
      "author": "Bill Donahue",
      "published_date": "2025-07-30",
      "word_count": 631,
      "fetch_timestamp": "2025-08-20T16:25:32.448103",
      "metadata": {
        "char_count": 4085,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:25:32.448094"
      }
    },
    {
      "url": "https://www.billboard.com/pro/tupac-shakur-notorious-big-photos-lawsuit-univision/",
      "source": "billboard",
      "artist_name": "Tupac Shakur",
      "title": "Tupac Shakur & Notorious B.I.G. Photos at Center of New Copyright Lawsuit Against Univision",
      "content": "---\ntitle: Tupac Shakur & Notorious B.I.G. Photos at Center of New Copyright Lawsuit Against Univision\nauthor: Bill Donahue\nurl: https://www.billboard.com/pro/tupac-shakur-notorious-big-photos-lawsuit-univision/\nhostname: billboard.com\ndescription: Photographs of Tupac Shakur and Notorious B.I.G. are at the center of a new copyright infringement lawsuit against Univision.\nsitename: Billboard\ndate: 2025-05-16\ncategories: ['Legal News']\ntags: ['Copyright, genre rap, Legal, univision']\n---\nTupac Shakur & Notorious B.I.G. Photos at Center of New Copyright Lawsuit Against Univision\nThe case, filed by two photographers over separate photos of the legendary rappers, is one of many recent court battles over the late superstars.\nLegendary rappers Tupac Shakur and Notorious B.I.G. might have been rivals in life, but they’re now united in copyright litigation.\nA pair of photographers who snapped separate photos of the late hip-hop stars are teaming up to sue Univision for copyright infringement, accusing the broadcaster of using the images without permission in a web article about “Unsolved” murders.\n“Plaintiffs sent a letter to Univision, demanding that it cease and desist all publication and display of the Subject Photographs,” write lawyers for the photographers in their Wednesday suit. “Univision has failed to meaningfully respond, necessitating this action.”\nThe case was filed by the estate of Chi Modu, a well-known hip hop photographer, over a black and white picture of Biggie looking into the camera in his trademark Coogi sweater and sunglasses; and by Dana Lixenberg, another acclaimed photog who has snapped pictures of Iggy Pop and Steely Dan, over an image of Pac in a bandana and sports jersey.\nTrending on Billboard\nAttorneys for Modu’s estate and Lixenberg say Univision stitched the images together and used them as art for a 2018 article reporting that a trailer had been released for a USA Network documentary series called Unsolved: The Murders of Tupac and The Notorious B.I.G.\nThough Biggie and Tupac have both been gone for nearly 30 years, Wednesday’s lawsuit is just one of many recent intellectual property battles over the two iconic rappers.\nModu’s estate filed one of them, suing Universal Music Group in 2022 for allegedly using a Tupac photo in a blog post. Then last year, Shakur’s own estate threatened to sue Drake for using an AI-generated version of the later rapper’s voice. And in February, Biggie’s estate filed a lawsuit against Target, Home Depot and other retailers over allegations that they sold unauthorized canvas prints of the famed “King of New York” photo. Coogi even got in on the action in 2018, suing the Brooklyn Nets after they released a multi-colored jersey that were “inspired by Biggie” and paid homage to the Brooklyn-born rapper.\nIn one case, Biggie’s estate sued Modu himself, claiming the photographer had illegally authorized the use of his photos on commercial products like skateboards and shower curtains. In 2022, a year after the famed photographer passed away, a judge ruled that such merch likely violated the rapper’s likeness rights. The case ended in a settlement last year.\nReps for Univision did not immediately return a request for comment on the new lawsuit on Friday.",
      "author": "Bill Donahue",
      "published_date": "2025-05-16",
      "word_count": 506,
      "fetch_timestamp": "2025-08-20T16:25:32.502751",
      "metadata": {
        "char_count": 3258,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:25:32.502745"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/tupac-shakur-murder-suspect-seeks-trial-delay-over-new-witnesses-1235903668/",
      "source": "billboard",
      "artist_name": "Tupac Shakur",
      "title": "Suspect in Tupac Shakur Killing Seeks Trial Delay Over New Witnesses",
      "content": "---\ntitle: Suspect in Tupac Shakur Killing Seeks Trial Delay Over New Witnesses\nauthor: Associated Press\nurl: https://www.billboard.com/music/music-news/tupac-shakur-murder-suspect-seeks-trial-delay-over-new-witnesses-1235903668/\nhostname: billboard.com\ndescription: Attorneys for Tupac Shakur's murder suspect Duane \"Keffe D\" Davis seek to delay his trial for more time to complete investigative work.\nsitename: Billboard\ndate: 2025-02-16\ncategories: ['Music News']\ntags: ['genre hiphop, Legal, Music News']\n---\nAttorneys for the man suspected of killing rap icon Tupac Shakur want to delay next month’s trial, saying more time is needed for investigative work to ensure that Duane “Keffe D” Davis gets a fair trial.\nThe motion filed Friday (Feb. 14) in a Nevada court provides insight into Davis’ defense, noting that a private investigator has identified witnesses who can testify that he was not at the scene of the 1996 shooting, nor was he in Las Vegas at the time.\nThe motion also suggests that someone else may have orchestrated the shooting and that witnesses who could testify on the matter are being interviewed.\nTrending on Billboard\nThe defense team said in a statement that the new developments and the need to interview key witnesses necessitate a delay. A hearing was scheduled Tuesday to discuss the timing of the trial, currently set to begin in March.\n“This case involves decades-old allegations, and with every new piece of evidence, it becomes increasingly clear that critical facts have yet to be fully examined,” said attorney Carl Arnold, who is leading Davis’ defense.\nOn the night of Sept. 7, 1996, Shakur was in a BMW being driven by Death Row Records founder Marion “Suge” Knight. They were waiting at a red light when a white Cadillac pulled up next to them and gunfire erupted.\nDavis, an ex-gang leader who is accused of orchestrating Shakur’s killing near the Las Vegas Strip, has pleaded not guilty to first-degree murder and has been jailed since his September 2023 arrest.\nLong known to investigators as one of four suspects identified early in the investigation, he is the only one to be charged.\nArnold has argued that Davis never should have been charged because of immunity agreements that Davis says he reached years ago with federal and local prosecutors while living in California.\nProsecutors have said any immunity agreement was limited and they have strong evidence against Davis, including his own accounts of the shooting in the tell-all memoir Compton Street Legend.\nDavis has acknowledged in interviews and in the memoir that he provided the gun used in the drive-by shooting and that he was in the car. But his court filings say his descriptions in recent years of orchestrating the shooting were “done for entertainment purposes and to make money.”\nDefense attorneys also say they have witness information indicating that Shakur was in stable condition after the shooting and that he died suddenly after being hospitalized for a week. They were consulting medical and forensic experts to evaluate potential alternative causes of death.",
      "author": "Associated Press",
      "published_date": "2025-02-16",
      "word_count": 485,
      "fetch_timestamp": "2025-08-20T16:25:32.551749",
      "metadata": {
        "char_count": 3085,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T16:25:32.551743"
      }
    },
    {
      "url": "https://www.billboard.com/music/rb-hip-hop/tupac-murder-suspect-keefe-d-750000-bail-trial-1235716200/",
      "source": "billboard",
      "artist_name": "Tupac Shakur",
      "title": "Tupac Shakur Murder Suspect Duane ‘Keefe D’ Davis to Post $750K Bail Ahead of Trial",
      "content": "---\ntitle: Tupac Shakur Murder Suspect Duane ‘Keefe D’ Davis to Post $750K Bail Ahead of Trial\nauthor: Angel Diaz\nurl: https://www.billboard.com/music/rb-hip-hop/tupac-murder-suspect-keefe-d-750000-bail-trial-1235716200/\nhostname: billboard.com\ndescription: Tupac murder suspect Duane \"Keefe D\" Davis is set to post his $750K bail ahead of the murder trial. Get the details.\nsitename: Billboard\ndate: 2024-06-24\ncategories: ['R&B/Hip-Hop']\ntags: ['Legal, Music News, R&Bhip-hop']\n---\nKeefe D, the prime suspect in the 1996 murder of Tupac Shakur, is making bail. Born Duane Davis, Keefe D has informed the Clark County District Court in Nevada that he can now post his $750,000 bail, according to the bail bond document filed Thursday (June 20) obtained by Billboard.\nAccording to local ABC affiliate KTNV in Las Vegas, Davis will appear in court Tuesday, June 25, at 9 a.m. to hear Judge Carli Kierny’s stipulations for his release, and to verify to the prosecution where the money came from. Davis, who pleaded not guilty to one count of murder with a deadly weapon, has been sitting in the Clark County Detention Center in Las Vegas since he was arrested in September as he awaits trial set to start Nov. 4. Clark County District Judge Jerry Wiese originally denied Davis bail when he was first taken into custody.\nTrending on Billboard\nBillboard has reached out to Keefe D’s lawyers for comment.\nKeefe D published his memoir, Compton Street Legend, in 2019. In it, he went into detail about the night of Tupac’s murder. “One of my guys from the back seat grabbed the Glock and started bustin’ back,” Keefe D wrote in his book. “As the rounds continued flying, I ducked down so that I wouldn’t get hit.”\nHe also appeared in multiple interviews over the years in which he discussed the night of the murder.\nThese instances may have violated his 2009 proffer agreement with Los Angeles investigators, in which Davis gave them information about the Tupac’s murder in exchange for immunity. However, Keefe D violated the terms when he began to speak on the details of the murder publically. Law enforcement had kept tabs on the times Davis has talked about the murder publicly, and used his own admissions as evidence, which eventually led to his arrest.",
      "author": "Angel Diaz",
      "published_date": "2024-06-24",
      "word_count": 368,
      "fetch_timestamp": "2025-08-20T16:25:32.601665",
      "metadata": {
        "char_count": 2253,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:25:32.601660"
      }
    },
    {
      "url": "https://www.billboard.com/pro/tupac-shakur-estate-drake-diss-track-ai-generated-voice/",
      "source": "billboard",
      "artist_name": "Tupac Shakur",
      "title": "Tupac Shakur’s Estate Threatens to Sue Drake Over Diss Track Featuring AI-Generated Tupac Voice",
      "content": "---\ntitle: Tupac Shakur’s Estate Threatens to Sue Drake Over Diss Track Featuring AI-Generated Tupac Voice\nauthor: Bill Donahue\nurl: https://www.billboard.com/pro/tupac-shakur-estate-drake-diss-track-ai-generated-voice/\nhostname: billboard.com\ndescription: Tupac Shakur’s estate threatened a lawsuit against Drake over a diss track aimed at Kendrick Lamar featuring an AI-generated version of Tupac's voice.\nsitename: Billboard\ndate: 2024-04-24\ncategories: ['Legal News']\ntags: ['A.I., Artificial Intelligence, Legal']\n---\nTupac Shakur’s Estate Threatens to Sue Drake Over Diss Track Featuring AI-Generated Tupac Voice\nIn a cease-and-desist letter to Drake obtained exclusively by Billboard, the late rapper's estate says it is \"deeply dismayed\" and would \"never have given its approval.\"\nTupac Shakur’s estate is threatening to sue Drake over a recent diss track against Kendrick Lamar that featured an AI-generated version of the late rapper’s voice, calling it a “a flagrant violation” of the law and a “blatant abuse” of his legacy.\nIn a Wednesday cease-and-desist letter obtained exclusively by Billboard, litigator Howard King told Drake (Aubrey Drake Graham) that he must confirm that he will pull down his “Taylor Made Freestyle” in less than 24 hours or the estate would “pursue all of its legal remedies” against him.\nTrending on Billboard\n“The Estate is deeply dismayed and disappointed by your unauthorized use of Tupac’s voice and personality,” King wrote in the letter. “Not only is the record a flagrant violation of Tupac’s publicity and the estate’s legal rights, it is also a blatant abuse of the legacy of one of the greatest hip-hop artists of all time. The Estate would never have given its approval for this use.”\nDrake released “Taylor Made” on Friday, marking the latest chapter in a back-and-forth war of words between the Canadian rapper and Lamar. Beyond taking shots at both Kendrick and Taylor Swift, the track made headlines because of its prominent use of artificial intelligence technology to create fake verses from Tupac and Snoop Dogg – two West Coast legends idolized by the LA-based Lamar.\n“Kendrick, we need ya, the West Coast savior/ Engraving your name in some hip-hop history,” the AI-generated Tupac raps in Drake’s song. “If you deal with this viciously/ You seem a little nervous about all the publicity.”\nIn Tuesday’s letter, Tupac’s estate warned Drake that the use of his voice clearly violated Tupac’s so-called publicity rights – the legal power to control how your image or likeness is used by others. And they took particular exception to the use of his voice to take shots at Lamar.\n“The unauthorized, equally dismaying use of Tupac’s voice against Kendrick Lamar, a good friend to the Estate who has given nothing but respect to Tupac and his legacy publicly and privately, compounds the insult,” King wrote.\nA rep for Drake declined to comment on the demands of the Shakur estate.\nIt’s unclear if Snoop Dogg, whose voice was also featured on “Taylor Made,” is planning to raise similar legal objections to Drake’s track. On Saturday, he posted a video to social media in which he seemed to be learning of the song for the first time: “They did what? When? How? Are you sure?” A rep for Snoop Dogg did not return a request for comment.\nThe unauthorized use of voice cloning technology has become one of the music industry’s thorniest legal subjects, as AI-powered tools have made easier than ever to convincingly mimic real artists.\nThe issue exploded onto the scene last year, when an unknown artist named Ghostwriter released a track called “Heart On My Sleeve” that featured – ironically – fake verses from Drake’s voice. Since then, as voice-cloning has proliferated on the internet, industry groups, legal experts and lawmakers have wrangled over how best to crack down on it.\nIt’s not as simple as it might seem. Federal copyrights are difficult to directly apply, since cloned vocals usually feature new words and music that are distinct from existing copyrighted songs. The publicity rights cited by the estate are a better fit because they protect someone’s likeness itself, but they have historically been used more often to sue over advertisements and other commercial uses, rather than over creative works like songs.\nFaced with that legal uncertainty, the recording industry and top artists have pushed for new legislation to address the problem. Last month, Tennessee passed a statute called the ELVIS Act that aims to crack down on voice cloning by expanding the state’s publicity right laws beyond just advertisements. Lawmakers in Washington DC are also considering similar bills that would create new, broader publicity rights at a federal level.\nIn Wednesday’s letter, however, the estate said that California’s existing publicity right laws clearly outlaw something as blatant as Drake’s use of Tupac’s voice in “Taylor Made.” King argued that the song had caused “substantial economic and reputational harm” by creating the “false impression that the estate and Tupac promote or endorse the lyrics for the sound-alike.”\nThe estate also argued that the song was likely created using an AI model that violated the estate’s copyrights by “training” on existing recordings of Tupac’s music. The legality of using copyrighted “inputs” is another difficult legal issue that’s currently being tested in several closely-watched lawsuits against AI developers, including one filed by major music publishers.\n“It is hard to believe that [Tupac’s record label]’s intellectual property was not scraped to create the fake Tupac AI on the Record,” King wrote, before demanding that Drake also provide “a detailed explanation for how the sound-alike was created and the persons or company that created it, including all recordings and other data ‘scraped’ or used.”\nWednesday’s letter also pointedly highlighted that Drake himself has made previous objections to the use of his own likeness by others. In addition to last year’s incident surrounding “Heart on My Sleeve” — which was quickly pulled down from the internet — King pointed to a lesser-known federal lawsuit in which Drake’s attorneys accused a website of using his image without authorization.\n“The [“Taylor Made Freestyle”] has generated well more than one million streams at this point and has been widely reported in the general national press and popular entertainment websites and publications,” the estate wrote. “Without question, it is exponentially more serious and damaging than a picture of you with some other people on a low volume website.”\nIn its closing paragraphs, the letter demanded written confirmation by noon Pacific on Thursday that Drake’s representatives were “expeditiously taking all steps necessary to have it removed.”\n“If you comply, the estate will consider whether an informal negotiation to resolve this matter makes sense,” King wrote. “If you do not comply, our client has authorized this firm to pursue all of its legal remedies including, but not limited to, an action for violation of … the estate’s copyright, publicity and personality rights and the resulting damages, injunctive relief, and punitive damages and attorneys’ fees.”",
      "author": "Bill Donahue",
      "published_date": "2024-04-24",
      "word_count": 1134,
      "fetch_timestamp": "2025-08-20T16:25:32.659976",
      "metadata": {
        "char_count": 7192,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:25:32.659971"
      }
    },
    {
      "url": "https://www.billboard.com/business/legal/tupac-shakur-killing-suspect-bail-set-1235578819/",
      "source": "billboard",
      "artist_name": "Tupac Shakur",
      "title": "Tupac Shakur Murder Suspect’s Bail Set at $750,000",
      "content": "---\ntitle: Tupac Shakur Murder Suspect’s Bail Set at $750,000\nauthor: Associated Press\nurl: https://www.billboard.com/business/legal/tupac-shakur-killing-suspect-bail-set-1235578819/\nhostname: billboard.com\ndescription: Tupac Shakur killing suspect Duane Davis had his bail set at $750,000 by a judge, who says he can serve house arrest while awaiting trial.\nsitename: Billboard\ndate: 2024-01-09\ncategories: ['Legal News']\ntags: ['Duane Davis, Legal']\n---\nA judge set bail Tuesday at $750,000 for a former Los Angeles-area gang leader charged with orchestrating the killing of hip-hop legend Tupac Shakur in 1996 and said he can serve house arrest with electronic monitoring ahead of his trial in June.\nCourt-appointed attorneys for Duane “Keffe D” Davis told The Associated Press after the hearing in Las Vegas that they believe he can post bail. They had asked for bail of not more than $100,000.\nThe lawyers argued in a court filing a day before that their client — not witnesses, as prosecutors had said — faced danger. And they say that their 60-year-old client is in poor health after battling cancer, which is in remission, and that he won’t flee to avoid trial.\nTrending on Billboard\n“We believe he can” post bail, public defender Robert Arroyo said after Tuesday’s hearing.\nThe lawyers accused prosecutors of misinterpreting a jail telephone recording and a list of names provided to Davis’ family members, and of misreporting to the judge that Davis poses a threat to the public if he were released.\nDavis “never threatened anyone during the phone calls,” said Arroyo and Charles Cano, deputy special public defenders, in their seven-page filing Monday. “Furthermore, (prosecutors’) interpretation of the use of ‘green light’ is flat-out wrong.”\nThe “green light” reference is from a recording of an October jail call that prosecutors Marc DiGiacomo and Binu Palal provided last month to Clark County District Judge Carli Kierny, who presided over the bail hearing.\nThe prosecution’s filing made no reference to Davis instructing anyone to harm someone, or to anyone associated with the case being physically harmed. But the prosecutors added that “In (Davis’) world, a ‘green light’ is an authorization to kill.”\n“Duane’s son was saying he heard there was a greenlight on Duane’s family,” Davis’ attorneys wrote, using his first name. “Duane obviously did not know what his son was talking about.”\nDavis’ lawyers also used his first name Monday, asking Kierny to consider what they called “the obvious question.”\n“If Duane is so dangerous, and the evidence so overwhelming,” they wrote, “why did (police and prosecutors) wait 15 years to arrest Duane for the murder of Tupac Shakur?”\nProsecutors point to Davis’ own words since 2008 — in police interviews, in a 2019 tell-all memoir and in the media — that they say provides strong evidence that he orchestrated the September 1996 shooting.\nDavis’ attorneys argue that his descriptions of Shakur’s killing were “done for entertainment purposes and to make money.”\nDavis, originally from Compton, California, is the only person still alive who was in the car from which shots were fired in the drive-by shooting that also wounded rap music mogul Marion “Suge” Knight. Knight is now serving 28 years in a California prison for an unrelated fatal shooting in the Los Angeles area in 2015.\nDavis’ attorneys noted Monday that Knight is an eyewitness to the Shakur shooting but did not testify before the grand jury that indicted Davis ahead of his arrest arrest Sept. 29 outside his Henderson home. Las Vegas police had served a search warrant at the house in mid-July.\nDavis has pleaded not guilty to murder and has been jailed without bail at the Clark County Detention Center in Las Vegas, where detainees’ phone calls are routinely recorded. If convicted at trial, he could spend the rest of his life in prison.\nDavis maintains he was given immunity from prosecution in 2008 by an FBI and Los Angeles police task force investigating the killings of Shakur in Las Vegas and rival rapper Christopher Wallace, known as The Notorious B.I.G. or Biggie Smalls, six months later in Los Angeles.\nDiGiacomo and Palal say any immunity agreement was limited. Last week, they submitted to the court an audio recording of a Dec. 18, 2008, task force interview during which they said Davis “was specifically told that what he said in the room would not be used against him, but (that) if he were talk to other people, that could put him in jeopardy.”\nDavis’ attorneys responded Monday with a reference to the publication 12 years ago of a book written by former Los Angeles police Detective Greg Kading, who attended those interviews.\n“Duane is not worried,” the attorneys said, “because his alleged involvement in the death of Shakur has been out in the public since … 2011.”",
      "author": "Associated Press",
      "published_date": "2024-01-09",
      "word_count": 785,
      "fetch_timestamp": "2025-08-20T16:25:32.708576",
      "metadata": {
        "char_count": 4822,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:25:32.708571"
      }
    },
    {
      "url": "https://www.billboard.com/pro/actively-black-tupac-shakur-estate-new-apparel-collection/",
      "source": "billboard",
      "artist_name": "Tupac Shakur",
      "title": "Actively Black and Shakur Estate Launch New Apparel Collection",
      "content": "---\ntitle: Actively Black and Shakur Estate Launch New Apparel Collection\nauthor: Gail Mitchell\nurl: https://www.billboard.com/pro/actively-black-tupac-shakur-estate-new-apparel-collection/\nhostname: billboard.com\ndescription: Actively Black, a Black-owned global sportswear brand, has partnered with the Shakur Estate to introduce a new collection: Tupac X Actively Black.\nsitename: Billboard\ndate: 2024-12-19\ncategories: ['Business News']\ntags: ['Branding, Hip-Hop, sportswear']\n---\nActively Black and Shakur Estate Launch New Apparel Collection\nTupac X Actively Black will become available on Christmas Day.\nActively Black, a Black-owned global sportswear brand, has partnered with the Shakur Estate to introduce a new collection: Tupac X Actively Black. Inspired by the late rapper’s enduring legacy as a music icon and poet, the first drop in the new line will be available for purchase on Christmas Day (Dec. 25), exclusively at activelyblack.com.\nIn a statement announcing Tupac X Actively Black, the Shakur Estate commented, “With this collaboration, Actively Black celebrates Tupac’s enduring impact on culture, creativity and artistry. Actively Black’s commitment to empowering the Black community perfectly aligns with Tupac’s mission to inspire and spark meaningful change. Inspired by [the poem] “The Rose That Grew from Concrete,” this collection honors Tupac’s voice and message, ensuring it resonates with a new generation.”\nTrending on Billboard\nThe first drop features a collection of unisex hoodies and T-shirts illustrated with custom co-branded artwork and imagery from Tupac’s archives. The standout piece in the new collection is a relaxed hoodie in washed grey with a graphic rendering of the poem in the late rapper’s own handwriting.\n“I grew up listening to Tupac, and even before I fully understood the content of his music, there was something moving about his delivery that resonated with me and so many others still, to this day,” said Lanny Smith, founder of Actively Black. “In early interviews of Tupac, you can see his passion to breathe new life into the Black pride movement. His awareness about the truths of society and determination to improve the lives of his people was awe-inspiring.”\nTupac X Actively Black is the latest collaboration from Actively Black. The company recently introduced a new apparel collaboration with Disney in celebration of the latter’s Mufasa: The Lion King. Earlier this year, Actively Black partnered with the Nigerian Olympic delegation, serving as the official outfitter and apparel sponsor for team Nigeria at the 2024 Paris Olympic Games. The company’s additional partnerships and collaborations include the estates of Muhammad Ali, Michael Jackson and Bob Marley as well as sports franchises the Sacramento Kings and Houston Rockets.\nA former NBA player for the Sacramento Kings, Smith launched Actively Black in 2020. Of the upcoming debut of Tupac X Actively Black, Smith singled out a favorite Shakur quote in the announcement release. “One of his quotes has always stayed with me: ‘I may not change the world, but I guarantee I will spark the brain of someone who will.’ I am one of the minds Tupac sparked; and Actively Black is an extension of our shared mission to uplift and empower our people. Tupac X Actively Black is an ode to the genius of Tupac Shakur. He represented us: the Black community, boldly and unapologetically; his legacy embodies what it means to be ACTIVELY Black.”",
      "author": "Gail Mitchell",
      "published_date": "2024-12-19",
      "word_count": 530,
      "fetch_timestamp": "2025-08-20T16:25:33.155621",
      "metadata": {
        "char_count": 3465,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T16:25:33.155615"
      }
    }
  ],
  "total_articles": 7,
  "total_words": 4439,
  "extracted_at": "2025-08-20T16:25:33.323629",
  "urls_processed": [
    "https://www.billboard.com/pro/tupac-shakur-murder-suspect-wants-charges-dismissed-why/",
    "https://www.billboard.com/pro/tupac-shakur-notorious-big-photos-lawsuit-univision/",
    "https://www.billboard.com/music/music-news/tupac-shakur-murder-suspect-seeks-trial-delay-over-new-witnesses-1235903668/",
    "https://www.billboard.com/music/rb-hip-hop/tupac-murder-suspect-keefe-d-750000-bail-trial-1235716200/",
    "https://www.billboard.com/pro/tupac-shakur-estate-drake-diss-track-ai-generated-voice/",
    "https://www.billboard.com/business/legal/tupac-shakur-killing-suspect-bail-set-1235578819/",
    "https://www.billboard.com/pro/actively-black-tupac-shakur-estate-new-apparel-collection/"
  ]
}