{
  "artist_name": "John Lennon",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/22393-unfinished-music-no-1-two-virgins-unfinished-music-no-2-life-with-the-lions-yoko-ono-plastic-ono-band/",
      "source": "pitchfork",
      "artist_name": "John Lennon",
      "title": "Yoko Ono / John Lennon: Unfinished Music No. 1: Two Virgins / Unfinished Music No. 2: Life With the Lions / Yoko Ono Plastic Ono Band",
      "content": "---\ntitle: Yoko Ono / John Lennon: Unfinished Music No. 1: Two Virgins / Unfinished Music No. 2: Life With the Lions / Yoko Ono Plastic Ono Band\nauthor: Seth Colter Walls\nurl: https://pitchfork.com/reviews/albums/22393-unfinished-music-no-1-two-virgins-unfinished-music-no-2-life-with-the-lions-yoko-ono-plastic-ono-band/\nhostname: pitchfork.com\ndescription: Yoko Ono’s radical influence on pop history has inspired generations of visionary musicians. Deeply rooted in Fluxus, Ono’s newly-reissued early albums help to detail her broader artistic intentions.\nsitename: Pitchfork\ndate: 2016-12-05\n---\nCourting confusion is part of the job description for anyone working in the avant-garde. Some experimenters meet this requirement with the equivalent of a shrug, while others take to the task with more evident relish. For over half a century, the singer and visual artist Yoko Ono has found herself in the latter camp, gleefully scrawling her new approaches into the official ledgers of cultural production.\nThe editors of the recent volume Fluxbooks credit Ono’s 1964 Grapefruit as being “one of the first works of art in book form.” Ono’s early short films likewise helped expand cinematic practices. In the years before she started dating a Beatle, Ono sang with one of John Cage’s most trusted musical interpreters, and turned a New York loft space into a contemporary-art destination that drew the likes of Marcel Duchamp to her door.\nYet this multimedia artist’s most notorious act of provocation was her approach to becoming tabloid fodder. She took one of the world’s most popular musicians and hurried along his engagement with the experimental fringe (an attraction already evident in John Lennon’s work, as early as 1966’s Revolver). In some quarters, she’s never been forgiven for this. But Ono’s radical influence on pop history has also inspired generations of visionary artists.\nThe Lennon/Ono collaborative albums were a critical part of their take on celebrity coupledom. Their first two LPs carried the series title “Unfinished Music,” a conceptual gambit with deeper roots in the aesthetic of the Fluxus art movement than in that of the British Invasion. The first set to be issued, subtitled Two Virgins, was a sound-collage set reportedly produced during their first night together. The album’s name, and the full-frontal nudity of its cover, referenced the couple’s sense of innocence in approaching a new beginning—as well as the fact that the recording took place just prior to the consummation of their relationship.\nAs the product of a first date, Two Virgins is fascinating. As a sound artifact from the initial decade of Fluxus-inspired activity, it has plenty of competition. Casual clips of the couple’s conversations—mixed in alongside Lennon’s tape loops—blur the distinction between the private and the public-facing. This approach recalls efforts by some of Ono’s contemporaries, like Charlotte Moorman and Benjamin Patterson. But what makes Two Virgins distinct is the range of Ono’s voice. In the opening moments, she contributes some pure-tone humming, which sounds downright companionable amid Lennon’s meandering keyboard motifs and reverb tape-effects. Four-and-a-half-minutes in, Ono unleashes the first of her extended yelps, from the top of her range. Even if you know it’s coming, this sound always registers as shocking.",
      "author": "Seth Colter Walls",
      "published_date": "2016-12-05",
      "word_count": 504,
      "fetch_timestamp": "2025-08-20T07:37:45.250074",
      "metadata": {
        "char_count": 3365,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:37:45.250065"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/14754-signature-box-power-to-the-people-the-hits/",
      "source": "pitchfork",
      "artist_name": "John Lennon",
      "title": "John Lennon: Signature Box / Power to the People: The Hits",
      "content": "---\ntitle: John Lennon: Signature Box / Power to the People: The Hits\nauthor: Douglas Wolk\nurl: https://pitchfork.com/reviews/albums/14754-signature-box-power-to-the-people-the-hits/\nhostname: pitchfork.com\ndescription: Seventy years after his birth and 30 after his death, John Lennon's oddly frustrating, brutal, honest, lazy, and self-important solo career is again issued.\nsitename: Pitchfork\ndate: 2010-10-22\n---\nIt's 70 years after John Lennon's birth, and 30 after his death, and his solo career is still a knotty, vexing mess. The current round of reissues and repackages includes the third and fourth posthumous boxed sets of his work, and the fifth-or-so stab at a greatest-hits compilation; they're still not nearly as satisfying as you'd expect from one of the most important figures in the history of rock. That's partly because Lennon spent his solo years painfully aware of how important he was, alternately trying to see how he could use his fame to act in the world and how he could rebel against his fame's trappings.\nLennon had gotten a head start on his solo career: In the final couple of years of the Beatles, he'd started batting out records as reports from the front, whether or not his bandmates were available or interested. In 1968 and 1969, he made three albums with Yoko Ono, in her idiom (conceptual art) but his medium (LPs), none of them in the current batch of reissues. The two of them also started releasing singles credited to the Plastic Ono Band-- a John song on the A-side, a Yoko song on the B-side. The first Plastic Ono Band single, \"Give Peace a Chance\", was the soundtrack to a clever bit of political branding; \"Cold Turkey\" was written and recorded very shortly after he kicked heroin, in late summer 1969; \"Instant Karma!\" was in record stores 10 days after it was written.\nThe odd thing about John and Yoko's simultaneously released, identically designed solo albums entitled Plastic Ono Band is that hers is more suited to repeated listening, but his is better as conceptual art. (It's still pretty good as music: He's backed up by Ringo Starr, Billy Preston, and longtime Beatles associate Klaus Voormann.) The concept was the biggest rock star in the world breaking his wand and burning his books; directly expressing his unseemly emotions; doing things he would never, ever have gotten away with in the Beatles. He starts the album by working himself up into a total howling breakdown about his parental abandonment issues-- in 1970, you did not do that in public, ever-- and spends the rest of it essentially stripping himself naked. (He'd already done that, literally, on the cover of his and Yoko's first collaboration, Two Virgins.) \"God\" takes the concept to its destination: it's Lennon declaring, bluntly, that every myth that has ever given his audience comfort, up to and including the Beatles, is no longer of use-- \"the dream is over.\"",
      "author": "Douglas Wolk",
      "published_date": "2010-10-22",
      "word_count": 477,
      "fetch_timestamp": "2025-08-20T07:37:45.291741",
      "metadata": {
        "char_count": 2898,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:37:45.291734"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/4733-working-class-hero-the-definitive-lennon/",
      "source": "pitchfork",
      "artist_name": "John Lennon",
      "title": "John Lennon: Working Class Hero: The Definitive Lennon",
      "content": "---\ntitle: John Lennon: Working Class Hero: The Definitive Lennon\nauthor: Dominique Leone\nurl: https://pitchfork.com/reviews/albums/4733-working-class-hero-the-definitive-lennon/\nhostname: pitchfork.com\ndescription: Two-disc, 38-track compilation claims to be the \"definitive Lennon\" collection.\nsitename: Pitchfork\ndate: 2005-10-05\n---\nThe legend of John Lennon, stripped bare of its romantic and willfully misinformed tales of idealism and near-religious fervor for \"changing the world,\" is mostly a lot of short stories about a stubborn, quick-witted domestic hero. Working class? That's debatable, as is much of Lennon's life for everyone save his widow and second son-- but then all good stories have an air of mystery about them. If I were more cynical, I'd point out that one person's mystery is another's propaganda, but ultimately, Lennon is going to be remembered for songs, not his personal life. Of course his personal life was his songs; to a fault, Lennon wrote about what he knew, however skewed by bitterness, confusion, regret, braggadocio, or even peace and love.\nConsequently, it's difficult to hear Lennon's post-Beatles music beyond the frame of whatever commotion was going on in his world at the time. Be it bed-ins for peace, trouble with Immigration, various political rants, relationship highs and woes, or his undying love of old rock and roll, Lennon was as partial as the most insular blogger-- and with no pretense of linking his sources. But then, he was probably smarter than anyone he knew (again, save Yoko Ono), and you can hardly blame a generation of spiritual hangers-on for letting his idiosyncrasies and tantrums run rampant. He wasn't the first punk; he wasn't ever really a hippie; he wasn't a poet, exactly, and he was barely a guitarist. He was a middle-class boomer with a short fuse, overtly provocative social and political ideals, but who was uncut for anything besides making music.\nLennon's music, as a window into his life, is serviceable. As pop, it's immediately distinctive, if frustrating and inconsistent. As something in lieu of new Beatles albums, it's mostly disappointing. But as Working Class Hero: The Definitive Lennon makes abundantly clear over the span of two CDs, it was also a pretty amazing document of a mature artist going through the same shit as everyone else does. No, I don't recall asking for another Lennon comp, but as I get older, and we all get further from the circumstances that made him an icon, I'm reminded that his insight into growing up and getting on with life (and any number of distractions) was as keen as anyone's.\nCollections like this generally serve to rewrite history more often than give representative pictures of reality, but even Lennon's best moments are rife with contradiction and awkward expression. The good news is that Working Class Hero really does include most of his best stuff: \"Imagine\", \"Instant Karma\", \"(Just Like) Starting Over\", and \"Give Peace a Chance\" are obligated to any Lennon best-of, but Ono and Capitol were pretty spot-on by including ace stuff like \"Gimme Some Truth\", \"Jealous Guy\", \"#9 Dream\" and a fantastic \"Real Love\" demo-- not to mention most of Plastic Ono Band. In truth, had this set also included the acerbic, Paul-hating \"How Do You Sleep?\" from Imagine, I could've recommended it over any of his solo records save POB. Yet again, Lennon is inconsistent to the end. As for rarities, beyond \"Real Love\", there is a live version of \"Come Together\" (wherein Lennon warns the crowd they may know more of the words than he does-- and then proves it), but Working Class Hero is supposed to be \"definitive,\" not all-inclusive.",
      "author": "Dominique Leone",
      "published_date": "2005-10-05",
      "word_count": 591,
      "fetch_timestamp": "2025-08-20T07:37:45.325495",
      "metadata": {
        "char_count": 3660,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:37:45.325491"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/4732-acoustic-rock-n-roll/",
      "source": "pitchfork",
      "artist_name": "John Lennon",
      "title": "John Lennon: Acoustic / Rock 'n' Roll",
      "content": "---\ntitle: John Lennon: Acoustic / Rock 'n' Roll\nauthor: Marc Hogan\nurl: https://pitchfork.com/reviews/albums/4732-acoustic-rock-n-roll/\nhostname: pitchfork.com\ndescription: Scraping the bottom of the Beatlemania barrel, Capitol issues two new John Lennon releases: Acoustic features several previously unreleased acoustic demos; Rock 'n' Roll is an expanded reissue of his lawsuit-deflecting 1950s covers album.\nsitename: Pitchfork\ndate: 2004-11-09\n---\nI could see how releasing John Lennon discs called Acoustic and Rock 'n' Roll on the same day might have seemed like an insane stroke of integrated-marketing genius-- \"Why, it would almost be as cool as the Bright Eyes double-weeper!\" some pony-tailed Capitol exec may have exulted-- but these releases seem to have little to do with one another.\nHardly the polished, definitive statement that its title and cover photo imply, Acoustic culls demos and live tracks from 1998's Anthology box, plus seven previously unreleased recordings. Much of the material draws from Lennon's most raw album, John Lennon/Plastic Ono Band, recorded after primal scream therapy with Dr. Walter Janov. The new disc's most visceral moments-- a bitter, desolate blues waltz of \"Working Class Hero\" and a finger-blistering, previously unreleased \"Cold Turkey\", on which Lennon's wavering, sheepish-lion vocal veers closely to Marc Bolan-- predict the spare sneer of punk, even without amplification.\nBy comparison, Rock 'n' Roll sounds like \"Crocodile Rock\". Here, Lennon revisits his roots, complete with the heavy, 50s-style echo he was employing on much of his original work (\"Instant Karma\", for example). The now-familiar backstory to this satisfying (if less-than-brilliant) outing is that an out-of-court settlement with Morris Levy, owner of several Chuck Berry copyrights, required Lennon to record three songs to which Levy owned the rights. (Levy had charged, quite rightly, that Lennon's \"Come Together\" cribbed from Berry's \"You Can't Catch Me\".) Phil Spector produced four of the album's tracks, while Lennon handled the rest. Despite the legal obligation, Lennon's performance never sounds forced; instead, he sounds unfettered, barnstorming through the favorites of his youth with the gleeful abandon he must have felt when, while listening to Radio Luxembourg, he first heard \"Heartbreak Hotel\".\nWhile Rock 'n' Roll is a wistful look at rock's lost innocence, Acoustic hunkers down in the humdrum here-and-now of 1970s existence. \"All right, so flower power didn't work,\" Lennon tells a live audience between the off-kilter protest songs \"The Luck of the Irish\" and \"John Sinclair\", both originally on Anthology. \"So what? We start again.\" The fallout of the failed 60s left Fear and Loathing and Las Vegas's Raoul Duke mired in drugs and depravity; Lennon ultimately turns, creatively enough, to \"reality,\" as described in the oft-quoted \"God\". The version here, previously unreleased, opens with twangy guitar as Lennon goofs an impression of a Southern preacher. The accidental distortion that kicks in on the bass during Lennon's powerful, repetitive \"I don't believe\" sequence vaguely brings to mind Neil Young's haunting Dead Man theme. Interestingly, Lennon replaces \"I don't believe in Zimmerman\" with the less cryptic \"I don't believe in Dylan.\" As always, the song concludes with Lennon's statement of faith in himself. Still, this is a drop in recording quality compared to the Anthology version.",
      "author": "Marc Hogan",
      "published_date": "2004-11-09",
      "word_count": 519,
      "fetch_timestamp": "2025-08-20T07:37:45.360319",
      "metadata": {
        "char_count": 3456,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:37:45.360314"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/",
      "source": "pitchfork",
      "artist_name": "John Lennon",
      "title": "The Pitchfork Review: All of the Latest Episodes",
      "content": "---\ntitle: The Pitchfork Review: All of the Latest Episodes\nauthor: Condé Nast\nurl: https://pitchfork.com/podcast/the-pitchfork-review/\nhostname: pitchfork.com\ndescription: Listen to every episode of Pitchfork’s podcast for music fans and obsessives.\nsitename: Pitchfork\ndate: 2024-01-11\ntags: ['web']\n---\nBrought to you by the music critics at Pitchfork, The Pitchfork Review is a show for music fans and obsessives who can’t wait to talk about the latest releases. Co-hosted by Pitchfork editor-in-chief Puja Patel and Reviews Editor Jeremy D. Larson, this podcast pulls back the curtain on our reviews and scores, dives deep into new music, and gives an expert guide to what’s exciting, what’s great, and what’s just plain terrible.\nListen to every episode of Pitchfork’s podcast for music fans and obsessives.\nRelated Articles\nThe Origins and Influence of Brian Eno’s Pioneering Album Ambient 1: Music for Airports\nIn the latest episode of Pitchfork’s podcast, our critics revisit the legendary producer’s classic 1978 LP, which was recently featured in our Sunday Review series.\nBy Pitchfork\nJeff Tweedy on Rock Criticism, the Pitfalls of Music Snobbery, and His New Book\nThe musician and author discusses World Within a Song, in which he writes about 50 songs that rearranged his brain, Wilco’s new album, and more.\nBy Pitchfork\nThe 2023 Music Grab Bag: Trends, Scandals, and Theories\nIn this episode of the Pitchfork Review podcast, our critics talk about the rise of the musical theater girlie, the fall of the 1975’s Matty Healy, and more. Plus: Alvvays’ Molly Rankin reveals the song she wishes she wrote.\nBy Pitchfork\nThe Best, Worst, and Most Surprising Albums of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about some of their faves from our 50 Best Albums of 2023 list and lament a few of the year’s biggest disappointments.\nBy Pitchfork\nWhy the Replacements’ Tim Is the Best Reissue of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about the revelatory new version of the beloved rock band’s 1985 LP. Plus, Replacements bassist Tommy Stinson reveals his perfect-10 album.\nBy Pitchfork\nBreaking Down Bad Bunny’s New Album and the Future of Puerto Rican Rap and Reggaeton\nIn this episode of The Pitchfork Review podcast, our critics dissect Bad Bunny’s latest and highlight a few new queer artists from Puerto Rico who are taking the island’s music to exciting new places.\nBy Pitchfork\nDebating the Best Songs of 2023, Part Two\nIn this episode of the Pitchfork Review podcast, our critics battle it out over some of their favorite songs of the year, by artists including Troye Sivan, Kendrick Lamar, Big Thief and more. Plus: Devendra Banhart tells us all about his dream collaboration.\nBy Pitchfork\nDebating the Best Songs of 2023, Part One\nIn this episode of the Pitchfork Review podcast, our critics take sides and discuss which tracks by some of 2023’s most exciting artists deserve a spot on our upcoming year-end lists.\nBy Pitchfork\nThe Good, the Bad, and the Swiftie of Taylor’s Eras Tour Concert Film\nIn this episode of The Pitchfork Review podcast, our critics wade through the ups and downs of the pop superstar’s new record-breaking live movie.\nBy Pitchfork\nWhat Drake Is Doing Wrong—and How He Can Fix It\nIn this episode of the Pitchfork Review podcast, our critics talk about what made them care about Drake in the first place, why his new album For All the Dogs is so frustratingly mid, and what he should do next.\nBy Pitchfork",
      "author": "Condé Nast",
      "published_date": "2024-01-11",
      "word_count": 579,
      "fetch_timestamp": "2025-08-20T07:37:45.514629",
      "metadata": {
        "char_count": 3506,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:37:45.514623"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/harry-nilsson-pussy-cats/",
      "source": "pitchfork",
      "artist_name": "John Lennon",
      "title": "Harry Nilsson: Pussy Cats",
      "content": "---\ntitle: Harry Nilsson: Pussy Cats\nauthor: Jayson Greene\nurl: https://pitchfork.com/reviews/albums/harry-nilsson-pussy-cats/\nhostname: pitchfork.com\ndescription: Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we revisit the infamous 1974 album Pussy Cats, produced by John Lennon, the moment a would-be titan consigned himself to a tragic cult figure.\nsitename: Pitchfork\ndate: 2020-08-30\ntags: ['sunday review']\n---\nIf people know of Pussy Cats, they know at least two things: That Harry Nilsson shouted his voice so hoarse that blood hit the microphone, effectively destroying his golden, three-and-a-half octave range forever. And that it was produced by John Lennon during his so-called “Lost Weekend,” the 18-month stretch from 1973 to 1975 in which Lennon and Yoko Ono briefly separated and he disappeared into drugs and drink.\nTo listen to Pussy Cats, it’s long been assumed, is to get a peek into the broader Lost Weekend of the early ’70s—how it felt, how it sounded. This was the blowsy era, immediately post-Beatles, when rock stars could get away with recruiting four or five of the usual suspects (here, it was Keith Moon, Ringo Starr, and session guys like Jim Keltner and Klaus Voormann), bang out a few Bob Dylan covers, and call it an album. It was an era when all the hippie icons were lousing around the Playboy Mansion, when the euphoria of the late ’60s had petered out but all the main players were still onstage. This was the time in which Lennon allegedly punched a waitress while being ejected from a Smothers Brothers gig, his famous spectacles tossed aside in the scuffle.\nReading about this era is funny until it’s depressing. Hearing Lennon talk about the beach house where he, Nilsson, Ringo, and others partied until they were sick every night instead of making Pussy Cats is deflating, as is Lennon’s revelation that “One day I realize, Jesus, I’m the producer, one day they’re going to be asking me where the tapes are.” Stories like these, lapped up by periodicals and repeated in interviews, defined and calcified what “rock star excess” looked like, and Nilsson was there for nearly all of it.\nIf any one person could embody the notion of late-’60s rock stars going to seed, that person would undoubtedly be Harry Nilsson—one of the most talented songwriters of his generation, feted by all four Beatles, bedecked with Grammys, scoring hits while seemingly not even trying, squandering studio budgets and burning bridges while carousing with anyone who would join him. Nilsson was present for the only known post-Beatles reunion of Lennon and Paul McCartney—Stevie Wonder was also there. Mythical, and yet the result was atrocious. The name of the bootleg (“A Toot and a Snore in ’74”) came from cocaine, and it sounds that way. Wherever a famous ’60s icon was debasing themselves, Nilsson was there, supplying the drinks and collecting the stories.",
      "author": "Jayson Greene",
      "published_date": "2020-08-30",
      "word_count": 488,
      "fetch_timestamp": "2025-08-20T07:37:45.553391",
      "metadata": {
        "char_count": 2979,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:37:45.553386"
      }
    },
    {
      "url": "https://pitchfork.com/features/lists-and-guides/",
      "source": "pitchfork",
      "artist_name": "John Lennon",
      "title": "Lists & Guides",
      "content": "---\ntitle: Lists & Guides\nauthor: Condé Nast\nurl: https://pitchfork.com/features/lists-and-guides/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2025-08-06\ntags: ['web']\n---\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nThe 62 Best Albums of 2023 So Far\nBy Dylan Green, Anna Gaca, Jeremy D. Larson, Sam Sodomsky, and Cat Zhang\nThe 48 Most Anticipated Albums of Fall 2023\nBy Madison Bloom, Nina Corcoran, Allison Hussey, Hattie Lindert, Evan Minsker, Jazz Monroe, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres\n17 Artists on Their All-Time Favorite Rap Songs\nBy Andy Cush, Jayson Greene, Clover Hope, and Alphonse Pierre\nThese Queens Can Sing: The 15 Best Songs by Today’s Drag Performers\nBy Julianne Escobedo Shepherd\nThe 30 Best Queer Music Movies\nBy Eric Torres, Nadine Smith, Tatiana Lee Rodriguez, Michelle Hyun Kim, and Emma Madden\nThe 46 Most Anticipated Albums of Summer 2023\nBy Alphonse Pierre, Madison Bloom, Evan Minsker, Eric Torres, Allison Hussey, Nina Corcoran, Jazz Monroe, Marc Hogan, and Matthew Ismael Ruiz\nThe 30 Best Music Festivals of 2023\nBy Evan Minsker, Jazz Monroe, Allison Hussey, Madison Bloom, Nina Corcoran, Eric Torres, and Matthew Strauss\nThe 43 Most Anticipated Albums of Spring 2023\nBy Jazz Monroe, Evan Minsker, Allison Hussey, Eric Torres, Nina Corcoran, Madison Bloom, and Matthew Strauss\nThe 34 Most Anticipated Albums of 2023\nBy Jazz Monroe, Rob Arcand, Marc Hogan, Eric Torres, Allison Hussey, Nina Corcoran, and Matthew Strauss\nThe 34 Most Anticipated Albums of Fall 2022\nBy Rob Arcand, Madison Bloom, Jane Bua, Nina Corcoran, Heven Haile, Allison Hussey, Evan Minsker, Jazz Monroe, Quinn Moreland, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres\nThe 37 Most Anticipated Albums of Summer 2022\nBy Madison Bloom, Nina Corcoran, Allison Hussey, Evan Minsker, Quinn Moreland, Alphonse Pierre, Matthew Ismael Ruiz, and Eric Torres",
      "author": "Condé Nast",
      "published_date": "2025-08-06",
      "word_count": 410,
      "fetch_timestamp": "2025-08-20T07:37:45.843667",
      "metadata": {
        "char_count": 2614,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:37:45.843660"
      }
    },
    {
      "url": "https://pitchfork.com/features/afterword/",
      "source": "pitchfork",
      "artist_name": "John Lennon",
      "title": "Afterword",
      "content": "---\ntitle: Afterword\nauthor: Condé Nast\nurl: https://pitchfork.com/features/afterword/\nhostname: pitchfork.com\ndescription: Paying tribute to important artists upon their passing\nsitename: Pitchfork\ndate: 2025-07-24\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAfterword\nPaying tribute to important artists upon their passing\nAll\nLists & Guides\n5-10-15-20\nInterview\nLongform\nCover Story\nRising\nInteractives\nPodcast\nAfterword\nFor the Back Street Kids\nBy\nJohn Darnielle\nJuly 24, 2025\nAfterword\nBrian Wilson’s Symphony of Life\nBy\nSam Sodomsky\nJune 13, 2025\nAfterword\nSly Stone’s Funky Revolution\nBy\nBen Greenman\nJune 10, 2025\nAfterword\nThe Eternal, Infernal Sound of David Lynch\nBy\nMadison Bloom\nJanuary 17, 2025\nAfterword\nRemembering Ka, the Quiet Sage of Underground Rap\nBy\nPaul A. Thompson\nOctober 15, 2024\nAfterword\nSteve Albini Did the Work\nBy\nGrayson Haver Currin\nMay 9, 2024\nAfterword\nSinéad O’Connor Was a Voice of Strength in the Darkness\nBy\nSam Sodomsky\nJuly 27, 2023\nAfterword\nRyuichi Sakamoto’s Borderless Brilliance\nBy\nSimon Reynolds\nApril 2, 2023\nAfterword\nMimi Parker Was Indie Rock’s Guardian Angel\nBy\nNina Corcoran\nNovember 8, 2022\nAfterword\nRemembering Takeoff, Migos’ Low-Key Linchpin\nBy\nNadine Smith\nNovember 1, 2022\nAfterword\nRemembering Loretta Lynn, Who Helped Make Country a Place Where Women Can Speak Their Minds\nBy\nAllison Hussey\nOctober 4, 2022\nAfterword\nRemembering Ronnie Spector, the Beating Heart of Rock’n’Roll\nBy\nJenn Pelly\nJanuary 14, 2022\nAfterword\nHow Lee “Scratch” Perry Sculpted the Sounds of Reggae\nBy\nJace Clayton\nAugust 30, 2021\nAfterword\nRemembering Biz Markie, the Uninhibited Spirit of Hip-Hop’s Golden Age\nBy\nMatthew Ismael Ruiz\nJuly 16, 2021\nAfterword\nRemembering DMX, Who Changed Rap Forever\nBy\nMatthew Ismael Ruiz\nApril 9, 2021\nAfterword\nRemembering John Prine, the Ultimate Songwriter’s Songwriter\nBy\nJayson Greene\nApril 8, 2020\nAfterword\nThe First Sensitive Punk: Remembering Buzzcocks’ Pete Shelley\nBy\nSimon Reynolds\nDecember 8, 2018\nAfterword\nHow Aretha Franklin Earned Her Crown As the Queen of Soul\nBy\nJason King\nAugust 16, 2018\nAfterword\nThe Glorious Savagery of the Fall’s Mark E. Smith\nBy\nDouglas Wolk\nJanuary 25, 2018\nAfterword\nSoundgarden’s Chris Cornell Was More Than Just a Grunge Frontman\nBy\nMaura Johnston\nMay 19, 2017\nAfterword\nAfterword: George Martin\nBy\nStephen Thomas Erlewine\nMarch 9, 2016\nAfterword\nEarth, Wind & Fire’s Maurice White\nBy\nPitchfork\nFebruary 5, 2016\nAfterword\nDavid Bowie\nBy\nStuart Berman\nJanuary 11, 2016\nAfterword\nScott Weiland\nBy\nRon Hart\nDecember 4, 2015\nAfterword\nAllen Toussaint\nBy\nMike Powell\nNovember 11, 2015\nAfterword\nOrnette Coleman\nBy\nSeth Colter Walls\nJune 12, 2015\nAfterword\nTommy Ramone\nBy\nEvan Minsker\nJuly 14, 2014\nAfterword\nDJ Rashad\nBy\nMiles Raymer\nApril 28, 2014\nAfterword\nRobert Ashley\nBy\nJayson Greene\nMarch 10, 2014\nAfterword\nLou Reed\nBy\nStuart Berman\nOctober 28, 2013\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-07-24",
      "word_count": 469,
      "fetch_timestamp": "2025-08-20T07:37:46.073572",
      "metadata": {
        "char_count": 3035,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:37:46.073565"
      }
    }
  ],
  "total_articles": 8,
  "total_words": 4037,
  "extracted_at": "2025-08-20T07:37:46.199071",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/22393-unfinished-music-no-1-two-virgins-unfinished-music-no-2-life-with-the-lions-yoko-ono-plastic-ono-band/",
    "https://pitchfork.com/reviews/albums/14754-signature-box-power-to-the-people-the-hits/",
    "https://pitchfork.com/reviews/albums/4733-working-class-hero-the-definitive-lennon/",
    "https://pitchfork.com/reviews/albums/4732-acoustic-rock-n-roll/",
    "https://pitchfork.com/features/podcast/",
    "https://pitchfork.com/reviews/albums/harry-nilsson-pussy-cats/",
    "https://pitchfork.com/features/lists-and-guides/",
    "https://pitchfork.com/features/afterword/"
  ]
}