{
  "artist_name": "Johnny Cash",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/johnny-cash-songwriter/",
      "source": "pitchfork",
      "artist_name": "Johnny Cash",
      "title": "Johnny Cash: Songwriter",
      "content": "---\ntitle: Johnny Cash: Songwriter\nauthor: Stephen Thomas Erlewine\nurl: https://pitchfork.com/reviews/albums/johnny-cash-songwriter/\nhostname: pitchfork.com\ndescription: Read Stephen Thomas Erlewine’s review of the album.\nsitename: Pitchfork\ndate: 2024-06-29\n---\nWhen Johnny Cash teamed up with Rick Rubin for 1994’s American Recordings, their partnership launched one of the great final acts in 20th-century American music. Yet such a comeback would have seemed vanishingly unlikely at the dawn of the ’90s. Left without a major label for the first time since 1958, Cash had resigned himself to the ignominious depths of Branson, Missouri, the Ozark town known for tacky theaters housing fading stars from yesteryear. The country icon couldn’t even get that right. His financial backing went belly up prior to the launch of the Johnny Cash Theatre in the summer of 1992. When he did finally play the venue a year later, he was stuck filling in for its new headline attraction: the notorious lounge lizard Wayne Newton.\nThe previously unheard demos on Songwriter, a posthumous new album, shed light on that comeback, a narrative so immutable that it today seems etched in stone. They’re drawn from sessions at Nashville’s LSI Studios, where Cash set up at some point in the early ’90s to record a clutch of newly written songs. John Carter Cash—the only child of Johnny and June Carter Cash—recently discovered the recordings, but the artist’s intentions for them remain unclear. Cash’s decision to record at LSI may have been partially altruistic, as it was the joint property of his stepdaughter Rosie and her then-husband Mike Daniel, and thus an easy way to funnel some funds their way. It’s also possible that the demos were meant to persuade another label to sign the country veteran—a goal that was met by other means once Cash met Rubin in 1993.\nTwo of the tunes on Songwriter, “Drive On” and “Like a Soldier,” also appear on American Recordings, and their simultaneous presence illuminates the distance between the two projects. They’re two of the lighter moments on the spare, stoic American Recordings and two of the weightier songs on Songwriter, a record that finds plenty of room for Cash’s humor and sentimentality, character traits Rubin staunchly avoided. The two qualities combine on “I Love You Tonite,” a love letter to June Carter Cash in which he marvels that they’ve made it through the decades and wonders if they’ll last until the new millennium.\nSome big concerns nag at Cash—he ponders the fate of the planet on “Hello Out There”—yet he generally spends Songwriter operating at a smaller scale, penning character sketches of single mothers sustained by their love of James Taylor, flirting with a woman at the laundromat (“Well Alright”), and writing an ode to all the pretty girls from Little Rock. There’s no sense of foreboding here; it’s as light and rambling as any of the LPs he cut during his waning days at Columbia in the early 1980s or the unjustly maligned Mercury platters from later that decade.",
      "author": "Stephen Thomas Erlewine",
      "published_date": "2024-06-29",
      "word_count": 495,
      "fetch_timestamp": "2025-08-20T07:46:39.036068",
      "metadata": {
        "char_count": 3035,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:46:39.036060"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/bob-dylan-travelin-thru-featuring-johnny-cash-the-bootleg-series-vol-15/",
      "source": "pitchfork",
      "artist_name": "Johnny Cash",
      "title": "Bob Dylan: Travelin’ Thru, Featuring Johnny Cash: The Bootleg Series Vol. 15",
      "content": "---\ntitle: Bob Dylan: Travelin’ Thru, Featuring Johnny Cash: The Bootleg Series Vol. 15\nauthor: Stephen Thomas Erlewine\nurl: https://pitchfork.com/reviews/albums/bob-dylan-travelin-thru-featuring-johnny-cash-the-bootleg-series-vol-15/\nhostname: pitchfork.com\ndescription: Dylan's latest installment in his long-running Bootleg series is one of the shortest, the highlight of which is his collaboration with Johnny Cash.\nsitename: Pitchfork\ndate: 2019-11-08\n---\nWeighing in at a mere three discs—last year’s More Blood, MoreTracks was twice that size—Travelin' Thru is a relatively trim installment in Bob Dylan’s ongoing Bootleg Series. Instead of opening a door onto a secret history, it adds color and texture to an already well-known story: Dylan's late-’60s sojourn in Nashville, the period in which he recorded John Wesley Harding and Nashville Skyline, capped off by his performance on The Johnny Cash Show in 1969—his first television appearance in nearly five years.\nDylan knew precisely what he wanted for the Harding sessions: just his guitar, bass, and drums. Producer Bob Johnston brought bassist Charlie McCoy and drummer Kenneth Buttrey into the studio, persuaded Bob to add steel guitarist Pete Drake to a couple of tracks, and the entire thing was finished within nine hours. The swift session means there were only a handful of outtakes left behind. Just seven alternate takes made the cut for Travelin’ Thru and apart from Dylan fussing with a few words, these aren’t far removed in form or feel from the versions that made the final album. The outtakes from Nashville Skyline—which includes the unheard song “Western Road,” a loose-limbed blues that happily plays with some well-worn tropes—also aren’t markedly different than what made the cut on the finished LP. The differences here are subtle—”Lay, Lady, Lay” seems a bit muted without its busy percussion and sighing steel—but it’s fun to hear Dylan groove along with these Nashville pros, working up a head of country-funk steam on “Country Pie” with the help of guitarist Charlie Daniels. Unfortunately, there aren't many of these Nashville Skyline outtakes. A bunch of masters were lost when CBS Records Nashville neglected to pay the fees for a storage facility, and while Sony recovered some tapes in a 2008 auction, many reels are still missing, which means the eight cuts on Travelin’ Thru are all that could be salvaged for official release.\nAll this means that the heart of Travelin’ Thru lies in the session Dylan held with Johnny Cash on February 18, 1969, just after he finished work on Nashville Skyline. The pair tested the waters the day before, stumbling through a version of Cash’s “I Still Miss Someone” and playing Dylan’s “Don’t Think Twice, It’s Alright” simultaneously with Johnny’s “Understand Your Man,” a song that lifted the melody from “Don’t Think Twice.” It’s a clever idea, albeit slightly confusing in practice—at one point, Dylan messes up his lyrics and slyly suggests he should be singing Cash’s words instead—but the mash-up illustrates how the two icons were operating on a similar wavelength. More than that, they were on equal footing in 1969. Each had spent the past decade changing the sound of American music by deviating from conventions, each building an image that verged on mythic. What's appealing about their duet session is how it deflates those myths: it’s merely two mutual admirers figuring out how to play music together.",
      "author": "Stephen Thomas Erlewine",
      "published_date": "2019-11-08",
      "word_count": 541,
      "fetch_timestamp": "2025-08-20T07:46:39.074975",
      "metadata": {
        "char_count": 3447,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:46:39.074965"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/johnny-cash-american-recordings/",
      "source": "pitchfork",
      "artist_name": "Johnny Cash",
      "title": "Johnny Cash: American Recordings",
      "content": "---\ntitle: Johnny Cash: American Recordings\nauthor: Kaleb Horton\nurl: https://pitchfork.com/reviews/albums/johnny-cash-american-recordings/\nhostname: pitchfork.com\ndescription: Each Sunday, Pitchfork takes an in-depth look at a significant album from the past, and any record not in our archives is eligible. Today, we explore Johnny Cash’s 1994 comeback American Recordings.\nsitename: Pitchfork\ndate: 2018-04-08\ntags: ['sunday review']\n---\nWhen people ask where my grandpa is from, he doesn’t name a town. He says he was born “across the river from Johnny Cash.”\nThere’s only one story my grandpa ever tells about his childhood. It’s 1955, in Arkansas, and he’s standing on his motorcycle, prying a bathroom window off the wall with a pocket knife and a screwdriver. He never got more than a fifth-grade education, but he’s breaking into a high school. He’s doing this because “I ain’t paying no two dollars for a concert.” The concert? Elvis Presley and Johnny Cash. Elvis, he’s pretty good, my grandpa recalls. He’s alright except for the foolish hip movements. But Johnny, he’s got presence.\nHe was there from day one, from the first day “Cry, Cry, Cry” got played on the radio. He bought every record. He knew every producer Johnny ever worked with, every sideman he ever played with, every man down and woman gone. He saw in Johnny not just the Southern man to emulate, but something close to a holy figure. Johnny Cash was the only infallible man on earth. Until 1994.\nThe popular story goes like this: It’s 1994 and Johnny Cash’s career is all but dead. It’s a ghost haunting Billy Graham crusades and the dinner theaters of Branson, Missouri. He spent the 1980s a lost soul, recording bad music (“The Chicken in Black”) and watching the embers of his career fly away into the night. But then Rick Rubin, a bearded and inscrutable mystic, a man known for producing hard rock and hip-hop, brings him back to life in a house overlooking the Sunset Strip in West Hollywood, California with a brilliant idea that no one had ever thought of before—put Johnny Cash in a living room, hand him a guitar, set up a microphone, ask him to play the songs he loves, not for anybody else, just for him.\nCash’s face lights up. He sings gutbucket songs about sin and redemption, and in the blink of an eye, Johnny Cash is himself again. He snaps out of his coma. He makes American Recordings, and all the critics love it. Hell, everybody loves it. He’s playing South by Southwest and Glastonbury and he’s on the road to becoming an eternal symbol of punk rock and anything that’s real, man, you know, authentic. Rubin is a miracle worker and he encourages Johnny Cash to make the best music of his life. This is the door Johnny Cash walks through to dethrone Hank Williams as the king of country music.",
      "author": "Kaleb Horton",
      "published_date": "2018-04-08",
      "word_count": 478,
      "fetch_timestamp": "2025-08-20T07:46:39.123448",
      "metadata": {
        "char_count": 2794,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:46:39.123442"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/15046-bootleg-volume-2-from-memphis-to-hollywood/",
      "source": "pitchfork",
      "artist_name": "Johnny Cash",
      "title": "Johnny Cash: Bootleg Volume 2: From Memphis to Hollywood",
      "content": "---\ntitle: Johnny Cash: Bootleg Volume 2: From Memphis to Hollywood\nauthor: Stephen M Deusner\nurl: https://pitchfork.com/reviews/albums/15046-bootleg-volume-2-from-memphis-to-hollywood/\nhostname: pitchfork.com\ndescription: The second volume in Columbia's bootleg series, which collects demos and rarities, is a reminder of Johnny Cash's humble beginnings and 60s curios.\nsitename: Pitchfork\ndate: 2011-02-23\n---\nAlthough he had already signed with Sun Records, Johnny Cash was still struggling as a musician in 1955, taking gigs around Memphis with the Tennessee Two but not yet landing a strong hit single. To make ends meet, he worked at the Home Equipment Company selling venetian blinds, and it was his employer that sponsored his first radio show on KWEM. In May 1955, he played his first show live in the studio, and those 15 minutes are the centerpiece of the latest Johnny Cash reissue, the second in what will hopefully be a long bootleg series. Besides the fact that he sings only three songs and Luther Perkins plays a short instrumental, what's surprising about this short set is how awkward Cash comes across: As a musician, he's confident and clever with that booming voice and careful phrasing, and the Tennessee Two are just as energetic and tight as ever. Reading the ad copy for the Home Equipment Company's inventory of blinds and fencing, however, Cash speaks haltingly and stumbles a bit over his words, peppering his commendations with odd pauses and rhythms. He comes off as the exact opposite of the cool, smooth-talking peddler, and maybe that made him a much more trustworthy spokesman.\nThat radio program is an intriguing time capsule from an era when radio was much more localized when Cash was young and unschooled, and it's almost a winking punchline that it's followed by an announcement for a concert in which Cash gets seventh billing. It's an intriguing glimpse of the artist at his most human, before he became an industry. As such it's the heart of From Memphis to Hollywood, the second volume in Columbia's bootleg series-- a reminder that Cash started out humbly before he became legendary (the radio show was also included on a bonus disc in The Legend box set in 2005). Nearly eight years after his death, it's difficult to get any critical distance on Cash, as his music is so wrapped up in his larger-than-life persona. So hearing him in this radio setting is a good reminder that there is much about him that remains unexamined and unconsidered.\nHowever, that's really the only revelatory moment on From Memphis to Hollywood, which collects demos and rarities and generally reinforces common perceptions of the Man in Black. There are 11 solo demos that he recorded from 1954 through 1957, but the only surprise is that \"I Walk the Line\" was originally written to be a dour ballad. We get acoustic versions of hits like \"Get Rhythm\" and obscurities like \"My Treasure\", most of which are performed in a necessarily stark way that seems to prefigure his American Recordings albums. Some songs sound good in this setting while others are obvious demos, but the percussive wallop of the Tennessee Two is sorely missed. It's actually refreshing that they figure so prominently in the Sun Records demos produced by Sam Phillips and Cowboy Jack Clement. It's obvious why the label signed the trio: These versions of \"Leave That Junk Alone\" and \"Big River\" percolate with prickly energy, and Cash exhibits fresh interpretive range. He and the Two rumble through an abortive take on Jimmie Rodgers' \"Brakeman's Blues\", which sounds like it's destined to fall apart, and deliver a poignant version of Leadbelly's \"Goodnight Irene\".",
      "author": "Stephen M Deusner",
      "published_date": "2011-02-23",
      "word_count": 599,
      "fetch_timestamp": "2025-08-20T07:46:39.160675",
      "metadata": {
        "char_count": 3664,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:46:39.160670"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/12331-johnny-cash-at-folsom-prison-legacy-edition/",
      "source": "pitchfork",
      "artist_name": "Johnny Cash",
      "title": "Johnny Cash: Johnny Cash at Folsom Prison: Legacy Edition",
      "content": "---\ntitle: Johnny Cash: Johnny Cash at Folsom Prison: Legacy Edition\nauthor: Stephen M Deusner\nurl: https://pitchfork.com/reviews/albums/12331-johnny-cash-at-folsom-prison-legacy-edition/\nhostname: pitchfork.com\ndescription: A companion piece of sorts to Columbia/Legacy's 2006 reissue of At San Quentin, At Folsom Prison is the greater of the two, if only because it was both such a risky endeavor and such a rewarding payoff. This 2xCD/DVD set of the Man in Black's infamous show captures a superlative performance, feisty and playful and a bit maudlin.\nsitename: Pitchfork\ndate: 2008-10-23\n---\nIt's odd not hearing \"Hello, I'm Johnny Cash\" at the very beginning of this 2xCD/1xDVD set of the Man in Black's infamous show at Folsom Prison. His signature introduction-- as if he actually needed to tell an audience who he was-- is one of the best moments in recorded rock history, rendered in his immediately recognizable robust baritone and prompting unabashed applause. On all previous editions of this concert, whether vinyl, cassette, eight-track, or CD, have begun with that four-word intro, but Columbia/Legacy's new set relegates it to the actual moment in the show, well after Carl Perkins and the Statler Brothers have warmed up the crowd. Here it's revealed to be a rehearsed moment:\nHugh Cherry: I need your help. When John comes out here, he will say-- and which will be recorded-- \"Hi there. I'm Johnny Cash.\" When he says that, then you respond. Don't respond to him walking out. Welcome him after he says, \"Johnny Cash.\" I'll have my hands up, and you just follow me.\nJohnny Cash: Hello, I'm Johnny Cash.\nCrowd: Goes nuts.\nCall it staged if you want, but the moment comes across as genuine, as if the emcee had told the prisoners what they had planned to do anyway. And it's justified by Cash's notoriously volatile performance, which made this concert the foundation of his mid-career resurgence and the framing device for the 2005 biopic Walk the Line. His countercultural appeal during the late 1960s and his abiding popularity throughout the 1970s are grounded in the rough-and-tumble energy he exudes on stage. This edition of At Folsom Prison is a companion piece of sorts to Columbia/Legacy's 2006 reissue of At San Quentin, but it's easily the greater of the two, if only because it was both such a risky endeavor and such a rewarding payoff. When Cash and his crew arrived to play this show, he had been playing prisons routinely and had even serenaded the rowdy crowds at Folsom before, but this was the first time anyone had seen any commercial benefit in recording a show.\nDescribed as worried but determined before the show, Cash gives a superlative performance, feisty and playful and a bit maudlin. It's an ideal setlist, with every song playing to the prisoners: \"25 Minutes to Go\" and \"Dark As a Dungeon\" of course, but also \"Green, Green Grass of Home\" and \"I Still Miss Someone\", which evoke a more general sense of yearning. Furthermore, the definitive versions of several of his hits are here, including the raucous \"Cocaine Blues\" and \"Folsom Prison Blues\", but the show is equally remarkable for the banter he maintains with the prisoners. Playing off their excitement, he slyly portrays himself as a rebel: Before \"I Still Miss Someone\", Cash explains, \"This show is being recorded for an album release on Columbia Records, and you can't say 'hell' or 'shit' or anything like that.\" Previously the latter has been bleeped out, but this reissue reinstates the expletive. \"How does that grab you, Bob?\" he asks, referring to producer Bob Johnston.",
      "author": "Stephen M Deusner",
      "published_date": "2008-10-23",
      "word_count": 590,
      "fetch_timestamp": "2025-08-20T07:46:39.198033",
      "metadata": {
        "char_count": 3585,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:46:39.198027"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/11191-the-best-of-the-johnny-cash-tv-show-1969-1971/",
      "source": "pitchfork",
      "artist_name": "Johnny Cash",
      "title": "Johnny Cash: The Best of the Johnny Cash TV Show, 1969-1971",
      "content": "---\ntitle: Johnny Cash: The Best of the Johnny Cash TV Show, 1969-1971\nauthor: Amanda Petrusich\nurl: https://pitchfork.com/reviews/albums/11191-the-best-of-the-johnny-cash-tv-show-1969-1971/\nhostname: pitchfork.com\ndescription: Columbia/Legacy continues to mine the vaults of the short-lived variety program \"The Johnny Cash Show\" by following a 2xDVD best-of featuring 66 of the show's musical performances with this 16-song punctuated CD version. Among those featured are Cash, his wife June Carter, Ray Charles, George Jones, and Joni Mitchell.\nsitename: Pitchfork\ndate: 2008-02-19\n---\nBetween 1969 and 1971, Johnny Cash spent his Saturday nights hosting a variety show for ABC. \"The Johnny Cash Show\" was shuffled in as a summer replacement for another song-and-skit show, \"The Hollywood Palace\", and featured Cash and his touring company: His wife June Carter, various members of the Carter Family, Carl Perkins, the Tennessee Three, the Statler Brothers, and a series of rotating guest stars (beginning, rather auspiciously, with the camera-loving Bob Dylan). Each of its 58 episodes were shot before a live audience in Nashville's legendary Ryman Auditorium, the former home of the Grand Ole Opry. It was the first network television show ever produced out of Nashville.\nAt the time, Cash was hitting his popular and personal apex: At Folsom Prison had enjoyed a remarkable 92-week run on the pop charts, a Grammy (Best Male Country Vocal) gleamed on his mantle, he was newly married, he was sober and devout. Johnny Cash was a rehabilitated outlaw, a Christian, a husband, a real, earnest American. And for home viewers in 1969, Cash was a welcome antidote to flag-draped coffins.\nA 2xDVD best-of featuring 66 of the show's musical performances was released in September; the punctuated CD version features 16 songs, including nine that didn't make the cut for the DVDs. The Best of the Johnny Cash TV Show is a remarkable collection, featuring live performances by Cash's country peers (Waylon Jennings, Bobby Bare, George Jones, Tammy Wynette, Kris Kristofferson) and, perhaps more compellingly, tracks from folk, pop, and rock superstars (Ray Charles, Joni Mitchell, Roy Orbison, Derek and the Dominoes). The CD's production is impressively fluid, given the source material (8-track reels operating at half-capacity, recorded from scattershot stage mics), and was lovingly remixed and remastered after the tapes were pulled from Cash's personal vault.\nSome of the best bits include the pre-song banter-- before Waylon Jennings performs \"Brown-Eyed Handsome Man\", the former roommates rib each other gently: \"He was my cook,\" Jennings explains. \"Can you imagine Johnny Cash in a black suit with baking powder all the way down and gravy in the hair?\" \"I was a good cook,\" Cash retorts. \"You couldn't do nothing.\" Ray Charles' rich, sultry rendition of \"Ring of Fire\" is stunning, riddled with organ, piano, and brash horns; Charles' transforms the song from an obtuse acoustic tale into high drama. Joni Mitchell duets with Cash on \"Girl From the North Country\" (ironically, the same song Dylan performed for the show's opening night), while Cash and Lynn Anderson kick out a sprightly version of Geoff Mack's \"I've Been Everywhere\". Still, Cash's rendition of Carl Perkins' \"Daddy Sang Bass\" is the record's highlight. The track, which, occasionally dips into the Carter Family's legendary \"Will the Circle Be Unbroken?\", works as a parable for the entire two-season run of \"The Johnny Cash Show\", with Cash intoning: \"We'd get together in a family circle, singing loud/ Daddy sang bass, Momma sang tenor/ And me and little brother would join right in there/ Cause singing seems to help a troubled soul.\"\nAlthough anyone who's checked out the DVDs will find themselves maniacally restructuring the track list (it's not hard to assume that the label wanted a hook to get fans to buy both documents, padding the CD with a handful of second-tier, if still outstanding, cuts), The Best of the Johnny Cash Show is still a tough testament to the grand fluidity of American music. Cash acted as a perfect conduit for cross-genre pollination, and the class, race, gender, and regional divisions that plagued America in the late 1960s are rendered perfectly irrelevant here.",
      "author": "Amanda Petrusich",
      "published_date": "2008-02-19",
      "word_count": 672,
      "fetch_timestamp": "2025-08-20T07:46:39.232100",
      "metadata": {
        "char_count": 4275,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:46:39.232095"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/9934-ultimate-gospel/",
      "source": "pitchfork",
      "artist_name": "Johnny Cash",
      "title": "Johnny Cash: Ultimate Gospel",
      "content": "---\ntitle: Johnny Cash: Ultimate Gospel\nauthor: Joshua Klein\nurl: https://pitchfork.com/reviews/albums/9934-ultimate-gospel/\nhostname: pitchfork.com\ndescription: This career-spanning collection of the Man in Black's spiritual music mixes traditional works with the singer's own compositions and traces a complicated, decades-long struggle with temptation, damnation and salvation.\nsitename: Pitchfork\ndate: 2007-02-28\n---\nJohnny Cash's late-career rebirth has few parallels in modern pop history. But it's remarkable nonetheless that in 2006, three years after his death, Cash's five million records sold in the U.S. made him the year's second-most successful artist, right behind Rascal Flatts (but, satisfyingly, well ahead of Nickelback).\nThat's a pretty big number-- twice Justin Timberlake's tally-- but somewhat explainable. 2005's Walk the Line helped solidify Cash's status as a great American icon, just as a steady stream of Rick Rubin-helmed comeback discs demonstrated his powers had barely been diminished by age and illness. Cash was one of the few acts that everybody-- young and old, cool and conservative, country or pop-- could embrace.\nThose numbers being what they are, though, don't expect the Cash releases to slow down anytime soon. In the past few years alone, Cash has inspired new career-spanning boxed sets, best-ofs, expanded live albums, June Carter Cash duets, and Personal File, a collection of unreleased demos. Following 2006's at the time allegedly \"final\" American V: A Hundred Highways, Rubin has even announced a sixth volume of the series.\nNow comes Ultimate Gospel, a collection of Cash's spiritual work. Cash had been recording gospel material from the start but particularly throughout his later years. Most recently he completed the moving My Mother's Hymn Book as part of the Unearthed boxed set (it was subsequently re-released as a stand-alone set), songs his mother once sang that Cash took with him (both literally and figuratively) everywhere he went. Even when his longtime label Columbia occasionally lost faith in the marketability of gospel, Cash kept cranking out the discs at semi-regular intervals, jumping ship to smaller labels when need be to get the music out.\nLately, gospel-- not to mention fundamentalist Christianity-- has been experiencing something of a renaissance, so it's no shock that the same label that sometimes frowned upon Cash's religious recordings is eager to revisit them today. But times are different. Big music names from Bono to Mary J. Blige to Arcade Fire are believers of the highest order, but they generally get a free pass from all but the most staunchly secularist followers of Richard Dawkins. Besides, Cash's own born-again story is perfectly in line with the singer's other mythic American, larger than life tales: In 1967, hopped up on speed, Cash crawled into Nickajack Cave and prepared to die, until he felt the hand of God point him to salvation. He married June Carter the following year and lead a life of devout Christianity until his demise.",
      "author": "Joshua Klein",
      "published_date": "2007-02-28",
      "word_count": 470,
      "fetch_timestamp": "2025-08-20T07:46:39.269091",
      "metadata": {
        "char_count": 3042,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T07:46:39.269086"
      }
    },
    {
      "url": "https://pitchfork.com/features/interview/6868-emmylou-harris/",
      "source": "pitchfork",
      "artist_name": "Johnny Cash",
      "title": "Emmylou Harris",
      "content": "---\ntitle: Emmylou Harris\nauthor: Pitchfork\nurl: https://pitchfork.com/features/interview/6868-emmylou-harris/\nhostname: pitchfork.com\ndescription: Emmylou Harris has kept up an incredible track record for more than 30 years, since the death of Gram Parsons dissolved their historic partnership and Harris set out on a solo career, stretching all the way up to her latest, All I Intended to Be. Of course, with that voice it's hard to imagine Harris ever going wrong.\nsitename: Pitchfork\ndate: 2008-06-09\ncategories: ['features']\n---\nEmmylou Harris doesn't really make bad albums, just degrees of good. It's an incredible track record she's kept up for over 30 years, since the death of Gram Parsons dissolved their historic partnership and Harris set out on a solo career, stretching all the way up to her latest, All I Intended to Be.\nOf course, with that voice it's hard to imagine Harris ever going wrong, and indeed she also remains a go-to singer for harmonies, duets, guest appearances, and other collaborations, which has recently lead her to cross creative paths with artists as varied as Elvis Costello, Mark Knopfler, Conor Oberst, and seemingly countless other friends and peers, discovering or giving a boost to many others in the process. The new disc features not just Harris originals but songs by such diverse but somehow equally well-suited songwriters as Billy Joe Shaver, Patty Griffin, Merle Haggard, and Kate and Anna McGarrigle (among others).\nWe spoke with Harris about her many collaborations, interpreting other people's songs, Johnny Cash, and the downside of staying so busy.\nPitchfork: Your last two solo records, Red Dirt Girl and Stumble Into Grace, were composed largely of original songs. All I Intended to Be returns to interpretations, songs from other writers.\nEmmylou Harris: A lot of it has to do with whether you have any songs that you've written [laughs]. I'm fresh out now. I'm going to have to start doing some work. But you know, it gave me an opportunity to go back to covering some songs that I've wanted to do for a long time, like for 20 or 25 years. It gave me an opportunity to go back and dig into my pile of little treasures, songs that made me think \"one day I'm going to do this song.\" These were sort of favorite songs that I just took out to see what happens. A song like \"Broken Man's Lament\", I first heard it in 1983 and always wanted to record it. Or in the case of \"Old Five and Dimers Like Me\", I waited until I was finally old enough to have some cred singing it!\nPitchfork: You're not someone who is always writing?\nEH: No, I'm not. I'm not always writing. I have to have a lot of time to put aside. I'm a pretty busy girl. It's been five years since my last record, but between the Mark Knopfler record [All the Roadrunning] and the Songbird project [a 4xCD boxed set of \"rare tracks and forgotten gems\"], I was fortunate enough to also work with Neil Young, and I did a great tour with Elvis [Costello]...I'm more of a one-trick pony. If I'm doing one thing, I can't do something else at the same time. I'm looking forward to getting back into writing, I think once this tour is over. I find myself coming up with ideas when I'm out on the road or whatever. Then I just gather the bits and pieces, and when I have the opportunity I'll try to shuffle them out and see what happens.\nPitchfork: How is recording or performing a song someone else has written different from recording or performing a song you've written yourself?\nEH: Obviously, if you write a song, it's come from you, and if you hear a song, it's already there. It's like you can just pick it off the tree. However, you have to make it your own, so there's an added kind of responsibility to make it your own. You have to come up with something beyond. You have to go deeper down in yourself with a song that someone else has written, because it has to resonate for you.\nPitchfork: There are some songs written by others you've been performing for several decades now. Do they resonate any differently for you now then they might have 30 years ago?\nEH: No, it's pretty much the same. What changes and what helps keep them fresh is working with different musicians. When I went from the Hot Band to the Nash Ramblers, this whole group of songs became totally new, musically. And therefore poetically they kind of resonated a different way, too. The two are so intertwined, the performance and the song. You just find new ways to sing them differently, or phrase them differently. The emotional meaning is probably still the same, but it's all part of that same physical experience, and also kind of an emotional experience. I was touring with a couple of gals and a bass player, and I was focusing on a lot of the songs that required three part female harmony, so I was digging up songs that I hadn't done in a long time.\nThen I went out with the guys from the Seldom Scene, John Starling's band, and it was a totally different vocal sound and a totally different approach to the material. But still, a good song will last you forever. There are certain songs that I grow tired of. Like [Chuck Berry's] \"C'est La Vie\", I doubt I'll ever do that again. Great song, but I just don't care about singing about a teenage wedding [laughs]. You know what I mean? It was a fun song to do for a long time, and now it's not fun anymore [laughs]. But a song like [Townes Van Zandt's] \"Pancho and Lefty\", that might be one of the last songs I ever sing before I kick the bucket. It will never grow old for me.\nPitchfork: I've heard you say on several occasions that as many times as you've sung that song, you're still not sure what it's even about.\nEH: Well, it doesn't really matter. It's like one of those books that you want to read over and over again. The story is riveting, you feel you know the characters. It's about the human condition, it's about betrayal, it's about growing old. It's about things that we can all relate to. But it's just couched in a way that has so much beautiful imagery. It's a song that, when you sing it, your chakras are vibrating. It's just a brilliant song.\nPitchfork: It's also one of those songs that changes a little bit depending on who's singing it.\nEH: For me, it's become a part of me. Audiences love that song. It was never a hit for me. People want to hear me sing it, but it's not because Willie [Nelson] and Merle [Haggard] had a hit with it.\nPitchfork: Recently you've collaborated with a couple of people that may have been outside your comfort zone, not just someone like Elvis Costello, but someone like Conor Oberst. Not a lot of people saw that coming.\nEH: I didn't see that coming. I was vaguely familiar with him, because [producer] Malcolm Burn, with whom I was working at the time, he's a big fan, so I heard the records. But I was surprised when I got the call from Nonesuch that he would like for me to come and sing on the record. It's a great window on what a lot of these young artists are doing that in some ways is totally foreign to me. But ultimately, I approach it like trying to be in harmony with that person's stories or words. That way you get an appreciation for what they're doing\nPitchfork: Sometimes you get introduced to new artists. But you've been pretty good at discovering or introducing new artists yourself. Gillian Welch, Patty Griffin...\nEH: I got to them first!\nPitchfork: Someone like Griffin is maybe better known as a songwriter than a performer.\nEH: People should get over that. Anybody who has ever seen her perform-- she's a soul singer. This girl is extraordinary. I was lucky that she happened to be working with Malcolm while I was working with Dan [Lanois] and Malcolm. When I heard that record [Living With Ghosts]-- which actually never came out-- of just her and her guitar...there are times when you think, oh, I've heard it all. Nothing's ever going to affect me again, I'm just going to go listen to all these old people that I love, whose music has inspired me. And then along comes Patty Griffin, somebody that you've never heard before, who moves you in a way that you didn't know you could be moved. That's just a great gift. To stumble on somebody of her artistry.\nPitchfork: You seem like a very generous collaborator, which may explain why so many people gravitate toward you.\nEH: I think most musicians tend to be generous. It just starts with that jam, people sitting around trading songs, playing on each other's stuff, singing harmony. I found that out the first time I ever met a group of musicians and sat around playing music all night. It's like, yeah, this is what I want to do. I like this! I don't think that I'm unusual in that sense. And of course, I've benefited from all the different people that I've met and worked with. I really believe that music is all about collaboration. Only so many people can make a record of just them and their guitar, and do that for the rest of their lives. I don't think I could do that, anyway, but I wouldn't choose to. For me, a lot of the inspiration comes from what songs a musician will play, or what a group of people getting together can come up with, all around a song. That's the way it's always happened for me.\nPitchfork: You've been associated with a lot of very inspired but also very hard living guys. How have you managed to move in the same circles as people like Gram Parsons and Steve Earle and survive?\nEH: Well, Steve Earle wasn't hard living by the time we started working together! [laughs] I was only around Gram for a very, very brief period of time. I was pretty much the country mouse. When I was around Gram, he really trying to straighten up. We spent most of our time singing, and you can't get all screwed up and sing. So the time we spent together was a pretty healthy time. I wish I could have spent more time around him. Maybe I could have helped him a little bit. But there's no point in looking back.\nPitchfork: It's amazing that after 30 years of making music yourself, someone who just recorded a couple of albums is still so often talked about in the same breath as your own name.\nEH: Well, Gram was a visionary. There are not that many people who come along and come up with something totally different. Of course, being totally honest, people probably spend a little too much time focusing on the dramatic story of his life, including, unfortunately, an early death. A rock and roll casualty. Perhaps people don't give as much credit to his music and his vision. A lot of times that stuff will supersede someone's work, and I think that happened a lot with Gram. I think musicians-- I'm the poster child for how one person can affect another. With Gram, I don't think anybody would be interested in talking to me if I hadn't met Gram and been inspired by him, and continued down the road he set out for me. I don't think I would have come up with this stuff on my own.\nPitchfork: That's a very modest way to look at it...\nEG: But I think it's true. I have a pretty good sense of my life, who I was and what I knew, and how different things were after he came into my life. I think there are people that you have those kind of big bang moments with in your life story, and that certainly was for me. It's almost like B.C. and A.D. [laughs]\nPitchfork: Of course, continuing that big bang metaphor, just as the universe keeps expanding, you've kept expanding your corner of it.\nEH: Well, I've been lucky enough to work with great people, and have had the opportunity to do what I want, experiment and get away with it. I have an audience that has stuck with me. I haven't been trapped by so much success that I have to keep repeating myself. Granted, I landed in a place that enabled me to have this opportunity to follow through, because of that fortuitous meeting with Gram.\nPitchfork: Just as Gram's story sometimes overshadows the music, I think sometimes your associations might overshadow your own accomplishments. You've become almost a genre unto yourself. People might call you country, but maybe only by default.\nEH: I got past that. I think when Wrecking Ball came out, there was a bit of confusion. I started my career saying that I wanted to be considered a country artist. I felt that intense connection with Gram, and all the music he turned me on to-- George Jones and all that great body of country music that I dismissed early on when I first got into music. I wanted to make up for it by embracing it and coming up with my own brand. But embracing it in a way that showed my respect. I was like a convert, only instead of converting to a religion I was converted to country music.\nBut then, as it became sort of infected with a kind of virus of mediocrity, I didn't really have anything to do with it anymore. I wasn't being played on the radio. It was the kind of thing where-- do you try and distance yourself, or do you say \"if you want to call me a country artist then Wrecking Ball is a country record?\" Just damn the torpedoes [laughs].\nIn the long run, when people look at my career, I hope they see that this can be country, because that is where she came from, that is where the beginning was. It's like trying to change the place you were born. It's always going to be a part of you. But there is some confusion now. I think genres are actually disappearing, more and more. Is there really rhythm & blues, is there really country music? More and more young artists are dipping into the pool of all these various forms of music and coming up with something that's totally new themselves. Fortunately, we'll always have the genre in their pure form, to go back to and to learn from and to steal from. To add to our stew.\nPitchfork: It can't be a coincidence that Wrecking Ball came out right around when Johnny Cash started releasing his American records. Those records really pulled the curtain away. They showed how conservative the country music mainstream had become, but also how easy it was to rock the boat.\nEH: Johnny Cash...it's hard to judge Johnny Cash, to put him besides anybody else. He's such a giant, his music and the whole charisma of the man. I was so glad that he got the chance to make those great records at the end of his life. Sony, Columbia or whoever it was who decided to drop Johnny Cash, that's really bad karma [laughs]. And I guess he showed them. One of the greatest artists of any kind of music, anywhere in the history of the world. Certainly that video he did, for \"Hurt\"...it puts music videos to shame, doesn't it? It shows what the medium can be, and nobody can even come close. Johnny Cash is going to stand for eternity as the master artist for me. And the man, too.\nPitchfork: Do you feel at this point that you've broadened your horizons and opened doors wide enough that you can operate totally independent of the country music establishment?\nEH: I don't even think about the establishment. In a sense, I enjoy the establishment, but I also enjoy just doing exactly what I want. That's kind of become my establishment! [laughs] As long as you're free to do whatever you want, I think the only problem is to make sure you come up with an idea that feels fresh and inspiring to you. You can't possibly inspire anybody else if you're not inspired yourself, so hopefully I'll keep all avenues open and see what comes next. You have to hope that something is around the next bend, and if it's not, then I'll just stick with dog rescue [Bonaparte's Retreat]. One of the best things that I've ever done in my life, but that's another discussion.",
      "author": "Pitchfork",
      "published_date": "2008-06-09",
      "word_count": 2833,
      "fetch_timestamp": "2025-08-20T07:46:39.398344",
      "metadata": {
        "char_count": 15520,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:46:39.398338"
      }
    },
    {
      "url": "https://pitchfork.com/features/interview/6718-robert-wyatt/",
      "source": "pitchfork",
      "artist_name": "Johnny Cash",
      "title": "Robert Wyatt",
      "content": "---\ntitle: Robert Wyatt\nauthor: Stephen Troussé\nurl: https://pitchfork.com/features/interview/6718-robert-wyatt/\nhostname: pitchfork.com\ndescription: British psych-jazz legend on working with Brian Eno and Paul Weller, the long journey from Dionne Warwick to Johnny Cash, and how he considers himself a \"sit-down comedian.\"\nsitename: Pitchfork\ndate: 2007-10-28\ncategories: ['features']\n---\nWe met Robert Wyatt on a lovely late summer day, on the top floor of the recently refurbished Royal Festival Hall. The new well appointed member's bar overlooking the Thames is empty but for the two of us. \"So, is this your London office now, Robert?\" I kid. \"Well, I did curate a Meltdown festival here a few years ago…and once you've done something here, you're supposed to have access to the building whenever you like. But the new lot don't seem to realize that. They've been a bit sniffy about doing interviews here. I would say something, but I don't want to be one of those awful people saying 'Don't you know who I am?' I really don't want to be that person!\"\nIt's difficult to imagine anyone getting sniffy with Robert Wyatt. Maybe it's just the beard, but since the deaths of Ivor Cutler and John Peel, Wyatt has become something like the Santa Claus of the British counterculture. Since debuting in the Daevid Allen Trio in 1963, he's been a continuing, restlessly inventive presence, surviving successive fashions, revolutions, and even a fall from a third-story window. A list of his band-mates and collaborators reads like a secret history of all that has been most vital in four decades of British music: Kevin Ayers, Soft Machine, Jimi Hendrix, Pink Floyd and Syd Barrett, Fred Frith, Brian Eno, Scritti Politti, Elvis Costello, Ultramarine. His new record comes out on Domino, and quite naturally comes with a press release written by his latest fan, Alex from Hot Chip.\nComicopera sees Wyatt reunited with what now seems to be his very own big band (featuring Eno, trombonist Annie Whitehead, saxophonist Gilad Atzmon, his wife Alfie, and Paul Weller, among others) and feels like the third installment in a series that began with 1997's Shleep: Bittersweet, furious and funny protest songs against what Thomas Pynchon once called Empire's \"dreamless version of the real.\"\nPitchfork: So, Robert: Comicopera. I think it's fair to say, you haven't gone Gilbert and Sullivan on us?\nRobert Wyatt: No, not really. But it's more Gilbert and Sullivan than, say, Tristan and Isolde…\nPitchfork: You sometimes give the impression you'd like nothing better than to spend the rest of your days sitting around at home, listening to John Coltrane and gazing out the window. What motivates you to make a new record? A combination of your wife and record company?\nRW: Well, we've all got to earn a living. And writing songs is what I do. But when I've done a record, it's not that I think it's better or worse than anyone else's, but if I think that nobody else would have done it if I hadn't, well then that's ok.\nPitchfork: Did Domino get in touch with you?\nRW: No, on the contrary, we went to them. We just got on with it and finished the record. It's just much more comfortable to have the final record when you're happy with it and then look for a label. And a guy I used to work with at Ryko was now at Domino, and they're just are perfect really. They're real enthusiasts for music. But they have also had a couple of massive hits, so they've got resources. So we're very happy.\nPitchfork: You were on Virgin in the 1970s, Rough Trade in the 80s-- do you think Domino have the same spirit as those other labels did then?\nRW: Well you know Virgin was never really about music. They did figure out how to sell records without having hit singles. But it was always an incipient business for [Virgin owner/founder Richard] Branson. Rough Trade was really the big breakthrough.\nPitchfork: Some people might look at Comicopera and say it's a concept album.\nRW: I always thought that a concept album was one where you start off with a plan. But this was the opposite, really. I had a batch of songs, Alfie had some ideas. There were some Brian Eno tunes. But then I looked at what I'd got when I'd recorded a few things. I thought that I had three twenty minute sections which seemed to fit together…\nPitchfork: In a funny way, it's like a three-sided lp?\nRW: Well it is going to be a three-sided lp! One of the great things about Domino is that they still do vinyl. So it will be three sides, with a short story I wrote on the back of the fourth side, just scratched into the vinyl. But, yes, a sequence appeared-- a first section is at home, the second is out and about in the world, and then third is all over the place. It's not an opera in the classic sense. There's no real plan to it. But you've got to call a record something-- and so that's what it's called.\nPitchfork: You've assembled a terrific band. I can't think of many other records that feature both Brian Eno and Paul Weller.\nRW: I really like bands. Not particularly rock bands, but big jazz bands. As a jazz fan I want it to have real people there. There's still a consistency to it all, because it's my voice. And there is some improvisation. I never do anything the same way twice in the studio, and nor does anyone else, and it's not til the end that work out the best takes.\nPitchfork: You worked with Eno last year on a very strange song for the Plaguesongs project.\nRW: Oh yes, that was really good. He said to me \"Robert, can you do me some flies?\". So I said, right great! So I imagined I was a fly-- I method-acted my way into being a swarm of flies. And then we found out the tempo of \"Superfly\" by Curtis Mayfield, so that was obviously going to be the bpm. And I thought I'd do it in the key of F for Fly. And it's basically atonal. And then Brian put a song around it. It was a very specific request!\nPitchfork: How did you come to work with Paul Weller?\nRW: What I've got in common with Paul are two things. Firstly, our main inspirations and points of reference are really Black American music. Except I go back about 10 years earlier than him. But all the London mod clubs that Alfie used to go to, he loves to hear all about that. And the other thing is we have this basic sense of justice, of right and wrong and respect. We just have different ways of expressing it. One thing we don't have in common is he's a very sharp dresser! Him and Jerry Dammers were the last generation of pop or rock musicians I could get along with. I thought they were better, more astute, politically, than my lot were in the 60s.\nPitchfork: Did you once say that without jazz America would have been a mistake?\nRW: It wouldn't have been a mistake. But if it hadn't been for the black cultural experience, from the gospel and blues and jazz, American would be no more famous than, say, New Zealand. Americans do make great films. But who doesn't make films? The Japanese do, the French do, the Iranians do! The Americans have a huge commercial advantage. So I wouldn't say cinema. Actually it was Clint Eastwood who said, the only things America has contributed to civilization are the western and jazz. And I don't think westerns are bad, but lots of people make great cinema. But jazz is right there.\nPitchfork: What do you make of hip-hop?\nRW: It's none of my business really. It's a modern folk form and a very fertile one. The wonderful thing about the language-- up til that time, black Americans had sung in a slightly secularized church tradition or soap operatics really. And when I heard hip-hop, I thought this is great, really. Because everyone knows in America that working class black American speech is incredibly fertile. Even in jazz, a lot of the language was coming into the music then. Louis Armstrong and Fats Waller. Lots of Black, Jewish and Gypsy things-- the language is full of disguises, to throw the enemy off the scent. And words which mean the opposite of what they say-- bad meaning good and so on.\nBut the language never came out in the songs at all-- the songs were still \"I love you\". It wasn't really as good as Irving Berlin or Cole Porter. It was just kind of adequate. Until hip-hop, and then ordinary speech started coming-- the incredible phraseology, how black Americans talk came to the foreground, which was wonderful.\nPitchfork: Were you a kind of teenage Beat jazz fan back in the 50s?\nRW: Well…I went to a provincial school where I was caned a lot. There were a few reproductions of Paul Klee around the house. I was just wishing I was someone else, somewhere else. I wasn't living an alternative lifestyle.\nPitchfork: I read somewhere that your mum was a friend of poet Robert Graves?\nRW: My mum was a journalist. In the 1930s she went out to Majorca and there weren't very many English people there, so she got to know Robert Graves, it's true. I didn't meet my dad until I was six, because he was fighting in the war. And he then contracted multiple sclerosis, and he was dead 10 years later. But when I knew him, he was an industrial psychologist-- he worked up the road, advising people who'd fallen off ladders what job they could do next. My mum wrote articles. We were fairly normal, to me. Well, it was the only family I had! I had a one hour bus ride to school, through acres of countryside. And when you're a young man you're not looking for acres of countryside. You're looking for girls. So I felt, to be dragged away from London and stuck out there on the brink...That was a cruel blow, I felt!\nPitchfork: Was there much music round the house?\nRW: My dad had some jazz records. Most of his generation had started to listen to some jazz, but they played everyone from Debussy to Bartok. But one day my older brother came to visit us and he had loads of jazz records with him, real stuff like Stan Kenton. My dad was a bit shocked that that became my favourite, and I started to listen to less Bartok and more bebop. I think he was puzzled, by that…\nPitchfork: There's some beautiful singing on Comicopera, especially \"Just As You Are\". How do you feel about your voice these days?\nRW: Oh, cheers! I know more about my voice now. I've lost half my top notes, but it seems like I've gained just as many lower ones. In the old days I used to learn by copying women, like Dionne Warwick and Billie Holiday. But more recently my role models have been people like Johnny Cash…Because I'm now down in that area. I don't know if it's quite possible to imagine a journey from Dionne Warwick to Johnny Cash, but that's the one I have been working at!\nPitchfork: You once said that you were like a darts player, throwing some pretty haphazard arrows at the board, and that's what gave the impression of having lots of different musical directions. Do you think you're getting closer to the bulls-eye these days?\nRW: Well, at the moment I feel a great sense of relief with this record. In fact, with the last two or three really. I'm getting in focus what I can do in combination with other people, that makes sense, that makes it a listenable record. I can't say I haven't done it before, I have. But now apparently I have this other thing, this alter ego as it were, which is the trumpet. I'm not a very original trumpet player. In fact I'm not a proper trumpet player at all. But it just enables me to get those notes I can't sing anymore. I just feel at home now, in my voice.\nPitchfork: You always undersell yourself as a musician…Were you ever tempted to learn music theory?\nRW: I tried learning music, yeah. It's one of those things you sit down and try to do some days, like trying to understand the theory of revolution, or relativity, or how to win at chess or something like that. But I'm crap at it! It still looks like flyshit on telephone polls to me!\nPitchfork: Even though Comicopera deals with the fiasco in the Middle East and the terrible state of Western politics, it doesn't feel like a particularly depressing record.\nRW: I don't feel depressed! What I am is...pissed off that I'm probably not going to see a post-colonial era. One thing I remember from my childhood is that my parents' generation thought \"Ah thank god, that's the end of racism, and empire and all that stuff, and now we can have a new world of equality and mutual respect…The empire was disintegrating, it was turning into the Commonwealth and the Americas seemed to becoming more democratic and so did the Australians. It seemed like the world was becoming more decent.\nAnd then this thing creepy thing came along, where a kind of financial empire began to replace the military one. Lead from the United States. A pretty ruthless predatory economic approach. And the Americans became the most powerful people in the world, and became the role model for everyone else. I think it perverted everything. And of course economic power has to be constantly reinforced with military power otherwise people tell you to piss off. Every military enterprise that we've been involved in in the last 50 years, though in the guise of ridding the world of bad men, has been about not letting people get control of their own resources. But of course you can't say that. You can't say, \"We don't want Iraqis and Iranians to own their own oil because we want to own it.\" Who's going to let you go to war on that basis? Nobody. So it's not just the crime that's annoying, it's the bollocks that goes with it.\nPitchfork: In the third section you cover a song by the Italian euro-communists, CCCP. Do you identify with that old Gramsci line: \"pessimism of the intellect, optimism of the will\"?\nRW: I don't do optimism or pessimism. Gramsci was Italian and they always think in religious terms! I don't do hope, I don't do despair. I just get grumpy about some things and less so about others! That's why it's comic, remember, it's not grand opera.\nPitchfork: People always talk about the sadness of your music. I think they tend to underestimate your sense of humour.\nRW: Thank you for saying that! I consider myself a sit-down comedian really, as much as anything else. I love comedy. I love it when \"Extras\" is on. Or Eddie Izzard. And Alfie and I do make each other laugh. Silliness abounds in our house. My natural state is very light, you know. Life is a cosmic joke and all that.\nBut it just weighs me down sometimes. The imperialist shenanigans and the justifications that go with them. They're like a big ball and chain that English people have to live with. And it stops me really being able to have the fun I would like to have. I feel the next generation are going to say \"What did you do in the war, daddy?\" and…I didn't know what to do! I just sang a few grumpy songs about it.\nPitchfork: For the last third of the record you're so alienated by the Anglo-American establishment, you give up singing in English altogether. Are you ever tempted to move abroad?\nRW: It's hard to move. Alfie's favourite country is Spain, mine is Italy. We like it in Lincolnshire. But you can live anywhere, really, in your mind. And that's what I do. I just leave England for the last part of the record. I fly around the world and into the past, and surreal revolutionary fantasies fill my head. And I'm a happy bunny.",
      "author": "Stephen Troussé",
      "published_date": "2007-10-28",
      "word_count": 2748,
      "fetch_timestamp": "2025-08-20T07:46:39.426374",
      "metadata": {
        "char_count": 15191,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T07:46:39.426368"
      }
    }
  ],
  "total_articles": 9,
  "total_words": 9426,
  "extracted_at": "2025-08-20T07:46:39.426718",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/johnny-cash-songwriter/",
    "https://pitchfork.com/reviews/albums/bob-dylan-travelin-thru-featuring-johnny-cash-the-bootleg-series-vol-15/",
    "https://pitchfork.com/reviews/albums/johnny-cash-american-recordings/",
    "https://pitchfork.com/reviews/albums/15046-bootleg-volume-2-from-memphis-to-hollywood/",
    "https://pitchfork.com/reviews/albums/12331-johnny-cash-at-folsom-prison-legacy-edition/",
    "https://pitchfork.com/reviews/albums/11191-the-best-of-the-johnny-cash-tv-show-1969-1971/",
    "https://pitchfork.com/reviews/albums/9934-ultimate-gospel/",
    "https://pitchfork.com/features/interview/6868-emmylou-harris/",
    "https://pitchfork.com/features/interview/6718-robert-wyatt/"
  ]
}