{
  "artist_name": "Elton John",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/elton-john-honky-chateau-50th-anniversary-edition/",
      "source": "pitchfork",
      "artist_name": "Elton John",
      "title": "Elton John: Honky Château (50th Anniversary Edition)",
      "content": "---\ntitle: Elton John: Honky Château (50th Anniversary Edition)\nauthor: Olivia Lane\nurl: https://pitchfork.com/reviews/albums/elton-john-honky-chateau-50th-anniversary-edition/\nhostname: pitchfork.com\ndescription: Read Olivia Lane’s review of the album.\nsitename: Pitchfork\ndate: 2023-04-01\n---\nElton John has said that Honky Château did for him what Revolver did for the Beatles: It pried open the gilded gates, lifting him “onto a higher plane” as an artist. In 1972, when Honky Château went to No. 1, ending the Rolling Stones’ five-week reign with Exile on Main St., Elton was still a rascal. He had just turned 25 with seven records to his name, and he had yet to ascend into bona fide rockstardom. He was still small-time enough to be coerced to record outside of England to cut down on costs, his day could still be ruined if a hot American album arrived at an import shop a day late, and he still wore somewhat flat shoes on stage.\nIn its quaint intimacy and drama, Honky Château was a signpost of Elton’s imminent success, and four back-to-back classic records were waiting in the wings. The title honors Château d’Hérouville, the French countryside studio where it was recorded, the same one in which Vincent Van Gogh painted and Frederic Chopin had a mad love affair. Many fellow ’70s musicians, from Brian Eno to David Bowie, claimed the Château hosts centuries’ worth of something supernatural, with some going so far as to suggest that each record made there—think T. Rex’s “The Slider” and Bowie’s “Pin Ups”—holds a certain mystic quality.\nElton’s signature whimsy cloaks Honky Château like mist, so palpable that it almost confirms that fabled spirits must have come to his aid. The 50th-anniversary reissue continues to phantomize the soul-stirring and profound sentiments first cast in 1972, while remaining a tender portrait of Elton pre-rhinestones, as a fledgling celebrity. It boasts the option of a double LP or double CD, the latter featuring eight live recordings from Honky Château’s inaugural performance at London’s Royal Festival Hall in addition to bare outtakes from the Château, as well as a 40-page booklet. In these early recordings, Elton’s passion and dedication pleads to be heard. Whether nitpicking intros almost to the point of nausea or infusing vitality into each syllable like a mad scientist, a young Elton is constantly straining towards vein-popping perfection. And he’ll stop at nothing until he gets it.\n“Rocket Man,” a smash hit that was finished on his first day at the Château, sent Elton spaceward, much to Bowie’s chagrin. The common thread of “man in space” drew frequent comparisons, including from the Starman himself, who once agreed with a radio host who implied that Elton was riding his coattails. Longtime collaborator Bernie Taupin said in 2016 that the true inspiration for “Rocket Man” came from a 1951 short story by Ray Bradbury, about an astronaut father who leaves his wife and son for months on end to patrol planets and sweep stardust. Elton’s version of the tale soars on an electric slide guitar that melds the ordinary with the cosmic, defining how quietly devastating it is to have something you must leave behind.",
      "author": "Olivia Lane",
      "published_date": "2023-04-01",
      "word_count": 517,
      "fetch_timestamp": "2025-08-20T08:42:48.250913",
      "metadata": {
        "char_count": 3188,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:42:48.250897"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/high-ft-elton-john/",
      "source": "pitchfork",
      "artist_name": "Elton John",
      "title": "Young Thug: “High” [ft. Elton John]",
      "content": "---\ntitle: Young Thug: “High” [ft. Elton John]\nauthor: Sheldon Pearce\nurl: https://pitchfork.com/reviews/tracks/high-ft-elton-john/\nhostname: pitchfork.com\ndescription: A glorious, unlikely friendship takes flight\nsitename: Pitchfork\ndate: 2018-09-28\n---\nElton John has loved Young Thug ever since he heard one of his songs on Beats 1, and it’s a story of serendipity how the two came to be on the same track: Upon reading about John’s affinity for Thug, producer Stelios Phili started workshopping ideas on how to get the artists together. He approached Thug’s 300 A&R, Geoff Ogunlesi, with the idea; a mock-up was made on which Thug dueted with vintage Elton John vocals; then Thug and his team journeyed to John’s nearby Atlanta apartment to ask for his blessing. Not surprisingly, he embraced them. The song has been anticipated for years, even leaking about a month ago, and now, it’s here: “High,” among the most unlikely of pairings of recent memory, is glorious to take in.\nThe song is fashioned out of a sample from Elton’s classic 1972 hit “Rocket Man,” stripping away the original keys and slide guitar but leaving intact its weightless feeling and dramatic vocals. As John ascends into the held note at the end of “And I’m going to be high,” Thug’s Auto-Tuned falsetto shoots off to beat him to the summit. Both voices are so pure, almost translucent, like watching the sun’s reflection ripple along a body of water. “I love it when you sing,” Ogunlesi recalled John telling Thug when they met. “He said, ‘Your singing is special.’” The word “special” describes Thug in general, but it’s something else entirely to take such a singular song and make it your own, to make it remarkable all over again in a new way. Phili’s piano chords open up into trickling drums that bottom out mid-verse, leaving only single-drip synths, and Thug raps in bursts of out-there bars like, “I look like a cat with eleven lives/I really kick shit, you can ask a fly.” In Thug’s hands, an epic about the loneliness of space travel becomes a rousing voyage deeper into a head high; John’s wistful song about leaving what you’ve cherished behind to explore the unknown suddenly becomes something nearly rapturous and transporting. “High” is really only nominally a collaboration, but the synergy its artists share is real and rare.",
      "author": "Sheldon Pearce",
      "published_date": "2018-09-28",
      "word_count": 386,
      "fetch_timestamp": "2025-08-20T08:42:48.287589",
      "metadata": {
        "char_count": 2321,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:42:48.287579"
      }
    },
    {
      "url": "https://pitchfork.com/features/interview/6415-girl-talk/",
      "source": "pitchfork",
      "artist_name": "Elton John",
      "title": "Girl Talk",
      "content": "---\ntitle: Girl Talk\nauthor: Ryan Dombal\nurl: https://pitchfork.com/features/interview/6415-girl-talk/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2006-08-29\ncategories: ['features']\n---\nWhen most people flip on Top 40 radio, they hear universal, catchy songs that are difficult to forget. When 24-four-year-old Gregg Gillis, aka Girl Talk, listens to Top 40 radio, he enjoys them like anybody else at first. And then he filters the best of the bunch through his brain, searching for loops, phrases, and sounds that he can later combine into new sample-based compositions. The third and best Girl Talk album, Night Ripper, is the ecstatic result of this painstaking process-- a genre and decade-spanning marvel of post-modern music making. As anal Wikipedians try to catalogue all of the hundreds of samples that make up his new album, we called Gillis at his Pittsburgh home and chatted about the dubious legalities surrounding his work, his love of Nirvana, and how it feels to be that \"overhyped band you read about on the blogs.\"\nPitchfork: What's your dayjob?\nGreg Gillis: I do biomedical engineering work-- I'm nerded out by day.\nPitchfork: What's your day-to-day like at work?\nGG: I'm in this experimental division where nobody knows what the hell is going on and we're just trying out new ideas. I find out what's not working about certain products and what can be better. Then I go ahead and recruit people from the office to come in and do tests on them. I'm not supposed to go into detail about the products we work on.\nPitchfork: Can you say what company you work for?\nGG: No. I'd like to keep it under wraps.\nPitchfork: Very mysterious.\nGG: [laughs]\nPitchfork: Do people at work know about Girl Talk?\nGG: I actually don't tell them for a few different reasons, one being that there are articles printed saying that I'm doing this illegal art form on this large scale. It's funny, the day that Pitchfork review ran I got an e-mail from the Post Gazette-- which is the main paper here in Pittsburgh-- and they wanted to do a feature on me and I had to decline. It's the first time I ever declined an interview because it was going to be too weird if people from work read it. The other element is whenever you see me live I'm often ripping off my shirt or screaming into the mic. It's not like I'm playing drums in a band, so it's hard to explain.\nPitchfork: It's like you're living this double life.\nGG: Absolutely, it's crazy. I jump in my car on Friday in my casual office gear heading to NY or wherever to do a show that night. I've even flown out to Brussels and they didn't know the difference. It's really bizarre, but it's the way I roll now. If this breaks and someone finds out about it at work all of sudden they would find out that I'm going all over the country every weekend.\nPitchfork: That's not such a bad thing though.\nGG: It would just be weird that I've been hiding this huge part of my life from them. They always come in and ask me about my weekend and I am the resident young guy and whenever I have a wild night on the town in Pittsburgh they like to hear about it. A lot of times when I say I didn't do anything I was actually in Miami doing a show.\nPitchfork: So how is it living in Pittsburgh?\nGG: [laughs] It's cool. There are a lot of interesting bands but I don't know where I fit in here. I have my small little cult following, I play random shows from house parties to opening up for rock bands. There aren't people doing similar things to me and I'm not looking up to anyone and nobody's biting me.\nPitchfork: Were you ever tempted to move to somewhere like New York at any point?\nGG: I think if I lived in New York I would be really stressed out going out to a club and seeing a good DJ who's doing something on a similar level. I'm pretty critical of myself when it comes to the music. Maybe they're not doing as many samples or the samples aren't put together as specifically but it would stress me out to feel like I needed to be one upping someone. In Pittsburgh, I'm in my own world-- I know I'm the guy doing this here.\nPitchfork: How do position yourself in respect to artists like Diplo or the Avalanches?\nGG: I've heard that Avalanches record once and I've heard a little bit of Diplo but I don't listen to those artists much. A lot of people are making comparisons to Diplo and I haven't really heard his famous mixes. I'm trying to separate myself from other people by having songs that would be considered-- technically-- original things. I don't seek out mashups. I'm associated with the whole mashup movement, and it's too bad because I'm not a huge fan of them.\nPitchfork: When did you start the Girl Talk project?\nGG: It started the summer I before I went to college, in 2000. Prior to that I was in a noise band in high school called the Joysticks. We were these infamous little 16-year-olds who would smash televisions and stuff.\nPitchfork: So you basically started the Joysticks looking for something to do?\nGG: Pretty much. I found out about college radio and this whole noise genre blew me away. When I saw that guys could just get up there and have no traditional music ability and be in a band, it was really appealing to me. And before we knew it we were attending these Japanese noise concerts and we thought it would be awesome to start a band.\nPitchfork: Was there one band that made you rethink music when you were in high school?\nGG: The obvious answer is Merzbow. That was just the epitome of it-- he had such a huge discography and the fact that it was all different levels of noise. It was inspirational that someone could just do that. But I haven't bought a Merzbow record since high school.\nPitchfork: With my experience, I liked a lot of mainstream stuff in high school and then got into weirder artists in college, but it seems like it was the other way around for you.\nGG: Though I was a jaded high schooler, I was still into pop music, though not as sincerely as I am now. It was more tongue-in-cheek back then. But I think in college I stayed into pop music. The first Girl Talk record was really experimental but my interest faded.\nPitchfork: Why do you think you got tired with the more experimental stuff?\nGG: I'd been to a lot of shows and I was just tired of people being jaded about music in general. Just a lot of pretensions, a lot of the attitude that goes along with it was a little difficult for me to deal with. The whole cooler-than-thou aspect of listening to underground music was ridiculous to me.\nPitchfork: I remember when I was in college, kids talking about these exclusive Merzbow pressings like there were only 25 records on earth or whatever. But it was so transparent that a lot of them didn't even listen to his music.\nGG: Exactly. It makes a lot of sense to try to be cooler than other people with these really weird bands in high school but then it clicked, like, \"What's the point?\" I still like weird music but there's such an overabundance that it's hard for me to stay enthusiastic about it. Nobody was really blowing me away on the experimental tip, it seemed like a lot of people were reinventing the wheel.\nPitchfork: Given the breadth of samples on Night Ripper, I was wondering how many albums do you actually own?\nGG: It's on the level of any normal guy. I have hundreds of CDs definitely. I don't think my record collection is overwhelming compared to anyone else's. The thing about Girl Talk is it's not about this great knowledge in music necessarily; I don't think my record collection or musical knowledge is vast. I just listen to the radio all the time-- I'm a pop music enthusiast.\nPitchfork: So if you got into your car, which station would you turn on first?\nGG: My favorite Pittsburgh station is the oldies station and then the hip-hop station. But right now there are probably 30 cassettes sitting in the passenger seat of my car at the feet. I have a Cavalier so there's a cassette deck. I have a really nice collection of 1990s alternative music on cassette, like Nirvana type stuff. That's always a heavy hitter.\nPitchfork: With alternative rock, was that something you listened to a lot as a teenager and then came back to?\nGG: Yeah, that's kind of a nostalgia thing. Nirvana was my first favorite band, in third or fourth grade. Then I got out of them because I probably picked up a Merzbow record and thought I was too cool for Nirvana. But one day in college a few buddies and myself all started listening to them again and it blew me away. They still stand out as my favorite band ever.\nPitchfork: On Night Ripper, when the \"Scentless Apprentice\" drums kick in it's a great moment.\nGG: In Utero is probably my favorite rock record of all time. It's hard to even pick something to sample off of that record, it's all so heavy. I do a cover of \"Scentless Apprentice\" to close out my live shows. It's the only time I ever sing.\nPitchfork: What's that like?\nGG: It's good. A lot of time my live shows need to be taken to that next level. Sometimes the show needs that kick in the ass so being able to sing a Nirvana song kind of takes it there. I've grown up putting on extravagant shows with Girl Talk so when I'm playing I like to go nuts. After 30 minutes of pointing and clicking it's nice to scream into a microphone for three minutes.\nPitchfork: It's tough to get excited about laptop shows sometimes.\nGG: When the whole Girl Talk thing started the music was more experimental so there was more of a need to entertain-- there were more outfit changes and pyrotechnics. Then I went through an era of a couple years where I had a synchronized dance squad with me. The first time I did that there was a team of 10 people. Then it was just four girls, that was the standard. Now people seem to know it's going to be a dancing affair and I don't feel as stressed out to entertain anymore.\nPitchfork: The whole Girl Talk thing makes sense in a strange way given your history-- it's like you're bringing this mainstream music to people in a very DIY fashion.\nGG: The shows have been great recently because I'll play a plush dance club and then I'll play someone's living room for 40 people on a Saturday night and then I'll play an art gallery. I'm blurring the lines as far as where this music is appropriate.\nPitchfork: Moving onto Night Ripper, conceptually, some peopled I've discussed the album with think it may be subversively using indie rock to legitimize hip-hop-- like the only reason some people will listen to rap is when it's backed by a Pixies sample. What's your take on that?\nGG: I think it's promoting the whole history of rap. Throughout hip-hop people have been putting different elements with different types of music. It's not about who created this source originally, it's about recontexualizing-- creating new music. It's not a hip-hop record straight up by any means. It's a celebration of everything top 40, that's the point.\nPitchfork: Do you think, without the internet and its relation to music, this album could have been made 10 years ago?\nGG: The internet helps with information exchange in general so it's obviously easier to check out tracks and whatnot from different genres. I think people are a lot more open to music in general because it's being communicated easier. Ten years ago it would be really difficult to communicate an album like Night Ripper and it may have been heard only amongst my 30 friends. But now all of a sudden it's possible for a 10-year-old kid to listen to my album somewhere.\nPitchfork: How many of the things you sampled on Night Ripper did you download as opposed to buying them?\nGG: I'd say I own under half of the source material. Sometimes I would even download stuff out of simplicity rather than track down a CD.\nPitchfork: Do you just have a lot of hard drives full of music?\nGG: Yeah. I've been doing the Night Ripper style of music live for the past two or three years. I'll just hear something on the radio or at a party and go ahead and sample it off a CD or record or download it. I sample loops and breaks and vocal clips all the time. So I've been cataloguing samples for years, I have this massive library. Songs come out everyday so it's never ending.\nPitchfork: The samples are very specific-- when you listen to a song for the first time do you know which lines you want to pick out immediately?\nGG: Sometimes. Anyone can make a mashup in 30 seconds but that record took me-- outside of collecting the samples-- at least a year of putting everything together. It's always just trial-and-error, I get all the loops and mix-and-match them on my computer. A lot of different variations of this album went down live over the course of the last two years, different mixes, beats, and samples. That was a good way to filter down to exactly what I wanted.\nPitchfork: How many loops did you collect?\nGG: [laughs] On this album I counted up 167 artists that I sampled blatantly and a lot of the beats are cut up percussion from other songs that I wouldn't be able to remember. A lot of those artists were sampled more than once so I'd say there were at least 200 to 250 blatant samples. But for every one sample I used there were 25 samples I didn't use. I can't do that math off the top of my head [250 * 25 = 6,250].\nPitchfork: Do you think there's a connection between your work as a biomedical engineer and your approach to music?\nGG: Maybe. It's funny because I use minimal software to make my music-- a wav editor and a calculator for my beats to make sure everything falls on mathematical precision. If you were just mapping this out visually, it works by math. I guess it's slightly engineering influenced.\nPitchfork: As far as the process of matching vocals up with your beats, like when you put Biggie's \"Juicy\" verse over \"Tiny Dancer\" or the vocals from \"Hate It or Love It\" over Better Than Ezra, those pairings work really well but not just because they sound cool-- they really open up another way to access the meaning of the lyrics.\nGG: People can judge me on whatever level they think but I've always tried to make my own songs. They're blatantly sample based but I tried to make them so that you'd listen and think, \"Oh, that's that Girl Talk song,\" as opposed to just a DJ mix.\nPitchfork: For the Biggie/Elton John bit, was combining those two just a trial-and-error process?\nGG: To be honest, I almost never hear a song on the radio and think something would go good over it on the fly. But that actually happened to happen with the \"Juicy\" verse after I heard \"Tiny Dancer\" on the radio. There were probably only one or two instances like that on the album. I'm really critical and I have a hard time making decisions about what to choose. There are so many options.\nPitchfork: This doesn't seem like the type of music that's conducive to indecisiveness.\nGG: It's entertainment for me to sit down and prepare the live show but it's more business to prepare for an album. It's stressful.\nPitchfork: How many hours a day do you devote to music?\nGG: It depends but I'd say on a typical weekday I come home and work on music for like an hour before I go and hang out with my girlfriend and she sucks up the rest of my time [laughs]. The cool thing about it is I can sit down for honestly 15 minutes and sample a hook and mix it in with something and have that idea forever. It takes hours and hours to compile it all but it only takes a couple minutes to lock something down that sounds amazing.\nPitchfork: How do you know when to stop adding samples to the songs?\nGG: I could have easily doubled the amount of samples on this album. People talk about all the samples like it's some technical feat but I could've went over the edge. I'm always trying to max it out without being too overwhelming. It's important that you can recognize all the elements. The whole basis of the music is that people have these emotional attachments to these songs-- whether they love it or hate it. Being able to manipulate that is a really easy way to connect with people.\nPitchfork: I know mixing \"My Humps\" with Annie's \"Heartbeat\" has caused some internal conflict among certain Pitchfork staffers.\nGG: I've heard a few people have problems with the \"My Humps\" thing. It's funny when you're pushing it on this Pitchfork crowd and all of a sudden I'm presenting these songs that people are supposed to hate for whatever reason. The whole point of not liking something is being defensive because you're scared of not being cool. But I'm just making fun music so you can let your guard down and enjoy it, don't worry about what's cool and what's not. I think the lines are breaking down in general on that level because I've been doing this for a while and previously I always felt like I was stepping on people's toes going into these indie rock clubs and playing pop music. I remember doing this in 2002 and dropping Madonna samples and opening up for some math rock band and it was like, \"Who's this jackass up there?\" Now it's like, \"Oh, I love dancing to that song.\"\nPitchfork: Do you have any type of explanation for that change?\nGG: I really think it's a general trend toward acceptance of Top 40 being a cool thing in the underground. It goes along with the whole thing about indie dance nights in all these cities now where they play pop music and it's all these kids who listen to Lightning Bolt by day and dance to Top 40 by night.\nPitchfork: With the \"Bittersweet Symphony\" sample on first song on Night Ripper, I couldn't help but think about that song being at the center of its own sample controversy with the Rolling Stones.\nGG: Yeah, that was a conscious decision. I thought it would be a funny thing and I do love that song. It was a such a perfect hook to sample. \"Bittersweet Symphony\" just stands the test of time for a lot of people. The other small version of that is the Elastica sample because they had problems with Wire over that riff.\nPitchfork: As far as legal issues regarding the CD, you've been sampling for a while, how much do you think about that when you're making this type of music?\nGG: The music is in no way politically based-- I'm not trying to make a point about sampling. It may bring up issues but I'm not trying to push it on anyone. This album has a lot more crossover appeal and it's a lot easier to listen to than my other records. My label, Illegal Art, and I are just a little worried about potential legal repercussions. But we stand by the fair use law; that we do recontextualize the source material into a new whole. I don't know if our argument would hold any water. Regardless of whether it does or not, I absolutely think that it should be legal because I really don't feel like we're potentially hurting the sales of the artists sampled on the record. If anything, it's potentially promoting the artists sampled. We haven't heard from anyone yet but we're just waiting for a cease and desist to come in the mail.\nPitchfork: Do you know what you stand to be sued for?\nGG: If something was to happen we'd hope for a cease and desist as opposed to them suing an independent artist and label making practically no money. That's the worst case scenario and we could potentially be involved with that and we're all hoping it doesn't.\nPitchfork: Let's say you get a cease and desist, how would you deal with that?\nGG: I don't know if Illegal Art would want to fight it or not. I would be willing to take the cease and desist, I would just start giving away the samples and I'm sure the publicity from that would probably spread the music to a few more people. At this point I would love for Illegal Art to break even, which I think will be the case. The cease and desist wouldn't be a huge problem to me-- the people who really want the album got it and the people who want it in the future should be able to download it wherever. I would give this music away as downloads for free straight up-- if I could still be considered a legitimate musician releasing stuff for free.\nPitchfork: What makes you think people wouldn't take an internet release seriously?\nGG: The whole element about having a tangible thing and going to the store and a label fronting this amount of money to put it out all of a sudden makes it this legitimate product. Even if I released something online now it'd be like, \"He obviously doesn't take this as seriously as Night Ripper because he took the hassle to put that on CD and he gave this away for free.\"\nPitchfork: Right, but I think it's going more toward the physical CD not being a factor.\nGG: I agree but for now I do like having a CD. It's the rock and roll fantasy to be able to make your own music and put it on a CD and have your name on it-- it's awesome.\nPitchfork: I read that when you sent the CD to the pressing plant, it originally rejected it or something?\nGG: Actually, the glass manufacturer that we went to to make the master CD had problems with it. They were supposed to mail it out and Illegal Art called them and asked them for the tracking number for the package and they asked if we'd cleared any of the samples. So we went back and forth with them. Illegal Art did have a lawyer talk with them and I was actually impressed that they heard us out. The glass manufacturer chose two specific samples-- a Billy Squier sample and a Waitresses sample-- and asked if we could justify their recontexualization. We came up with a whole bunch of different arguments and but were trying to get a rushed released so the source material would stay current and it was taking so long so we asked them to make a quick decision and they decided not to go with it.\nPitchfork: Why do you think they picked out those specific samples to scrutinize?\nGG: Maybe it was just an older guy who doesn't pay attention to music and he just recognized those songs. Because if you listen to this whole record and you thought one band created everything you have to be insane.\nPitchfork: Maybe they were just fucking with you-- it would be funny if someone did think the album was originally made by one band.\nGG: Right, and then we just threw on this Billy Squier sample in the middle [laughs].\nPitchfork: Did you expect Night Ripper to get this reaction?\nGG: My friends all really liked it and, at first, we couldn't believe that it wasn't crossing over more. It's an obvious formula-- recontextualizing elements people know into new songs-- but as I was making the album I was thinking I don't know if I've heard anything on this level as far as the intensity of samples. I thought if people actually heard it there would be a good group that liked it. Now everything's gotten insane and it's been a little overwhelming.\nPitchfork: How so?\nGG: I'm doing an interview with MTV's website tomorrow. I guess it's just a word-of-mouth thing. It's just weird for me. I've grown up playing pop music for the experimental crowd and I always feel like I'm pushing something weird on people. I had this underdog feeling. It's crazy that all of a sudden I'm the overhyped band you read about on the blogs. I'm cool with it and ready for it and it just flipped all of sudden.\nPitchfork: Now you have to look forward to the backlash.\nGG: I'm ready for it, I love backlashes [laughs]. Actually, backlashes are all about people being worried about being not cool and that's what I stand against. People are excited to be the first person to dislike something. There's always this attitude in underground music-- prejudice against liking something mainstream. It always exists and it always will so for Night Ripper to champion top 40 stuff on an underground level from a one man band flips the whole situation.\nPitchfork: Would you want to do the music thing full time?\nGG: Absolutely. I don't know the logistics of that-- I have a hard time organizing my money. I like to give stuff away for free and play shows for cheap and not rely on music as a job. I like to play people's basements if they want me to. Right now I'm kind of doing it as full time as I want to but it would be great to stop the job and go on tour and have big shows every night of the week, it would be amazing.\nPitchfork: So you're not considering buying anything extravagant just yet?\nGG: Maybe a new mouse. As far as I know we're just about breaking even at this point. I've definitely seen the popularity increase as far as show requests and interest but nothing's changed on the financial end. I've probably blown any money I've made so far on Subway-- I'll get a 12\" instead of a 6\" now.",
      "author": "Ryan Dombal",
      "published_date": "2006-08-29",
      "word_count": 4491,
      "fetch_timestamp": "2025-08-20T08:42:48.329173",
      "metadata": {
        "char_count": 24442,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:42:48.329164"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/",
      "source": "pitchfork",
      "artist_name": "Elton John",
      "title": "The Pitchfork Review: All of the Latest Episodes",
      "content": "---\ntitle: The Pitchfork Review: All of the Latest Episodes\nauthor: Condé Nast\nurl: https://pitchfork.com/podcast/the-pitchfork-review/\nhostname: pitchfork.com\ndescription: Listen to every episode of Pitchfork’s podcast for music fans and obsessives.\nsitename: Pitchfork\ndate: 2024-01-11\ntags: ['web']\n---\nBrought to you by the music critics at Pitchfork, The Pitchfork Review is a show for music fans and obsessives who can’t wait to talk about the latest releases. Co-hosted by Pitchfork editor-in-chief Puja Patel and Reviews Editor Jeremy D. Larson, this podcast pulls back the curtain on our reviews and scores, dives deep into new music, and gives an expert guide to what’s exciting, what’s great, and what’s just plain terrible.\nListen to every episode of Pitchfork’s podcast for music fans and obsessives.\nRelated Articles\nThe Origins and Influence of Brian Eno’s Pioneering Album Ambient 1: Music for Airports\nIn the latest episode of Pitchfork’s podcast, our critics revisit the legendary producer’s classic 1978 LP, which was recently featured in our Sunday Review series.\nBy Pitchfork\nJeff Tweedy on Rock Criticism, the Pitfalls of Music Snobbery, and His New Book\nThe musician and author discusses World Within a Song, in which he writes about 50 songs that rearranged his brain, Wilco’s new album, and more.\nBy Pitchfork\nThe 2023 Music Grab Bag: Trends, Scandals, and Theories\nIn this episode of the Pitchfork Review podcast, our critics talk about the rise of the musical theater girlie, the fall of the 1975’s Matty Healy, and more. Plus: Alvvays’ Molly Rankin reveals the song she wishes she wrote.\nBy Pitchfork\nThe Best, Worst, and Most Surprising Albums of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about some of their faves from our 50 Best Albums of 2023 list and lament a few of the year’s biggest disappointments.\nBy Pitchfork\nWhy the Replacements’ Tim Is the Best Reissue of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about the revelatory new version of the beloved rock band’s 1985 LP. Plus, Replacements bassist Tommy Stinson reveals his perfect-10 album.\nBy Pitchfork\nBreaking Down Bad Bunny’s New Album and the Future of Puerto Rican Rap and Reggaeton\nIn this episode of The Pitchfork Review podcast, our critics dissect Bad Bunny’s latest and highlight a few new queer artists from Puerto Rico who are taking the island’s music to exciting new places.\nBy Pitchfork\nDebating the Best Songs of 2023, Part Two\nIn this episode of the Pitchfork Review podcast, our critics battle it out over some of their favorite songs of the year, by artists including Troye Sivan, Kendrick Lamar, Big Thief and more. Plus: Devendra Banhart tells us all about his dream collaboration.\nBy Pitchfork\nDebating the Best Songs of 2023, Part One\nIn this episode of the Pitchfork Review podcast, our critics take sides and discuss which tracks by some of 2023’s most exciting artists deserve a spot on our upcoming year-end lists.\nBy Pitchfork\nThe Good, the Bad, and the Swiftie of Taylor’s Eras Tour Concert Film\nIn this episode of The Pitchfork Review podcast, our critics wade through the ups and downs of the pop superstar’s new record-breaking live movie.\nBy Pitchfork\nWhat Drake Is Doing Wrong—and How He Can Fix It\nIn this episode of the Pitchfork Review podcast, our critics talk about what made them care about Drake in the first place, why his new album For All the Dogs is so frustratingly mid, and what he should do next.\nBy Pitchfork",
      "author": "Condé Nast",
      "published_date": "2024-01-11",
      "word_count": 579,
      "fetch_timestamp": "2025-08-20T08:42:48.387948",
      "metadata": {
        "char_count": 3506,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:42:48.387929"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/eddie-vedder-earthling/",
      "source": "pitchfork",
      "artist_name": "Elton John",
      "title": "Eddie Vedder: Earthling",
      "content": "---\ntitle: Eddie Vedder: Earthling\nauthor: Alfred Soto\nurl: https://pitchfork.com/reviews/albums/eddie-vedder-earthling/\nhostname: pitchfork.com\ndescription: Read Alfred Soto’s review of the album.\nsitename: Pitchfork\ndate: 2022-02-11\n---\nTo imagine the Eddie Vedder of 1993 one day sharing a mic with Elton John is like imagining the Billy Corgan of 1994 eventually writing for Marianne Faithfull: not an improbability, a reimagining. But there they are, Elton and his piano, on a rollicking little number on Vedder’s Earthling called “Picture,” his voice as crinkled as a damp leather wallet. Amiable, tuneful, and inessential, “Picture” exemplifies the spirit of the Pearl Jam frontperson’s first non-soundtrack solo album since 2011: a suite of crunchy rockers intermingling with chamber pop, recorded with the help of Stevie Wonder here and Ringo Starr there, a space for musicians who, as a pandemic raged, still wanted to bro down, virtually or otherwise. Imagine Live From Eddie’s House, not Traveling Wilburys, Vol. 1.\nSteeped in the mythos of bands as the last gangs in town, Vedder allows these superstar friends to garnish tracks instead of bullying them; this Neil Young and Pete Townshend devotee betrays not a hint of lèse-majesté. (Stevie and company come in at the end as if at a concert, he observed in a recent interview.) The backing band—Red Hot Chili Peppers drummer Chad Smith, former Chili Pepper guitarist Josh Klinghoffer, and co-producer Andrew Watt on bass—don’t pestle the material. Listeners, presumably Vedder’s age and who keep their Pearl Jam CDs close, may find the petulant confidence of those guitars a reason to endure this dirty world; it’s as if the mutant disco jive “Dance of the Clairvoyants” from Pearl Jam’s last album, 2020’s Gigaton, were a bad dream after eating spoiled tuna salad. “Good and Evil” and “Rose of Jericho” will not repulse fans of bullshit-free churners like No Code’s “Lukin” or the eponymous 2006 album’s “Comatose.”\nEarthling’s sturm und drang avoids potted gestures of dads-jamming-in-the-garage rebellion. A feminist in an aggro scene in which Courtney Love endured a lot of shit, Vedder has told women’s stories as early as “Alive.” The hard acoustic strummer “Fallout Today” gets into the mind of someone “drowned in her perceptions/reaching out in all directions/No escape.” It’s lovely to listen to “Invincible” open up to a multi-tracked Vedder wordlessly scraping at the ineffable like the late Nusrat Fateh Ali Khan taught him long ago; I don’t suggest Vedder is at his level, but the effort to escape the strictures of language redresses the image of the Soundscan-era scold. But despite the clawing after transcendence, songs are fictions, momentary in the mind. “Can’t escape the timeline,” he concedes on the pillowy, Tom Petty-indebted “Long Way” as Heartbreaker Benmont Tench adds organ washes. Brother, take a number.\nAs the morose soothsayer ceded ground to the ukulele strummer of the last decade, Vedder has accepted with dignity his position as one-fifth of what was once—briefly—the world’s biggest band. He’s lither; he sings with a spring in his step, trusting the deepened range of his indignant burr. After several Pearl Jam albums of material pounded into meat sauce, the airier delights of Earthling’s end run let Vedder stretch—cautiously. Ringo offers the usual super-steady drum work on “Mrs. Mills,” an ode to British pianist Gladys Mills and elegy to Vedder’s own musician father, his sampled trumpet shimmering like a memory of Swinging London. “Try” boasts Stevie Wonder’s harmonica, his skirls a pair of stirrups driving Vedder and Klinghoffer’s rhythm work. “Good men don’t have to pretend!” Vedder shouts. He may even have cracked a smile.\nBuy: Rough Trade",
      "author": "Alfred Soto",
      "published_date": "2022-02-11",
      "word_count": 592,
      "fetch_timestamp": "2025-08-20T08:42:48.421861",
      "metadata": {
        "char_count": 3758,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:42:48.421855"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/laura-nyro-american-dreamer/",
      "source": "pitchfork",
      "artist_name": "Elton John",
      "title": "Laura Nyro: American Dreamer",
      "content": "---\ntitle: Laura Nyro: American Dreamer\nauthor: Sam Sodomsky\nurl: https://pitchfork.com/reviews/albums/laura-nyro-american-dreamer/\nhostname: pitchfork.com\ndescription: Read Sam Sodomsky’s review of the album.\nsitename: Pitchfork\ndate: 2021-09-22\n---\nLaura Nyro’s first album was called More Than a New Discovery, and the message implicit in that title was indicative of the way people talked about the Bronx songwriter early in her career. The marketing was hyperbolic. The expectations were unreasonable. And, more often than not, Nyro lived up to all of it. Only 19 when her debut album was released in 1966, she soon became famous for writing hits for other artists—one week in November 1969, three of the Top 10 songs in the country were her compositions, as interpreted by the 5th Dimension, Blood, Sweat and Tears, and Three Dog Night. Her own music, however—performed at the piano and sung in a voice that galloped between octaves as if auditioning for all the roles in a musical at once—aspired to places beyond the charts.\nHistory looks fondly upon artists who prove themselves commercially yet seek to occupy more artful territory. Like so many of them, Nyro’s greatest legacy is in the wide range of artists she influenced: Joni Mitchell was inspired by her inventive piano playing; Elton John found his voice within her detail-rich songwriting; both Todd Rundgren and the members of Steely Dan took early influence from her jazzy, meticulous melodies; Bette Midler wanted to sing like her; Miles Davis and Alice Coltrane spent studio time alongside her.\nSome of these artists’ testimonies appear in Peter Doggett’s liner notes for a new box set, American Dreamer, which collects Nyro’s studio output from the 1960s and 1970s, all remastered on vinyl along with a bonus LP of familiar demos and live recordings. Reading her biography from beginning to end is intense, and it’s a little heartbreaking to realize the extent to which she was misunderstood despite her obvious, prodigious talent. But, as she always intended, her story is best told through her music. These albums are so melodically intricate, so carefully performed, so thematically ambitious—encompassing life, death, love, religion, addiction, politics—you can hear why so many musicians around her tore up whatever they were working on and decided to take their craft a little more seriously.\nThe key element to Nyro’s approach was freedom. Her songs would begin and end whenever she wanted, fragmented or extended into symphonic mantras. When one melody had done its work, she would shift to another one entirely, often with no warning. (It is no surprise that she preferred playing solo, without the constraints of explaining herself to collaborators.) Her primary influences were girl groups, soul music, and gospel, and what she seemed to admire was the way these styles were built to move an audience: Her most memorable songs, like 1968’s “Poverty Train,” would speed and slow abruptly, as if she noticed someone in the audience who seemed unmoved, and so she climbed out to meet them and adjusted her delivery to suit that particular person. She would not leave the room until everyone had been engaged.",
      "author": "Sam Sodomsky",
      "published_date": "2021-09-22",
      "word_count": 511,
      "fetch_timestamp": "2025-08-20T08:42:48.461247",
      "metadata": {
        "char_count": 3189,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:42:48.461239"
      }
    },
    {
      "url": "https://pitchfork.com/features/",
      "source": "pitchfork",
      "artist_name": "Elton John",
      "title": "Music Articles & Features",
      "content": "---\ntitle: Music Articles & Features\nauthor: Condé Nast\nurl: https://pitchfork.com/features/\nhostname: pitchfork.com\ndescription: Longform and in-depth analysis about the most exciting and important music being released today\nsitename: Pitchfork\ndate: 2025-08-14\ntags: ['web']\n---\nDekmantel Is a Dance Festival Shedding Light on the Underground\nWe touched down in Amsterdam for the 2025 edition of the left-of-center electronic festival and came back with some thoughts about live sets, drum heads, speaker cabinets, bass fiends, techno lords, and the simple power of naming some club-ready bangers.\nBy Jeremy D. Larson\nThe 59 Best Albums of 2025 So Far\nBy Madison Bloom, Nina Corcoran, Anna Gaca, Walden Green, Jeremy D. Larson, Marissa Lorusso, and Philip Sherburne\nNight Out 2025: Pitchfork and Them’s Showcase for the Future of Queer Music\nBy Olivier LafontantPhotography by Dillon Edlin\nThe 37 Most Anticipated Albums of Summer 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2025\nBy Madison Bloom, Nina Corcoran, Walden Green, Jazz Monroe, and Matthew Strauss\nWhat Happened at Pitchfork’s Bladee Zine Launch\nBy PitchforkPhotography by Caroline Friedman\nA Rare Interview With Bladee, the Mystic Oracle of Internet Rap\nBy Meaghan GarveyPhotography by Jason Nocito\nHighlights From Pitchfork’s 2024 Year in Music Club Night\nBy PitchforkPhotography by Sam Wachs\nHighlights From Pitchfork and Thought Enthusiast’s Year in Music Panel\nBy PitchforkPhotography by Sam Wachs\nThe 50 Best Albums of 2024 So Far\nBy Anna Gaca, Isabelia Herrera, Jeremy D. Larson, and Philip Sherburne\nThe 18 Best Moments From Pitchfork Music Festival 2024\nBy Boutayna Chokrane, Nina Corcoran, and Heven Haile\nThe 41 Most Anticipated Albums of Summer 2024\nBy Boutayna Chokrane, Nina Corcoran, Jazz Monroe, Matthew Strauss, and Eric Torres\nThe 50 Most Anticipated Albums of Spring 2024\nBy Madison Bloom, Boutayna Chokrane, Nina Corcoran, Matthew Strauss, and Eric Torres\nHow Waxahatchee Made the Album of Her (Second) Life\nBy Andy CushPhotography by Bobby Doherty\nChasing the Goblin With Mabe Fratti, the Guatemalan Cellist at the Heart of Mexico City’s Avant-Rock Scene\nBy Philip SherburnePhotography by Filip Preis",
      "author": "Condé Nast",
      "published_date": "2025-08-14",
      "word_count": 347,
      "fetch_timestamp": "2025-08-20T08:42:48.761730",
      "metadata": {
        "char_count": 2280,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:42:48.761714"
      }
    },
    {
      "url": "https://pitchfork.com/features/5-10-15-20/",
      "source": "pitchfork",
      "artist_name": "Elton John",
      "title": "5-10-15-20",
      "content": "---\ntitle: 5-10-15-20\nauthor: Condé Nast\nurl: https://pitchfork.com/features/5-10-15-20/\nhostname: pitchfork.com\ndescription: Talking to our favorites artists about the music of their lives, five years at a time\nsitename: Pitchfork\ndate: 2025-08-01\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\n5-10-15-20\nTalking to our favorite artists about the music of their lives, five years at a time\nAll\nLists & Guides\n5-10-15-20\nInterview\nLongform\nCover Story\nRising\nInteractives\nPodcast\n5-10-15-20\nCardo Got Wings on the Music That Made Him\nBy\nSerge Selenou\nAugust 1, 2025\n5-10-15-20\nHaruomi Hosono on the Music That Made Him\nBy\nJoshua Minsoo Kim\nJune 18, 2025\n5-10-15-20\nDJ Koze on the Music That Made Him\nBy\nLaura Snapes\nApril 8, 2025\n5-10-15-20\nAdam Scott on the Music That Made Him\nBy\nJeremy D. Larson\nMarch 21, 2025\n5-10-15-20\nMax Richter on the Music That Made Him\nBy\nJazz Monroe\nSeptember 4, 2024\n5-10-15-20\nLiz Phair on the Music That Made Her\nBy\nJill Mapes\nNovember 20, 2023\n5-10-15-20\nJohn Mulaney on the Music That Made Him\nBy\nEvan Minsker\nOctober 19, 2023\n5-10-15-20\nBlonde Redhead’s Kazu Makino on the Music That Made Her\nBy\nNina Corcoran\nOctober 2, 2023\n5-10-15-20\nBlack Thought on the Music That Made Him\nBy\nRyan Leas\nAugust 22, 2023\n5-10-15-20\nThe Music That Made Cosmic Bluesman Lonnie Holley\nBy\nMadison Bloom\nMarch 27, 2023\n5-10-15-20\nDJ Premier on the Music That Made Him\nBy\nDylan Green\nDecember 12, 2022\n5-10-15-20\nFreddie Gibbs on the Music That Made Him\nBy\nDylan Green\nNovember 17, 2022\n5-10-15-20\nBabyface on the Music That Made Him\nBy\nClover Hope\nOctober 3, 2022\n5-10-15-20\nBeth Orton on the Music That Made Her\nBy\nAllison Hussey\nSeptember 8, 2022\n5-10-15-20\nJazz Innovator Vijay Iyer on the Music That Made Him\nBy\nNate Chinen\nJune 28, 2022\n5-10-15-20\nThe Neptunes’ Chad Hugo on the Music That Made Him\nBy\nAlphonse Pierre\nJune 14, 2022\n5-10-15-20\nThe Music That Made Cyndi Lauper\nBy\nJill Mapes\nJune 8, 2022\n5-10-15-20\nThe Music That Made R&B Rebel Swamp Dogg\nBy\nMadison Bloom\nApril 26, 2022\n5-10-15-20\nLavender Country’s Patrick Haggerty on the Music That Made Him\nBy\nAllison Hussey\nMarch 15, 2022\n5-10-15-20\nJuliette Lewis on the Music That Made Her\nBy\nQuinn Moreland\nFebruary 15, 2022\n5-10-15-20\nMichael Stipe on the Music That Made Him\nBy\nRyan Dombal\nNovember 10, 2021\n5-10-15-20\nTori Amos on the Music That Shaped Her Life\nBy\nEric Torres\nNovember 1, 2021\n5-10-15-20\nElvis Costello on the Music of His Life\nBy\nMadison Bloom\nNovember 30, 2020\n5-10-15-20\nAimee Mann on the Music That Made Her\nBy\nEric Torres\nNovember 24, 2020\n5-10-15-20\nThe Music That Made Beverly Glenn-Copeland\nBy\nJesse Dorris\nNovember 5, 2020\n5-10-15-20\nThrowing Muses’ Kristin Hersh on the Music That Made Her\nBy\nPhilip Sherburne\nOctober 28, 2020\n5-10-15-20\nThe Music That Made Miranda July\nBy\nQuinn Moreland\nOctober 20, 2020\n5-10-15-20\nTom Morello on the Music of His Life\nBy\nMatthew Ismael Ruiz\nSeptember 10, 2020\n5-10-15-20\nThe Music That Made Conor Oberst\nBy\nSam Sodomsky\nAugust 21, 2020\n5-10-15-20\nThe Music That Made Laraaji\nBy\nIsabelia Herrera\nAugust 5, 2020\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-01",
      "word_count": 545,
      "fetch_timestamp": "2025-08-20T08:42:49.141067",
      "metadata": {
        "char_count": 3216,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:42:49.141049"
      }
    }
  ],
  "total_articles": 8,
  "total_words": 7968,
  "extracted_at": "2025-08-20T08:42:49.297259",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/elton-john-honky-chateau-50th-anniversary-edition/",
    "https://pitchfork.com/reviews/tracks/high-ft-elton-john/",
    "https://pitchfork.com/features/interview/6415-girl-talk/",
    "https://pitchfork.com/features/podcast/",
    "https://pitchfork.com/reviews/albums/eddie-vedder-earthling/",
    "https://pitchfork.com/reviews/albums/laura-nyro-american-dreamer/",
    "https://pitchfork.com/features/",
    "https://pitchfork.com/features/5-10-15-20/"
  ]
}