{
  "artist_name": "BTS",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/music/pop/bts-movie-weeks-four-concert-films-4k-across-globe-details-1236047882/",
      "source": "billboard",
      "artist_name": "BTS",
      "title": "‘BTS Movie Weeks’ To Screen Four of K-Pop Group’s Concert Films in 4K Across the Globe",
      "content": "---\ntitle: ‘BTS Movie Weeks’ To Screen Four of K-Pop Group’s Concert Films in 4K Across the Globe\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/pop/bts-movie-weeks-four-concert-films-4k-across-globe-details-1236047882/\nhostname: billboard.com\ndescription: 'BTS Movie Weeks' will feature screenings of four of the K-pop supergroup's live concert films around the globe with remastered 4K visuals.\nsitename: Billboard\ndate: 2025-08-20\ncategories: ['Pop']\ntags: ['genre kpop, movies, Music News']\n---\nIf you haven’t already begun gearing up for BTS‘ breathlessly anticipated return next year, you’ll get a chance to brush up on RM, Jin, SUGA, j-hope, Jimin, V and Jung Kook’s most iconic looks and movies next month thanks to BTS Movie Weeks. On Wednesday (Aug. 20), the K-pop superstars announced a cinematic celebration featuring screenings of four of their beloved concert films.\nMovie Weeks will hit more than 2,500 theaters in 65 countries/regions from Sept. 24 through Oct. 5 for showings of 2016’s Live 花樣年華 On Stage : Epilogue Remastered, BTS 2017 Live Trilogy EPISODE III THE WINGS TOUR THE FINAL Remastered, BTS 2019 WORLD TOUR ‘LOVE YOURSELF: SPEAK YOURSELF’ LONDON Remastered and BTS 2021 MUSTER SOWOOZOO Remastered.\nThe 2016 and 2017 films will screen during the first week, followed by the 2019 and 2021 movies during week two. To celebrate the event, a special all-day screening will take place on the final day (Oct. 5) featuring back-to-back showings of all four movies. According to the release, all four films have been remastered in 4K with 5.1 channel surround sound for the event. Tickets for the screenings will go on sale on Aug. 27 at 9 a.m. ET here.\nTrending on Billboard\nIn addition to the screenings, the event will also feature online and offline activities for ARMY, with Trafalgar Releasing CEO Marc Allenby saying in a statement, “We are proud to bring this unique festival event to cinemas worldwide in partnership with HYBE, celebrating BTS’ legendary live performances. The response to previous BTS theatrical releases has been phenomenal, and we believe the anticipation surrounding the group’s return will create unforgettable moments for fans in cinemas across the globe.”\nThe 100-minute 2016 film is described as “the grand finale of [BTS’] ‘The Most Beautiful Moment in Life’ series,” featuring performances of the songs “Autumn Leaves,” “Butterfly,” “FIRE,” ‘Save ME” and “EPILOGUE: Young Forever.”\nThe remastered 105-minute 2017 movie will spotlight performances of “Blood Sweat & Tears,” “DNA” and “MIC Drop.” The 2019 movie finds the group at their world-dominating best at a time when they became the first Korean act to headline London’s Wembley Stadium, while 2021’s MUSTER SOWOOZOO chronicles a “one of a kind ‘FESTA'” uniting the band and ARMY at an open-air performance for their eighth anniversary celebration.\nNow that all the group’s members have completed their mandatory South Korean military service, BTS is gearing up for their full-strength return next year at an as-yet-undisclosed time. In a July 1 livestream the group announced that they will release a new album next spring as the follow-up to their recently released first live album, PERMISSION TO DANCE ON STAGE — LIVE.",
      "author": "Gil Kaufman",
      "published_date": "2025-08-20",
      "word_count": 504,
      "fetch_timestamp": "2025-08-20T09:22:38.238631",
      "metadata": {
        "char_count": 3243,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T09:22:38.238620"
      }
    }
  ],
  "total_articles": 1,
  "total_words": 504,
  "extracted_at": "2025-08-20T09:22:38.238852",
  "urls_processed": [
    "https://www.billboard.com/music/pop/bts-movie-weeks-four-concert-films-4k-across-globe-details-1236047882/"
  ]
}