{
  "artist_name": "Timbaland",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/21403-king-stays-king/",
      "source": "pitchfork",
      "artist_name": "Timbaland",
      "title": "Timbaland: King Stays King",
      "content": "---\ntitle: Timbaland: King Stays King\nauthor: Kris Ex\nurl: https://pitchfork.com/reviews/albums/21403-king-stays-king/\nhostname: pitchfork.com\ndescription: Timbaland's new mixtape King Stays King is a middling effort from the former pioneer of R&B, rap, and pop. Most disappointingly, it shows him as a beatmaker rather than a full producer.\nsitename: Pitchfork\ndate: 2016-01-15\n---\nAt one point, it would have seemed unfathomable that Timbaland would be making a play for relevancy. In the latter part of the '90s, his full-length contributions for Aaliyah, Missy Elliott, and Ginuwine redirected R&B from its increasing reliance on relaxed grooves and hip-hop drums to slick, broken, hi-hat happy rhythms that were playful, sophisticated, and not-infrequently referred to as \"futuristic.\" His work in R&B established him as visionary, and the echoes of his sound are all over today's musical landscape—from Noah \"40\" Shebib's atmospheric moodiness to the worldwide underground of Soulection's beat scene. Timbaland took many cues from UK electronic soul styles, but he also gave them back: it's impossible to listen to dubstep without hearing Ginuwine's \"Pony\" in its DNA; it's hard to imagine the UK grime scene without Missy's Da Real World. Timbaland may not have invented any of these styles but he seemed to predict and inspire them all, down to EDM.\nIf these were his only contributions to music, his new mixtape—King Stays King, released this past Christmas—would make sense. It would be a rehashing of glory days by a once uber-influential musician. But Timbaland's prowess wasn't limited to R&B—he also released major and minor hits for rappers of note and footnote, and ushered pop artists into adulthood while blurring the lines between mature swing and youthful bounce, mainstream and urban. In terms of reach, his only peer of the past 20 years would be maybe Dr. Dre, or Tim's hometown colleague, Pharrell Williams.\nBut in the past few years, as Dre repolished his laurels and Pharrell refined himself into an inescapable pop force, Timbaland languished as a struggling legacy act, releasing respectably selling, but forgettable solo efforts and attempting to create buzz with his Timbaland Thursdays series. None of this is what anyone saw for Timbaland—at best he would still be a major cultural power; at worst a reclusive genius releasing small, but impactful records that ousted music forward. At the least, he should have been Swizz Beatz—caught up with ventures beyond music but returning occasionally to the table, if only to prove that he still has it. But scoring lowbrow fare like \"Empire\" and releasing a middling compilation like King Stays King, was not in the trajectory.\nThere's precious little that's adventurous about this new effort. Blaze Serving's \"Where You At!\" is darkly bubbling, but leans too heavily on Future's \"Fuck Up Some Commas,\" coming off like a local DJ's remix he plays during his set to take a bathroom break. The album's best number comes from Rico Richie, a rapper perhaps best known for getting arrested when the authorities raided Young Thug's studio. On \"Drug Dealer\" Timbaland seems to be aping the Neptunes, alternating between a moderately ominous swing and cavernous drums (an interesting turn, considering Tim's brain-melting work on Pusha T's recent Darkest Before Dawn) but Rico, like many of the rappers here, comes through with mostly generic baller boasts tinged with just a hint of creativity: \"I flew her out to L.A. for the summer/ And she said she love me, even though a nigga used to hit her cousin/ My niggas say I'm trippin', I'm like, 'Fuck it, I don't need a rubber.'\" Even the established stars fail to register above serviceable here. Who wouldn't want to hear the erratic madness of Migos, 2 Chainz' goofy eccentricities, and Young Thug's swallowing and taffy-like yelping on a Timbaland beat? It may be a case of elevated expectations, but all their songs sound relatively straightforward—the raps feeling phoned in, the beats playing catch-up.\nPerhaps the biggest disappointment here is that Timbaland comes off as beatmaker instead of a producer. In an era where producers like Mike WiLL Made-It and Metro Boomin cater their sounds around their artists, adding subtle fluctuations, transitions, and progressions to their music (things Timbaland once did so well), most of the tracks here plod straight ahead. The R&B numbers here don't sound like Timbaland; they sound like the modern day sub-Timbaland impressions that get pushed on your Soundcloud playlist via algorithm. It's all functional, but there isn't a single standout performance here.\nIt can be said that Timbaland hasn't been able to create stars—most of his hits have come courtesy of artists with strong songwriting ability and intrinsic inventiveness. Aside from Missy, Timbaland's most notable collaboration on this front was with Aaliyah—together the two sculptured R&B in their own image. Aaliyah appears here posthumously on \"Shakin\" and she's in classic form. As always, her delivery dances with a light grace, but the song sounds more like a redundant album cut than a lost gem. While it's great to hear some new classic Aaliyah, hearing not-quite classic Timbaland in 2016 only makes him seem dated.",
      "author": "Kris Ex",
      "published_date": "2016-01-15",
      "word_count": 838,
      "fetch_timestamp": "2025-08-20T08:15:32.099957",
      "metadata": {
        "char_count": 5255,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:15:32.099935"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/17899-timbaland-shakin-ft-aaliyah-and-strado/",
      "source": "pitchfork",
      "artist_name": "Timbaland",
      "title": "Timbaland: \"Shakin\" [ft. Aaliyah and Strado]",
      "content": "---\ntitle: Timbaland: \"Shakin\" [ft. Aaliyah and Strado]\nauthor: Eric Torres\nurl: https://pitchfork.com/reviews/tracks/17899-timbaland-shakin-ft-aaliyah-and-strado/\nhostname: pitchfork.com\nsitename: Pitchfork\ndate: 2016-01-07\n---\nUpon her passing in 2001, Aaliyah's legacy as preeminent R&B phenom should have become one of the most untouchable in the genre's history. Of course, that hasn't been the case—contemporary artists have liberally mined her work for new singles in the last few years, from Drake to Chris Brown. It's an understandable impulse, since Aaliyah's brief career paved the way for countless R&B acts both big and small, but there's a fine line between tribute and cashing in. And while Timbaland stands as perhaps the most capable person to honor his onetime protégé, he too has offered some unnecessary, borderline creepy homages himself.-=-=-=-\nConsider \"Shakin,\" off the producer's Christmas-released mixtape King Stays King, a corrective. Using unreleased Aaliyah vocals as the main draw, \"Shakin\" effortlessly bridges the gap between her final album and the current climate of R&B. It's a smooth return to form for Timbo, too. \"Shakin\" veers away from the overindulgent sounds of \"Empire\" and towards a leaner bounce beat, with a breathless verse from South Carolina rapper Strado and a few unmistakable \"yeah baby\"'s sampled from Fetty Wap for good measure. Still, Aaliyah steals the show as always. \"Shakin\" is testament to her enduring ability to surpass eras, sounding as peerless as she did at the start of the millennium.",
      "author": "Eric Torres",
      "published_date": "2016-01-07",
      "word_count": 233,
      "fetch_timestamp": "2025-08-20T08:15:32.130658",
      "metadata": {
        "char_count": 1552,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:15:32.130651"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/10061-shock-value/",
      "source": "pitchfork",
      "artist_name": "Timbaland",
      "title": "Timbaland: Shock Value",
      "content": "---\ntitle: Timbaland: Shock Value\nauthor: Nate Patrin\nurl: https://pitchfork.com/reviews/albums/10061-shock-value/\nhostname: pitchfork.com\ndescription: Timbaland's equivalent of the Neptunes' Clones LP features guest spots from Justin Timberlake (on three tracks), Dr. Dre, 50 Cent, Nelly Furtado, and Missy Elliott. And then there's the rock bands: Fall Out Boy, The Hives, and She Wants Revenge. And then there's Elton John. And Magoo. : /\nsitename: Pitchfork\ndate: 2007-04-02\n---\nWhen it comes down to the big three producer-MCs who have defined club-friendly rap over the past decade-- Diddy, Pharrell and Timbaland-- Tim's the one who's been best able to rein in his self-indulgent tendencies. He hasn't spent more time being a pop icon than a musician, hasn't suffered from any major dry spells of creative entropy and, most importantly, has known enough to let his beats do most of the heavy lifting. This might be one of the reasons he's considered by most trainspotter pop fiends to be more of a genius than those other two; even when Tim runs his mouth, it's typically been innocuously catchy-- even complementary-- enough to keep the production's strengths at the forefront. The other main factor in his genius, as anyone who's had a radio on at any point in the last decade knows, is his ability to integrate unexpected niche-genre sonics most hip hop and R&B producers wouldn't steer towards-- bhangra, jungle, trance-- and use them for a kind of universal club futurism that, since it fits well in damn near every place people dance, makes for an easy route to chart and cultural dominance.\nWhen Tim's shit goes wrong, though, it's harder to get to the root of the problem. His recent bodybuilding obsession, his divisive, grandstanding mini-sets during the Justin Timberlake tour, and his forehead-smack of a beef with Scott Storch (?)(!) have made for great blog-snark gossip fodder, but they don't necessarily signal any kind of creative decline, especially after the juggernaut year he had in '06. But while solo Timbaland's always been a mixed bag, Timbaland Presents Shock Value is more mediocre than it has any right to be, filled with overreaching pretense and phoned-in vacancy-- either trying too hard, or not hard enough.\nAlmost everything potentially great and really wrong about Shock Value is exhibited in leadoff track \"Oh Timbaland\". The beat's built on the same piano hook (from Nina Simone's \"Sinnerman\") that Kanye West pillaged for Talib Kweli's \"Get By\"-- he's just made it more manic, releasing some Dirty South tension with Shaq-hand-sized claps and Catfish Collins chicken-scratch guitar. It's a hell of a way to start things off, even assuming you don't care that a song about a man futilely trying to escape his transgressions is being appropriated so Tim can issue death threats and brag about his private planes. Simone's reconstructed voice is a sinister hook (\"Oh Timbaland, where you gonna run to?\"), and Tim's answer to this haunting, retribution-of-God threat (a quickly tossed-off \"nowhere\"), is a sign of the hubris to follow.",
      "author": "Nate Patrin",
      "published_date": "2007-04-02",
      "word_count": 496,
      "fetch_timestamp": "2025-08-20T08:15:32.168725",
      "metadata": {
        "char_count": 3075,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:15:32.168719"
      }
    },
    {
      "url": "https://pitchfork.com/features/interview/6592-bjork/",
      "source": "pitchfork",
      "artist_name": "Timbaland",
      "title": "Björk",
      "content": "---\ntitle: Björk\nauthor: Brandon Stosuy\nurl: https://pitchfork.com/features/interview/6592-bjork/\nhostname: pitchfork.com\ndescription: We sat down with the Icelandic singer to discuss her new album, Volta, her collaborations with Timbaland, Brian Chippendale, and others, and how he she plans to bring her new sound-- a rhythm-heavy mixture of modernity and primitivism-- to the stage.\nsitename: Pitchfork\ndate: 2007-04-22\ncategories: ['features']\n---\nIn late February, I took the subway into Manhattan to speak with Björk. I'd met her previously, but we'd never sat down and discussed her music. After greetings and well wishes, she told me coffee was the best way for her to power through interviews. True enough, her energy level remained consistent; she was animated throughout the hour-long conversation. At the end, packing to go, I complimented her on the care she'd taken with each response. She looked nervous for a second, mentioned the caffeine, said she was afraid she'd spoken too much, and offered to do follow-ups.\nIt was my second trip to the building in a short time. I'd been there first thing that morning to hear Volta, her excellent sixth album. I'd listened to it twice earlier, and there were still a few hours to kill, so I headed to Brooklyn and stopped by the post office, where I found a copy of Brian Chippendale's book, Ninja. He'd mailed it a month earlier and I'd assumed it'd been lost, but there it was, covered with stamps from different cities, plenty of red ink.\nI mention this because one of Volta's stand-out tracks, \"Dull Flame of Desire\", features Chippendale prominently. It's a lengthy duet between Björk and Antony that revolves around a pile of atmospheric, dramatic horns, and lyrics about eyes, lightning (in dark clouds, shooting against the sky), love. Beneath the rest of the rising action, Chippendale's drums escalate, so that by track's end, when everything else drops out, he becomes a maniacal one-man drum circle.\nI brought up the song and the lost-book-found to Björk: She had a copy herself, was obviously familiar with Chippendale, so it offered a nice chance entryway into the discussion of the various, eclectic collaborators who helped bring her most recent vision to fruition.\nPitchfork: On Medulla voices were the emphasis. Volta includes so many percussive elements-- most noticeably for me, the contributions from Brian Chippendale and Chris Corsano. How'd you come across those two? And how did this focus come about?\nBjörk: It was really different [from] how I usually work. Because at least with Homogenic, Vespertine, and Medulla, if there was a starting point, it was rhythms. I don't know why, maybe because it's the thing that I don't do. It was kind of easiest to start from that point of view. With Homogenic, I would start with a programmer, just to do distorted rock beats. And we did, I think, 100 one-bar things. And by the time I had written enough songs, I would sit down and could just sort of call it: \"OK, for the chorus of this song, like beat 73, and for the verse, no. 2,\" or whatever. For Vespertine, I had just gotten my first laptop, and it was very much about the static universe of the internet, and all the beats clicking and everything whispered. So that would be the starting point. And obviously, Medulla was a vocal album.\nBut with this one, it was different because I knew more emotionally what I wanted. And because I'd done two or three projects in a row that were quite serious, maybe I just needed to get that out of my system or something. So all I wanted to do for this album was just to have fun and do something that was full-bodied and really up.\nI actually did the whole album, and it wasn't until the last two or three months where that was the only jigsaw that hadn't been solved, like the riddle, was the rhythms. We had done a lot of experiments with rhythms but I just threw them all away because every time we did something clever with drum programming beats, it was just too pretentious for this album, it just didn't stick. Everything that stay[ed] was a little nostalgic, going back to 1992 when you had really simple 808 and 909 really lo-fi drum machines not doing anything fancy but really basic-- almost like rave or trance stuff-- and then really, really acoustic drums. So there are a couple of tracks on this album which are actually programs, with many programming hours spent, and you listen to it, and it sounds like kettle drums or something. I said, what I need is an acoustic drummer who sort of has that almost pagan, trance-like wildness, but maybe I just need to kind of let him go nuts and afterwards I can-- because see, I didn't want it to be too free-jazz either.\nMost of my sort of music nerd friends actually live in England, maybe because I used to live there. But with the Warp people, and the sort of electro-- kind of, whatever it's called, intelligent dance music, I don't know what to call it. But anyway, Lightning Bolt went through a few years ago and performed in England [at] All Tomorrow's Parties, and there was this little snippet that I think all my friends sent me. I got sent this same snippet for the past two or three years of Lightning Bolt playing, and so I've watched it so many times, and I never on earth thought that I would work with someone like that. I didn't even imagine it. And in November I was like, \"Wait a minute, I know somebody who could actually push this to a place that I couldn't imagine myself.\" And I contacted Chris Corsano and Brian-- I've never worked like this before-- and asked them to come into the studio.\nChris came to London, and he hadn't heard anything before. But that's sort of how they work, isn't it? They improvise a lot. And they just sat in the studio, came into the room, heard a song once, said \"Okay,\" recorded one take, came back and heard the next song, \"Okay,\" so we did the whole album in one day. And a week later I came back to New York and Brian came down, and we did the same thing. I felt actually a bit nervous, because I'm so loyal in nature, I thought, \"Oh shit,\" they're not going to like-- so I didn't tell them about each other, because I was like, \"Oh, how should I do this?\" Because I didn't know what was going to come out of it once I'd edited it down and decided what to use.\nI was going to send them emails saying, \"Look this worked out great, but there's this other drummer that worked out well for these tracks,\" and I was making it into this big thing in my head, it was hilarious. And then Brian totally dissolved that, because he just walked into the studio and shouts, \"Hey! I'm so happy you worked with my friend Chris! He emailed me all about it, and it's so funny you're working with both of us because we're actually the two sides to the same coin. I play the sort of butch, heavy double bass stuff, and he does the butterfly, fluttery feminine stuff.\" And I'm like, \"Whew, thanks, that's solved then!\" And it was so right, because they did totally different things on every song.\nThe thing that is most untouched as a performance is probably Brian's take on \"Dull Flame of Desire\". That was a weird song, because I had tried to program like 10 different beats on it-- it was a difficult riddle to solve. I had a feeling it should be like a heartbeat feel, so I asked if he could start with nothing and-- because it's a very long song, it's almost eight minutes-- to just gradually make it grow, and in the end just take over the song. And then he just sat down and did it in one take. So I was like, \"Yes!\" It was probably one of the most victorious moments on the album, because we had done all sort of different beats on it, and they were just all sounding rubbish.\nPitchfork: They played that song this morning, and I wrote \"Chippendale\" in my notes because it was obviously him building up to this huge moment. It's amazing how it peaks like that.\nBjörk: To be totally honest, we did noodle with it. You know how on the computer you take that performance and you can force it an octave lower, and have it played not so high volume, which basically makes the whole thing thicker. So you've got the real thing, and then you've got it like-- because they're actually quite small drums he was playing. Not small drums, but when you listen to it it sounds like kettle drums or something. So we did make it really big and fat, but it is his performance, and an unedited take, which is amazing.\nPitchfork: What was it like to work with Timbaland?\nBjörk: Yeah, that was very...very different. Um, to be honest I work so much on my own, which I enjoy very much. 90% of every album is me editing on a computer or writing, walking outside writing melodies, or writing lyrics, or, as in the case of this album, doing brass arrangements, so it's a lot of solitary, which I love. But when it comes to collaborating, I'm really excited about leaving all that behind and just merging with somebody who is hopefully quite different from me.\nIn Timbaland's case-- he sampled my song \"Joga\" like 11 years ago, and said many times in the press that he really liked my song from 14 years ago called \"Venus Is a Boy\". We recorded the string section in Bollywood for that, Indian strings, and he was really fascinated by that, and we've met at parties and there has been mutual admiration for years. [We] sort of talk of doing stuff, but it never happened. And after doing two or three serious projects in a row, I was just like, \"Okay where's the fun?\" And I called him a year ago, and said, \"Let's do something.\" And we always felt, even though we're really different, we have this mutual ground, and it was interesting to go into a studio with a person that you haven't met that often. We did in three hours like seven songs, just totally improvised, nothing prepared. And then what happened afterwards, he went off and did the Justin Timberlake album and I think Nelly Furtado. So he sort of didn't have time to attend the aftermath, really, which turned out to be a blessing, because it meant I could noodle with the results for a year, and edit the fuck out of them, and add musicians like Konono and Chris Corsano and Brian and the other instruments. I think it's actually the first time that he's done that, that he's relaxed with giving his tracks or his material away and letting somebody else complete it. So I would send him stuff and he would say, \"Yeah I love it.\"\nPitchfork: How many songs did his tracks end up on?\nBjörk: Well, there's two tracks, \"Earth Intruders\" and \"Innocence\", which I think are sort of a very 50-50 thing, where even though I added Konono on \"Earth Intruders\" it's still a very Timbaland track. And then there's a third track called \"Hope\", where he sort of did a beat, and I sang on top, and then I took his beat and layered it and chopped it so it's way more chaotic than how he did it, where the bass drum is doing an irregular stereo thing. And then afterward I wrote a bassline and took it to Toumani Diabate who played Kora, African harp, over it, and-- because I didn't write the lyric until later, it's about a pregnant Palestinian suicide bomber-- that song sort of became what it is afterward. So it became, not so much a Björk/Timbaland thing, it sort of took it's own life a little bit.\nPitchfork: Of Timbaland's most recent stuff, do you have any favorites?\nBjörk: It was really weird, because the first time I met him, he was kind of like, \"So what do you wanna do? You wanna do something weird? Or something like a hit?\" And I'm like, \"How can you say that?\" I could never work like that-- sort of decide what it is before you even start. And I was like, \"I'm just curious where you and I meet, where is our natural overlap.\" And he's like, \"Okay, what of my stuff do you love?\" And my favorite is probably Missy Elliott's \"Slide\". It wasn't even a single. You know, like, not the obvious ones. I do love [Justin Timberlake's] \"My Love\". I mean, come on. It's amazing.\nHe wanted to do a sort of \"Cry Me a River\" kind of track, and I have a different luggage, I listen to 80s indie bands. That to me sounds like [singing], \"Take my breath away...\" with respect to that band, but it's a bit 80s snyth hit. I love when he does rave shit, like really roots synthy stuff, and just humor. I think his stuff, especially with Missy Elliott, I think there's a lot of humor there, and also taking the piss out of themselves, which is something that maybe people just don't do much-- all pop musicians just don't do that, it's pretty rare.\nPitchfork: He said somewhere that what he did for you was hip-hop. Do you agree with that?\nBjörk: I'm not going to argue with him, but I don't think so. Come on, I'm from Iceland; I don't do hip-hop. But these guys see differently. There was a documentary done on me many years ago, where there was an interview with Missy Elliott where she said Homogenic is hip-hop. And I'm like, \"Mmmmmm..?\" Do you know what I mean? But I don't care; they can call it whatever they want. Yeah, what can I say? I just know what fuels me, and I think, especially the tracks where it was more of a 50-50 thing, for me I feel very happy with them, they feel very Björk and Timbaland. It's not like me being alien in his universe, or him being alien in my universe, it's mutual ground. So I don't know what that country's called, but it feels pretty healthy.\nPitchfork: There's a lot of marching on the record.\nBjörk: I just wanted to get rhythmic again. Medulla was my way of pulling out of that, refusing to be categorized as 'Oh what rhythm is she going to do next?' Just feeling the pressure of all these young drum programmers or producers or whatever you call them contacting me, like, who was going to be the flavor of the month. It had become this kind of fashion statement, it just wasn't right.\nI mean, I do love one-upmanship sometimes, like when you see kids breakdancing and who can do the best tricks. It's common, it's in our nature as animals, like the birds of paradise who've got the best feathers and that sort of stuff. But it's fun when it's impulsive and it's about fun. When it becomes clever, when it becomes more of a left-brain, who can mathematically out-do the other, it's not so fun anymore. And maybe I just sort of pulled out and did a whole vocal album.\nBut I definitely missed my rhythms. I mean, I love rhythms. I started an all-girl punk band when I was 14 and I was the drummer, not the singer. I'm very, very, very picky when it comes to rhythms. So it was fun to approach it from another angle on this one.\nAnd I'd be lying if I didn't say it was some sort of reaction to the state of the world today. I mean, I went in January over a year ago to Indonesia, to the area where the tsunami hit the worst. Just seeing a village of 300,000 people and 180,000 died, and people were still there digging people out and the smell of corpses and bone. The tsunami kind of scraped houses away, you could still see the floor, and the people I was with found their mom's favorite dress kind of in the mud and it was just like, outrageous.\nI mean, the human race, we are a tribe, let's face it, and let's stop all this religious bullshit. I think everybody, or at least a lot of my friends, are just so exhausted with this whole self-importance of religious people. Just drop it. We're all fucking animals, so let's just make some universal tribal beat. We're pagan. Let's just march.\nPitchfork: So lyrically there's \"vertebrae,\" and as you were saying before \"bones\" and \"marching\", and then \"Earth Intruder\" and some kind of beast...\nBjörk: Well the lyric thing, part of it was having a little daughter and realizing what are we telling girls? And all these books out there about finding your prince, and this whole prince's face, I don't know if you know any girls under eight who just wear all pink--\nPitchfork: Yeah, I have a four-year-old niece.\nBjörk: And all they want to do is be pretty and find their prince, and I'm like, what happened to feminism? So maybe being exhausted with the self-importance of religion, and thinking, \"Okay wait a minute, maybe we are one tribe, and we're actually part of nature, and trying to suggest some kind of patent for that.\" But it's 2007, it's not some hippie shit-- go back to your roots-- it's all march forward. So I was reading a lot of books the past couple of years, especially about things that interest me a lot like neuroscience, about the two hemispheres and that we actually are animal species, and how Christianity forced us to ignore nature and the body. Sort of an updated version, because there's a lot of interesting books being written by my generation of scientists that look at things slightly differently from how I was taught about it. So, lyrically, I was maybe attempting to go back to that sort of pagan earth thing.\nPitchfork: Is there someone you've wanted to collaborate with that you haven't asked to yet, or maybe someone you approached that wasn't into it or something? Anyone you still have on a wish list that you want to do something with?\nBjörk: Yeah, I don't know, obviously if I had 500 years, I could collaborate with a lot of people. But I think another side of me is really loyal and precious about collaboration. I don't think you should even go into it unless you think it's the absolute right thing to do, and that you have equal things to give each other. There has to be sort of a creative justice there. I don't know what it is, it's some sort of law of nature, that it isn't abusive, one way or the other.\nIt's like friendships, you can feel it, if you're giving this person tons and she's not feeling it, it's not literally anything you can measure, but it's an emotion that you really know. And I'm quite superstitious like that. I think you have to respect the altar, go on your knees and be humble. If you're lucky, every year you maybe come across one or two people that you're in that position where you can actually give a lot to each other, and you have to respect that and not control it too much, just let it go where it wants to go. So for me, like I said, I spend 90% of my music making alone, so those times when I do go out and collaborate, I treat it as a precious thing, and you've got to let it go where it wants to go. I worked in very different ways with, say, Antony, or with Timbaland-- it was two very different experiences. So I don't know, I sat down on this album, and I sit down to make a new one in two years or whatever. I don't know who I meet the month before. I kind of like the idea that it's out of my hands, and you probably know this as a writer, but sitting on your own at a computer, that there's so much already in your control that it's nice there's an element that you don't know about.\nPitchfork: What can people expect from the live show?\nBjörk: I guess emotionally it's probably more similar to Homogenic than to Medulla or Vespertine. Homogenic was different-- it was quite an aggressive album, where I'd gone through five years of doing five billion interviews and being stalked. A lot of really happy experiences, too, it wasn't all bad, I don't mean it like that, but I was under a lot of pressure that I had never experienced before, so Homogenic was very much like the sleeve: We were trying to make this person that was under a lot of restraint, like long manicure, neckpiece, headpiece, contact lenses-- still trying to keep the strength. This is a very different thing emotionally; even though it's as extroverted, it's very happy and definitely not restrained-- it's quite free. It's quite a happy thing. And quite secure, in a weird kind of way.\nI mean, I got a 10-piece brass band that I auditioned in Iceland. For some reason I wanted all girls-- maybe because of this sort of exploration into feminism. And Mark Bell is going to do it with me, he went with me on the Homogenic tour, but we've talked a lot about it and it's going to be very different, partly because they've invented so much different software to play live electronic music, you can really introduce the random element and really play with-- I mean, both of us have been looking for and contacting and speaking to a lot of people so we can be really fluid and spontaneous with electronic decisions. And Chris Corsano is coming, that's cool.\nPitchfork: I've seen him play a few different times with different things, and he's really magnetic to watch.\nBjörk: I'm so thrilled they were up for this, and I didn't even imagine that he would want to do that. But most of the electric rhythms are really bass drum, bottom heavy, and Brian being more bottom heavy, I didn't even ask him-- he's got like 57 projects going on anyway, But Chris is lighter, so I thought it would marry better. It's kind of tricky when you have a big band, and there has to be a structure, and it seems like the structure should be the electronic beats, and then you can pile things on top of that. And there's an old friend of mine who is an Icelandic Chinese concert pianist, and I got him a huge pipe organ, so he's going to wear tails and do some very virtuoso dramatic performances in between sets. I think it's going to be a lot of fun, hopefully.\nPitchfork: The artwork again is notable-- would you consider it to be evocative of the content of the album?\nBjörk: Yeah, I did try to go for that. Something that was quite pagan, in the name of, maybe the only time we were sort of quite feminine-- that long leap of 10,000 years back, where they've kind of been in harmony with nature, and just little things like the fact that there are 13 full moons in a year and most women have certain things happening to them, 13 times a year, but Christianity wanted to have 12 months, just to try to put that off. So maybe it's addressing that old saga a little bit. But I also wanted to have some sort of shaman, voodoo thing, to just liberate, to get rid of a lot of tension. But in a happy, celebratory way, not as a destructive thing. It's sort of maybe trying to put out some good vibes for the little princesses out there. There are actually other things than pink jars and losing a glass slipper.",
      "author": "Brandon Stosuy",
      "published_date": "2007-04-22",
      "word_count": 4064,
      "fetch_timestamp": "2025-08-20T08:15:32.307802",
      "metadata": {
        "char_count": 22091,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:15:32.307787"
      }
    },
    {
      "url": "https://pitchfork.com/features/interview/6476-lily-allen/",
      "source": "pitchfork",
      "artist_name": "Timbaland",
      "title": "Lily Allen",
      "content": "---\ntitle: Lily Allen\nauthor: Scott Plagenhoef\nurl: https://pitchfork.com/features/interview/6476-lily-allen/\nhostname: pitchfork.com\ndescription: We talk to the brazen and sharp-witted singer about her quick path to success and why the NME are \"assholes.\nsitename: Pitchfork\ndate: 2006-11-05\ncategories: ['features']\n---\nA number of my friends and colleagues dislike Lily Allen-- and nearly all of those detractors are men. Perhaps it should be expected that a willful, precocious female whose characters have little patience for male sexual inadequacy and who threaten to avenge a broken heart by sleeping with their ex's mates would appeal more to women than men, yet the ease with which many brand the singer a bitch or worse is disconcerting.\nAnd for what? Being a brazen and sharp-witted woman who recorded a breakup album that's breezy, mischievous, and catchy rather than all acoustic-bedded tears and exposed veins? To do the latter would have been both dreadfully boring and sorely out of character for Allen, a savvy 21-year-old Brit whose readymade press stories-- to the UK tabloids she's the \"potty-mouthed, pint-sized pop diva, daughter of actor Keith Allen\"; to the broadsheets, she's the queen of MySpace, having captured a sizable audience after posting her demos on the social-networking site-- and charming debut LP Alright, Still made her an overnight success at home.\nIn the U.S., Allen is merely dipping her toes into the water, having recently played a series of brief, tentative shows in advance of the January 2007 American release of her album. And even here the internet fueled much of her success. Despite a sound that's a hard sell in the U.S. indie community, American mp3 blogs embraced her early and often. Perhaps they considered this MySpace success story to be their spiritual kin, but bloggers happily tracked her every move, posting everything from her 50 Cent-biting song about her grandmother (\"Nan, You're a Window Shopper\") to a pep talk for her weed-smoking baby brother (\"Alfie\") to barbed-tongue attacks on former lovers and catty girls (most of the rest of her tracks).\nAs with 2006's other more divisive artists-- the Hold Steady, Joanna Newsom, the Arctic Monkeys-- the reasons why this singer attracts or repels listeners are often the same. In Allen's case, chief among those are a nonchalance and impudence that make her a quote-worthy, headstrong pop star in an era of mostly PR-molded dullards. True to form, when we met Allen she did little to disguise how exhausted she was and mentioned that she had about 25 minutes to go shopping before our interview. (It was just enough time to hit Starbucks and Walgreen's.) And almost immediately after the interview, she wondered aloud why the Pipettes album got one more point on our rating scale than her own (8.4 to 8.3)-- a question Pitchfork's Mark Pytlik has been asking for months.\nOn paper that might seem bitchy, but it was certainly not. None of it was mean-spirited; all of it was matter-of-fact and refreshingly honest. It was a demonstration of the feistiness/neediness of a young artist who, in her music, aims to seem assured and confident, but is also unafraid of sometimes painful self-awareness and vulnerability; a singer who criticizes the music industry because of her frustration with its many shades of grey but also acknowledges that her own career \"could all be over in six months.\"\nPitchfork: So are you more bored of talking about your dad or talking about MySpace?\nLily Allen: I'm used to it. I'm on autopilot.\nPitchfork: Actually, I would like to talk about MySpace, because there is still confusion and a little suspicion about how you started, that there weren't industry machinations behind it all.\nLily Allen: No, my record company didn't even know what MySpace was. About three weeks after I set it up, my manager called me and he was like, \"I think you ought to set this thing up, it's called MySpace or something,\" and I was like, \"Already done it.\"\nOver the past two years I had been doing demos and I probably had, like, seven or eight that I was confident enough to put on the page for people to hear. I started putting them up in November [2005], two months after I signed. I just kind of swapped them around. When we did \"Nan, You're a Window Shopper\", literally five minutes after we finished, it was on MySpace.\nBy February or March it was obvious that something was going on, because there were so many subscribers to the blog and so many people listening to the music-- the plays were just going up and up and up.\nPitchfork: But the record company wanted to sign you then have you work with someone else's songs?\nLily Allen: I signed to Regal, a division of Polygram for £25,000. It was like nothing-- a really, really small development deal. At that time they were putting out a Kylie album, a Coldplay album, the Gorillaz album had just been released. So, they didn't really care about me [Laughs].\nThey were happy with me-- they signed me-- but at that point my album wasn't meant to come out in England until this coming January [2007]. So, they didn't really have a plan, so to speak. They didn't think that the direction of the demos was quite right. It wasn't that they weren't supportive; they just didn't think it was ready-- because it wasn't.\nThey were trying things out, like putting me with more mainstream producers and top-line writers because they didn't think my melodies were quite there-- it wasn't sonically \"pop sounding\" enough or whatever.\nYou know within a record company they have A&R and marketing and press and whatever. Obviously, A&R knew about me but nobody else in the record company did at that point. And Murray [Chalmers], the head of press, was getting calls from people who were like, \"We want to write about Lily,\" and he was like, \"I don't know what you're talking about.\"\nPitchfork: Yeah, it took us a long time to even have an e-mail answered about you.\nLily Allen: Well, they didn't know who I was. It took like four or five phone calls from The Observer Music Monthly magazine. They were like, \"We're writing an article about MySpace and we want to do a thing on Lily.\" Murray was like, \"OK, this is stupid. Now five people have called about this Lily girl, who the hell is she?\" So he walked down to A&R and was like, \"Have we got someone called Lily Allen on our books?\" And they were like, \"Oh yeah, she's this girl we got a few months ago.\" And that's kind of when it all started, and then three weeks later we got the offer for the [OMM] cover.\nPitchfork: And it wasn't until then that they were comfortable putting your own songs into production?\nLily Allen: Yeah, then they were kind of confident that the songs were okay; that those should go on the album. There were still only seven or eight that I was happy with-- \"LDN\", \"Knock 'Em Out\", \"Smile\", \"[Nan, You're a] Window Shopper\", and a few others.\nAt that time my concentration was really bad because I was interested in going home and reading about how much people love me on MySpace, and I wasn't even thinking about writing any new songs [Laughs]. I'd read all the messages, \"Oh you love me great great!\" I was getting very excited about that, and I suddenly got writer's block. It was a really bad time for it to happen-- everyone was getting excited on the back of the MySpace and the album wasn't finished. So I decided to come to America and work with [producer] Greg Kurstin, as well as Mark Ronson, who was a friend and asked me to come over to New York. I finished the second half of the album in, like, two weeks.\nPitchfork: When the record company execs tried to match you up with more mainstream producers, did they have any specific sounds or specific people that they wanted you to work with?\nLily Allen: You know what A&R people are like-- hmm, Cathy Dennis, Johnny Douglas.\nAnd I tried it! I'm not going to say I was always adamant. I didn't know that my stuff was good enough. I'm not like an über-confident person who thinks she's amazing. If the people from the record company were telling me it's not good enough and I should be working with these people, I was like, \"OK, cool, whatever,\" but it always sounded very contrived. I can't sit there and sing, \"Ooh baby, you make me crazy, Can I be your lady, baby.\" It doesn't work [Laughs].\nPitchfork: But was there a sense of urgency to turn the record around? You were already getting press and had nothing in the shops. Like, the Lady Sovereign record-- is that even out in England? It's finally about to come out here. It's taken two years.\nLily Allen: I don't even think anyone cares [in England].\nPitchfork: Her internet rise wasn't as strong or as quick as yours, but it sort of parallels.\nLily Allen: She actually told me about MySpace. I met her in a bar, and she asked, \"Have you heard about MySpace?\"\nWe knew that we had to put out the limited release of \"LDN\". You can't really have all that press and not have the little tagline on the end that says, \"'LDN' by Lily Allen, out on this date\". So we did the [500-count] limited edition [7\"] just to have something that people could talk about and hold. And then there were the mixtapes that were around. I'm going to do another one in the next couple of weeks.\nPitchfork: Are you going to be including some of your own new tracks?\nLily Allen: I haven't really had time to get into the studio, so there's definitely no new material.\nPitchfork: Was there a specific inspiration for doing the mixtapes? The idea certainly worked for M.I.A.\nLily Allen: Well, the MySpace thing was going so well, and I wanted to create more interest so I got Polygram to pay for it, to do like 200 of them. Also, it was something for me to do because my writing wasn't happening. Every night I'd spray all the covers, and they were individually numbered. And it was free. I hand wrote everyone's addresses on the front and put them in the post and that kind of got people talking. And it was really good, because that was the time when they were trying to put me in with producers, and I'm not very good at articulating what I want with music, so it was really helpful to have the mixtape and say, \"OK, this is the kind of music I like, these are my influences, so let's try to build off some of these things.\"\nPitchfork: You opened up a lot on your MySpace blog-- much more than most artists would.\nLily Allen: It just seemed natural. I don't do many [entries] now because I would just be writing a response to something someone else wrote about me.\nIt definitely became annoying when I would write something and it would end up in the tabloids the next day, completely twisted around. It's like, fuck off [Laughs].\nPitchfork: But you grew up around fame. Did you not expect those things would happen?\nLily Allen: I've been around famous people, but I don't think about them that way. Joe Strummer was my father's best friend but I knew him as Uncle Joe, carrying a bottle of whiskey around. The famous people that I have been around were all really relaxed, not the Ozzy Osbourne types, driving around in limos.\nPitchfork: Do you think that prevented you from putting up a PR wall?\nLily Allen: I didn't need to do that because I'm not in this to be a famous celebrity. If I were, then I would be going to film premieres and standing around in couture dresses and posing for pictures. I have the connections with which I could have achieved a lucrative a pop career by doing nothing, do y'know what I mean? I could have said to my dad, talk to your friend to get me a deal and I'll go to the gym everyday, maybe get a boob job, and sing whatever songs people want me to sing, but that's not what interests me.\nI get annoyed that people are so narrow-minded. In England, when you become a celebrity your name is automatically followed by the way in which you're typecast. I'm always, \"Lily Allen, potty-mouthed, pint-sized pop diva, daughter of Keith.\" It's difficult to backtrack out of that typecast-- and it's wrong. I'm not just someone who goes around being mean about people. I just have an opinion.\nPeople think I say things in order to get into the papers, but my life would be so much easier if they didn't write anything. But at the same time if Carl Barat [Dirty Pretty Things, ex-Libertines] is being a cunt backstage at a TV program, why shouldn't I say something?\nPitchfork: Did you change your mind about the Kooks? You badmouthed them, but later covered one of their songs.\nLily Allen: I like them and I like their music to a certain…yeah. I've known [singer] Luke [Pritchard] since I was 13 years old, and it's just really funny to me to see someone become such a victim-- wearing tight jeans, cowboy hats, sunglasses. But I like their songs. I think they're catchy. I like Keane too, and I know their songs aren't that aesthetically cool, but maybe that's what is great about them-- they don't feel the need to fuck models.\nPitchfork: Tom Chaplin did end up in rehab though.\nLily Allen: Yeah, so that's one point [Laughs].\nPitchfork: It seems like a lot of these newer bands are just looking back and copying what older bands were doing in the past. There's no imagination. They're like little kids raiding their parents' closet and playing dress-up.\nLily Allen: Until recently you had shit bands like S Club 7 that all dressed up the same and danced around and had the same message. They all had shiny white Ts and straightened hair, and that is kind of what is happening with indie music. It's the same audience that is buying the stuff...like young girls.\nPitchfork: In many cases, it's probably the exact same girls. The girls who were buying Steps records in 1998 are probably buying Kooks records now.\nLily Allen: Yeah, exactly. I just don't think so much of that kind of music should be covered.\nOne of the really, really happy moments was when the NME wanted me to do the cover. I never thought that would happen at that point in my career. Then when I did the interview and it actually came out, I was so disappointed that they had sold me down the river and been such assholes. It made me completely disbelieve anything they ever write.\nPitchfork: What exactly happened?\nLily Allen: I was having a long conversation with them about drugs in the music industry, and the next question after that was, \"How are you going to celebrate your No. 1 [single] this weekend?\" And I went, \"Oh, gak!\" as a joke, because we just had this whole talk about drugs. They didn't print the previous part of the conversation, just the last line where I said I celebrated by taking coke. And then the PR person for their magazine called the tabloids and sold them the story.\nAnd it really upset me, because I thought if there was one magazine that could take me seriously as a female artist and be responsible about it…I mean, I read articles every week about boys in bands talking about actually consuming drugs themselves and nothing is said. I make a joke about it, and they fucking sell it to the tabloids. Anything to get the magazine some press. And that's really sad.\nPitchfork: Do you think that the \"potty-mouthed, pint-sized\" thing, that you get that treatment because you're a woman?\nLily Allen: Yeah, if a guy says something bad about another artist it's like a bravado thing to start beef. But if a girl does it then it's considered, like, bitchy and catty. Which isn't true. Everything I say is constructive and for a reason. I don't just slag someone off for the sake of it.\nThe other thing about this industry and the film industry is that I've seen young people come in and out, fuck up their lives, become heroin addicts. So when Luke takes himself so seriously, I say, \"Come on, you look ridiculous. This could all be over in a year-and-half, so just enjoy it.\"\nPitchfork: So you think you're better equipped to deal with fame because you've seen its pitfalls?\nLily Allen: I'm just very realistic about it all. I'm really happy to be here. I'm fucking exhausted, but I think a lot of people in this industry really grin and bear it, and are like, [Valley Girl accent], \"Ohmigod, it's so great to be here. Thank you so much.\"\nBut, yeah, I'm really happy that people are buying my record, and that I'm able to play shows for those who appreciate what I'm doing. But I know those people may move onto something else in a year's time, and I might not write a very good second album. It happens to a lot of artists. [Laughs]. The thing to do is not take yourself so seriously. The moment when you sort of start to believe all that stuff is when you get in trouble.\nPitchfork: Do you think your assertiveness-- and it's in your music, as well-- do you think being a young woman that people assume that you're a bitch? Would that even bother you?\nLily Allen: To a certain extent everyone expects women-- especially in this industry-- to sit and look pretty and do what they're told. Like the Tommy Mottolas of the world. There are a lot of women that come into this industry who are so scared of losing what they have that they just sort of sit up straight. Why are they so afraid? I built all of this from the very beginning, and it could all be over in six months. But that doesn't mean I can't start something else up and make that work just as well. There's so much out there for me to-- I'm 21 years old [Laughs]. There's no way I'll be traveling the world and singing to people in 10 years' time.\nPitchfork: If it ends in six months what would you do?\nLily Allen: Well, it'd have to happen for me to think about it. Before I was doing this, I was a florist, getting up at four in the morning and arranging flowers. I really enjoyed that, but now I couldn't be a worker. I'd have to be the boss.\nI'd like to work for a record company doing A&R or something. It's such a bunch of fucking idiots doing that job, who know absolutely nothing about music. There are so many clueless people, but there are laws in place that won't allow you to fire someone for not being good at their job. People have to have done something wrong to get fired, so you've got all these fucking idiots walking around with high salaries who have no idea what they're doing.\nPitchfork: If you were in A&R, who would you sign?\nLily Allen: Cajun Dance Party, they're little kids off of MySpace. They're really interesting. I would sign the Klaxons as well. What do you think of them?\nPitchfork: I like them, yeah. I like both of the singles quite a lot, and the cover of \"The Bouncer\" works as well.\nLily Allen: I actually sang \"Atlantis to Interzone\" with them at Bestival. I was so drunk. I think they're a great band. It certainly feels like something really special is happening with them. I'm a bit jealous of them because people go absolutely insane at their concerts. Maybe my next album should be new wave/rave.\nPitchfork: You could have gotten clearance for [Origin Unknown's] \"Valley of the Shadows\" and inserted that into the official release of \"Cheryl Tweedy\"-- released the mixtape version.\nLily Allen: Well, I wanted \"Cheryl Tweedy\" and \"Absolutely Nothing\" to be on the album instead of \"Take What You Take\", because I fucking hate that song more than anything in the world. It was the one thing the record company…they said the Robbie Williams market would like it.\nPitchfork: Well, the Robbie Williams market is, like, half of England. Actually, I guess that's not true anymore. What did they mean by that-- guys?\nLily Allen: I don't even know. Like, middle-of-the-road record buyers?\nPitchfork: Because it's a little more guitar-centric than, say, Jamaican music or calypso, which is apparently hard to sell in the minds of the industry folk.\nWere they scared of having \"Cheryl Tweedy\" on the record because they didn't want a song about Cheryl Tweedy? Well, it's not really about her-- it's about you-- but one that mentions her.\nLily Allen: I don't think they thought it was good enough. Or that it didn't fit in with the rest of the album, but then I don't know why they'd think \"Take What You Take\" does.\nIt was very rushed at that point. On the last day, when we were putting the tracklist together, there were three songs that were fighting to get on the record: \"Absolutely Nothing\", \"Cheryl Tweedy\", and \"Take What You Take\". You gotta pick your battles…[Laughs]. [The U.S. version of Alright, Still will feature all three songs-- Ed.]\nBut now that I know who [the label] people are, and how much they know about what they're doing, I definitely wouldn't listen to them. I don't mean to blow my own trumpet, but basically everything that has happened with this record I've done on my own. You know, A&R'ed it on my own, chose all of the artwork, chose the right TV appearances to do, interviews to do.\nPitchfork: Now that you're more successful, do you think the label will take more interest and demand more control?\nLily Allen: I don't know. I made the album for £25,000 pounds and recouped that in a week-and-a-half. I'm in a position of power with them. I don't owe them anything, so… yeah they'll listen to me. Unless I'm like, working with Timbaland and Burt Bacharach.\nPitchfork: You couldn't even get Timbaland for £25,000.\nLily Allen: And he'd only give me two days. I couldn't work under that pressure, with all that money involved. With this next record, what I've figured out is that I'm much better writing away from home. I wrote half the record while I was in America. I'd like to hire a house in Jamaica or the South of France and build a studio in it, and ship out people. I would like to go in a different direction with the next record.\nPitchfork: On something like \"Knock 'Em Out\"-- something even that innocuous-- you start by asserting that this track could be about anyone, that it isn't necessarily about yourself. Do you feel that you have to take pains to assure listeners that your music can connect to a wide range of people because you've had a different background than most of your listeners?\nLily Allen: I'm not writing all of these songs as if they were from my perspective, and those are the things I'm experiencing. But at the same time, my mother came to London when she was 17 years old with one daughter and a suitcase and nothing else-- no money, no education. She was a punk. And, we didn't have any money for the first 10 years of my life. We lived in what you call the projects, and we ate beans on toast. My mom came from that background, but she just worked really hard to feed us and keep a roof over our head, and that probably keeps my eyes open.\nBut people don't see that because now my mom is a film producer and my dad is an actor. At they think it must be really easy-- \"she was really rich\"-- and that's not true. My dad left home when I was four. I didn't speak to him really until I was 15. So, I feel that I can talk about things with some conviction because I have experienced them to some extent. But it doesn't mean that I'm saying, \"This is my life.\" I don't live in a council flat, but I live in London, which is an incredibly cosmopolitan city. I see a variety of people and things just riding through it.\nPitchfork: Well, it's the same thing in America. It's no coincidence that, on the whole, those who live in cities have a more collectivist and compassionate approach to government and other people-- they interact with a wider range of individuals, and are more likely to have shared experiences that cut across class and racial lines.\nLily Allen: It's something that I find really revolting about our society. I think the more class-obsessed you become, the more that lower-class people accept their \"place\" and give up hope of something better. That is really sad, and that's the whole trick-- keep them down, it keeps us richer.\nPitchfork: What does your family think about being subjects of your songs-- your grandmother, your brother?\nLily Allen: My grandmother still doesn't know.\nPitchfork: She has no idea? Nobody's told her?\nLily Allen: No, it's not on the album, she doesn't know how to work the internet, and it's not really widely reported.\nPitchfork: Nobody tried to ask her for a comment or anything?\nLily Allen: No, none of that. When I wrote \"Alfie\", nobody really knew who I was. At first he was really upset about it, because he thought that I was just pointing out all of his bad points and attacking him. I thought it was really flattering [Laughs]. I thought he'd be really, really happy because it proved to him how much I loved him, that I care about him, and I want him to do something with his life. I suppose his paranoia-- induced by smoking so much weed-- made him think, \"Why are you trying to be mean?\"\nPitchfork: Did it work?\nLily Allen: Yeah, he's doing really well-- he's just done a film with Keira Knightley called Atonement.\nPitchfork: What about your ex-boyfriend?\nLily Allen: I don't give a shit about him. He sold his story about me to the Sunday Mirror-- like, sex and all, for £20,000. And now he's living in a nice Brownstone in Williamsburg. It really annoyed me, actually, because he sold his story for an hour-and-a-half of talking. He got about as much as I signed a record deal for, and it took me three-and-a-half years to make that album. It angered me so much. I put in all that work, and he broke my heart and fucked me over, and now he and his girlfriend are living in New York off of my fame and success.",
      "author": "Scott Plagenhoef",
      "published_date": "2006-11-05",
      "word_count": 4552,
      "fetch_timestamp": "2025-08-20T08:15:32.349925",
      "metadata": {
        "char_count": 25301,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:15:32.349917"
      }
    },
    {
      "url": "https://pitchfork.com/features/interview/6277-bubba-sparxxx/",
      "source": "pitchfork",
      "artist_name": "Timbaland",
      "title": "Bubba Sparxxx",
      "content": "---\ntitle: Bubba Sparxxx\nauthor: Tom Breihan\nurl: https://pitchfork.com/features/interview/6277-bubba-sparxxx/\nhostname: pitchfork.com\ndescription: In 2001, Bubba Sparxxx introduced himself to the world with \"Ugly\", a Timbaland-produced club anthem; the image of Bubba riding ...\nsitename: Pitchfork\ndate: 2006-03-04\ncategories: ['features']\n---\nIn 2001, Bubba Sparxxx introduced himself to the world with \"Ugly\", a Timbaland-produced club anthem; the image of Bubba riding a pig in the song's video probably still haunts him to this day. Two years later, he released Deliverance, a complete career 180 if ever there was one. Combining rap with country and Southern rock organically, with no trace of novelty, Sparxxx and Timbaland crafted an unprecedented and wrenchingly personal work, which of course sold damn near nothing. Since then, Bubba has left Timbaland's Beat Club Records and joined Purple Ribbon, the new label run by Outkast's Big Boi, where he'll release The Charm, his third album, in April. Pitchfork spoke with Bubba about Deliverance, snap music, and his dad's health plan.\nPitchfork: How did you end up moving from Beat Club to Purple Ribbon?\nBubba Spraxxx: There were no personal problems between me and [Timbaland]. Tim had a vision of Beat Club; he wanted to try all these exciting and progressive things. He wanted to sign rock bands. Interscope Records had a different vision of Beat Club. They wanted it to stay more urban-leaning. So when tension arose between those two parties, my relationship with Beat Club in a business sense was through Interscope Records, [and] Beat Club wasn't going to stay on Interscope, so at the end of the day it was just best for everybody to go their separate ways.\nWhen I saw the handwriting on the wall of what was going down with Interscope and Beat Club, I just brought it to Big Boi. I've been cool with Big and been a part of the Dungeon Family for like five years, so we'd had a good relationship. I saw him overseas in London, and he was a fan of Deliverance. He was asking me what I felt my situation was going to be like. I told him, and he was like, \"Check this out; I'm getting ready to crank up the new movement, Purple Ribbon. Dre's going to be doing some acting. He wants me to run the label myself; he's going to leave the label to me. I'd love to have you crank up the movement with me.\" So it took me a little time to put everything together, but we put it together.\nPitchfork: So you didn't get tied up with any contract disputes or anything?\nSparxxx: Not really. At the end of the day, Interscope really put it on me. If I had really wanted to stay there, I could have. But it was just like a bank robbery, man; you know how that goes. Everyone kinda went their separate ways.\nPitchfork: Are you going to keep working with Timbaland?\nSparxxx: Yeah, he did production on the new album.\nPitchfork: The new album is supposed to be out April 4-- is it all set?\nSparxxx: Yeah, it's all set. The first single, \"Ms. New Booty\", is me with the Ying Yang Twins. It's a top 10 record in the country at radio right now. We're rocking and rolling, man. I'm excited.\nPitchfork: I wanted to ask you about Deliverance. That's an album that didn't get much play when it first came out, but it's sort of developed this cult following over the past couple of years.\nSparxxx: Critics really liked it, but I think commercially it just fell through the cracks. Rock people said it was too rap, rap people said it was too rock. You know how people have the need to put things in categories, so I think that was what hurt it. It was a different sound, and people couldn't put a finger on it, so you know how that goes.\nPitchfork: Do you have any regrets about that?\nSparxxx: If I have a regret, it's that to a degree I alienated people who supported my initial movement with \"Ugly\". I'm the kind of guy who enjoys going to the club, and with Deliverance I didn't really do anything for the club. In retrospect, I would've made the exact same album but done a little something more for the clubs because that's what I came in the game on. And that's why I came back with a record like \"Ms. New Booty\". It's me and the Ying Yang Twins, and it's definitely along the lines of \"Ugly\" more than Deliverance, but the album has some Deliverance-feeling stuff on it.\nPitchfork: Like what kind of stuff?\nI got a record called \"Runaway\" that's featuring Frankie J. It's got a guitar riff in it. It's a story about a young girl and a young boy that run away from a small town, and the guy was under the impression that the girl had an abortion, and halfway through the process of the song, through the trip, the girl admits to him that she didn't in fact have the abortion. They're halfway across the country, and the guy realizes that, so there's really three of them traveling.\nI got another song called \"Ain't Life Grand\" that's introspective, real similar subject matter to a lot of things I did on Deliverance. Sonically, the musical backdrop that we were able to create, that was just a moment, and I really couldn't compare [it to] anything on this album. We used plenty of live instruments, guitars and stuff, but it's not as twangy. But subject matter-wise, there's a lot of stuff similar to Deliverance.\nPitchfork: Do you think that Deliverance might've done differently if it was marketed to different audiences?\nSparxxx: Yeah, I think so. That's part of the problem. I don't think anyone knew what to do with it. You really couldn't promote that like a traditional rap album, but at the same time you couldn't jump ship and say, \"Oh, this is a rock album\" because it was still rooted in hip-hop. It was just confusing, man. Sometimes music just won't fold up nicely and fit in a suitcase. These days, as far as trying to have commercial success, if people can't categorize what you're doing, I don't know, it's like people get scared.\nPitchfork: Do you think \"Ugly\" put you in a box like that?\nI think \"Ugly\" fit into a category. It was an up-tempo club record. That goes back to what I was saying; I think I alienated that movement with Deliverance. I built a lot of momentum and a foundation with \"Ugly\". I liked the direction I went in with Deliverance, but I wish I'd acknowledged a little bit more the work I had done up to that point. I started off in one direction and then completely went in another direction. I feel like both of my first records had two completely different sounds, and they attracted two different audiences. That's the charm of the new record; what I tried to do is bring those two audiences together.\nPitchfork: On the Petey Pablo album, you said your dad was still driving a school bus. Is he still doing that now?\nSparxxx: Yup, that's a fact. He's been driving a school bus for 30 years. He really does it for the health benefits, not so much for the money. They got a great, great health insurance package.\nPitchfork: You're from LaGrange, Georgia, but you live in Atlanta now, right?\nSparxxx: Yeah, Atlanta.\nPitchfork: How do you feel about snap music?\nSparxxx: I love it, man. Why I'm so proud of Atlanta is the hip-hop scene finds ways to reinvent itself. Hip-hop is all about the youth. You take what happened initially, 10 or 12 years ago with OutKast. And then you take the crunk movement of the late 90s, early 2000s. And now you got this movement. I don't think any city can claim to have evolved as much and reinvented itself as much as Atlanta has. I'm proud of that.\nPitchfork: There's been some rumors lately about Killer Mike going to Bad Boy. Do you know anything about that?\nSparxxx: I'm not sure what Killer's going to do. He's working on it; he's trying to figure out what he's going to do. Dude, I'm trying to tell him to sign with Virgin Records; I think Virgin Records would be a great place for him. But I've heard Bad Boy, I've heard Def Jam, so I don't know; we'll just have to wait and see.",
      "author": "Tom Breihan",
      "published_date": "2006-03-04",
      "word_count": 1425,
      "fetch_timestamp": "2025-08-20T08:15:32.373391",
      "metadata": {
        "char_count": 7905,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:15:32.373384"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "Timbaland",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-20\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nRap\nStar Line\nChance the Rapper\nBy\nAlphonse Pierre\nAugust 20, 2025\nRock\nLove Is Like\nMaroon 5\nBy\nLinnie Greene\nAugust 20, 2025\nExperimental\nKhadim\nMark Ernestus’ Ndagga Rhythm Force\nBy\nRae-Aila Crumble\nAugust 20, 2025\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-20",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-20T08:15:32.890806",
      "metadata": {
        "char_count": 7698,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:15:32.890791"
      }
    },
    {
      "url": "https://pitchfork.com/features/podcast/",
      "source": "pitchfork",
      "artist_name": "Timbaland",
      "title": "The Pitchfork Review: All of the Latest Episodes",
      "content": "---\ntitle: The Pitchfork Review: All of the Latest Episodes\nauthor: Condé Nast\nurl: https://pitchfork.com/podcast/the-pitchfork-review/\nhostname: pitchfork.com\ndescription: Listen to every episode of Pitchfork’s podcast for music fans and obsessives.\nsitename: Pitchfork\ndate: 2024-01-11\ntags: ['web']\n---\nBrought to you by the music critics at Pitchfork, The Pitchfork Review is a show for music fans and obsessives who can’t wait to talk about the latest releases. Co-hosted by Pitchfork editor-in-chief Puja Patel and Reviews Editor Jeremy D. Larson, this podcast pulls back the curtain on our reviews and scores, dives deep into new music, and gives an expert guide to what’s exciting, what’s great, and what’s just plain terrible.\nListen to every episode of Pitchfork’s podcast for music fans and obsessives.\nRelated Articles\nThe Origins and Influence of Brian Eno’s Pioneering Album Ambient 1: Music for Airports\nIn the latest episode of Pitchfork’s podcast, our critics revisit the legendary producer’s classic 1978 LP, which was recently featured in our Sunday Review series.\nBy Pitchfork\nJeff Tweedy on Rock Criticism, the Pitfalls of Music Snobbery, and His New Book\nThe musician and author discusses World Within a Song, in which he writes about 50 songs that rearranged his brain, Wilco’s new album, and more.\nBy Pitchfork\nThe 2023 Music Grab Bag: Trends, Scandals, and Theories\nIn this episode of the Pitchfork Review podcast, our critics talk about the rise of the musical theater girlie, the fall of the 1975’s Matty Healy, and more. Plus: Alvvays’ Molly Rankin reveals the song she wishes she wrote.\nBy Pitchfork\nThe Best, Worst, and Most Surprising Albums of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about some of their faves from our 50 Best Albums of 2023 list and lament a few of the year’s biggest disappointments.\nBy Pitchfork\nWhy the Replacements’ Tim Is the Best Reissue of 2023\nIn this episode of The Pitchfork Review podcast, our critics talk about the revelatory new version of the beloved rock band’s 1985 LP. Plus, Replacements bassist Tommy Stinson reveals his perfect-10 album.\nBy Pitchfork\nBreaking Down Bad Bunny’s New Album and the Future of Puerto Rican Rap and Reggaeton\nIn this episode of The Pitchfork Review podcast, our critics dissect Bad Bunny’s latest and highlight a few new queer artists from Puerto Rico who are taking the island’s music to exciting new places.\nBy Pitchfork\nDebating the Best Songs of 2023, Part Two\nIn this episode of the Pitchfork Review podcast, our critics battle it out over some of their favorite songs of the year, by artists including Troye Sivan, Kendrick Lamar, Big Thief and more. Plus: Devendra Banhart tells us all about his dream collaboration.\nBy Pitchfork\nDebating the Best Songs of 2023, Part One\nIn this episode of the Pitchfork Review podcast, our critics take sides and discuss which tracks by some of 2023’s most exciting artists deserve a spot on our upcoming year-end lists.\nBy Pitchfork\nThe Good, the Bad, and the Swiftie of Taylor’s Eras Tour Concert Film\nIn this episode of The Pitchfork Review podcast, our critics wade through the ups and downs of the pop superstar’s new record-breaking live movie.\nBy Pitchfork\nWhat Drake Is Doing Wrong—and How He Can Fix It\nIn this episode of the Pitchfork Review podcast, our critics talk about what made them care about Drake in the first place, why his new album For All the Dogs is so frustratingly mid, and what he should do next.\nBy Pitchfork",
      "author": "Condé Nast",
      "published_date": "2024-01-11",
      "word_count": 579,
      "fetch_timestamp": "2025-08-20T08:15:32.945641",
      "metadata": {
        "char_count": 3506,
        "extraction_method": "trafilatura",
        "content_type": "feature",
        "extracted_at": "2025-08-20T08:15:32.945627"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/s4u-heart-2-say/",
      "source": "pitchfork",
      "artist_name": "Timbaland",
      "title": "S4U: Heart 2 Say",
      "content": "---\ntitle: S4U: Heart 2 Say\nauthor: Dean Van Nguyen\nurl: https://pitchfork.com/reviews/albums/s4u-heart-2-say/\nhostname: pitchfork.com\ndescription: Singer Rosita Bonita and producer Prinz George prove R&B can still be crazy, sexy, cool on a mixtape that favors the uptempo ’90s grooves of Timbaland, New Edition, and especially TLC.\nsitename: Pitchfork\ndate: 2018-07-16\n---\nYou’ve got to hand it to S4U. Plenty of modern artists have found 1990s R&B a tempting narcotic, but it takes supreme self-confidence to try on Aaliyah’s baggy pants and Montell Jordan’s snakeskin jackets. While fellow revivalists Jessie Ware, Wet, and Jacquees have drawn from the era’s urbane, romantic sounds, the London duo favors its more uptempo grooves. The small body of work cut by singer Rosita Bonita and producer Prinz George—2016 EP Brazil, plus a handful of loosies—has offered a smart, streetwise hybrid of Babygirl’s and Timbaland’s cyborg sensibilities, New Edition’s new jack swingin’ pop-soul credibility, and, in particular, TLC’s slamming rhythms and swaggering flippancy.\nFor strong evidence of the latter connection, observe how the smooth programmed horn section of the 2016 single “Twice” summons the spirit of TLC’s evergreen “Creep,” or how Brazil’s “Sket” plays like an East London-set remake of “No Scrubs.” With T-Boz, Left Eye, and Chilli as their spiritual guides, S4U add a thick layer of hazy atmospherics and spiky drum machines to their sonic purée, reinventing these old-fashioned grooves for the future while keeping things distinctly of the British capital. And they’ve done so with a certain low-budget aesthetic, keeping all production in-house and releasing a set of self-directed videos that play like the most visually popping Sweded versions of old Adidas commercials ever. As that great prophet DJay, from Hustle & Flow, once said: “It’s not enough for a man to climb Mount Everest. You know, he gotta do that shit with the least amount of tools.”\nHeart 2 Say, the pair’s first attempt at a full-length release, is pitched as a mixtape—and it feels like one in the most modern sense of the term. Though made up entirely of original music, there’s a brevity to the tape as a whole. A dozen or so rising local artists wander in and out of each track, adding slam poetry recitals and heavily accented rap verses to the mix. Songs like “Refrain” sound less structured than previous singles, with Bonita’s voice deployed as textured tones to wrap around the glittering keys and tough drum machines. The singer tests herself on “Untitled,” playing around with a more barbed trap vocal style than she’s previously adopted, while “Alone” is an unlikely rave-inspired number tacked on to the back end of Heart 2 Say, probably because the pair didn’t know what else to do with it.",
      "author": "Dean Van Nguyen",
      "published_date": "2018-07-16",
      "word_count": 449,
      "fetch_timestamp": "2025-08-20T08:15:32.979639",
      "metadata": {
        "char_count": 2790,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:15:32.979630"
      }
    }
  ],
  "total_articles": 9,
  "total_words": 13955,
  "extracted_at": "2025-08-20T08:15:32.980117",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/21403-king-stays-king/",
    "https://pitchfork.com/reviews/tracks/17899-timbaland-shakin-ft-aaliyah-and-strado/",
    "https://pitchfork.com/reviews/albums/10061-shock-value/",
    "https://pitchfork.com/features/interview/6592-bjork/",
    "https://pitchfork.com/features/interview/6476-lily-allen/",
    "https://pitchfork.com/features/interview/6277-bubba-sparxxx/",
    "https://pitchfork.com/reviews/albums/",
    "https://pitchfork.com/features/podcast/",
    "https://pitchfork.com/reviews/albums/s4u-heart-2-say/"
  ]
}