{
  "artist_name": "KISS",
  "source": "pitchfork",
  "articles": [
    {
      "url": "https://pitchfork.com/reviews/albums/onlyheaven-kiss-keep-it-short-and-sweet-ep/",
      "source": "pitchfork",
      "artist_name": "KISS",
      "title": "OnlyHeaven: KISS (Keep It Short & Sweet) EP",
      "content": "---\ntitle: OnlyHeaven: KISS (Keep It Short & Sweet) EP\nauthor: Alphonse Pierre\nurl: https://pitchfork.com/reviews/albums/onlyheaven-kiss-keep-it-short-and-sweet-ep/\nhostname: pitchfork.com\ndescription: Read Alphonse Pierre’s review of the album.\nsitename: Pitchfork\ndate: 2025-02-18\n---\nEver since Black evacuees of Hurricane Katrina carried New Orleans bounce to major cities of the South, traces of the dance-rap genre have infused popular music. But nothing gets the party crackin’ like the jittery soul of the real thing. After Katrina, OnlyHeaven’s family was split between New Orleans and Atlanta, but she stayed in her hometown with her dad, soaking up the energetic call-and-response chants of Katey Red and the rawness of Magnolia Shorty. Her pops was close with her older cousin Hot Boy Ronald, who dropped the local hit “Walk Like Ronald”—which sounds like the “Cha Cha Slide” if it got the Mannie Fresh touch—in the early 2000s. “Walk Like Ronald” integrated the “Triggerman” beat, a nickname for the flickering instrumental of ’80s Queens hip-hop group the Showboys’ “Drag Rap,” which is sometimes argued to have kicked off bounce when MC T. Tucker and DJ Irv chopped it up on 1991’s “Where Dey At.” That same signature sample opens up Heaven’s EP KISS (Keep It Short & Sweet), five screwball romantic comedy bounce joints made for the loudest sound systems.\nLast year, the outrageously catchy “2 Shots” shotputted Heaven onto my radar. I was stuck on how it merged the dancefloor MCing of bounce pioneers with the raunchy storytelling favored by the current generation, and also the wicked flip of Michael Jackson’s “Man in the Mirror” vocals. A copyright strike forced her to remove that sample, a buzzkill because part of the spirit of bounce is in the way producers choose to let samples breathe or dice them up, endlessly reinterpreting older songs. Heaven and her producers don’t let that get them down on KISS, threading in samples across genres and using her imperfect, rasping bulldozer of a voice to sauce up throwback melodies. On “Never Hard,” big-time bounce producer Slash rolls an immediately familiar pop-punk guitar into scratches and twitchy drums, and Heaven is hollering a twist on a pop hook of the recent past: “Me and my hoes take niggas together, through the storm/No matter the weather, cold or warm.” It’s wild, though disconnected from the romanticism of the four other songs on KISS.\nIn a genre that revolves around singles, remixes, and DJ sets, KISS is loosely strung together by stories of falling in love so hard that the emotional whirlwind rivals a Bachelor contestant being picked on by the show producers. Throughout the tape, as the beats freak the hell out, Heaven drops in hilariously ridiculous ground rules for her man. On “No Friends,” he must drop all of his female childhood pals and disappear from the internet so no other girl can lay their plotting eyes on him. On “No Heart,” he must be willing to be taken to the afterlife in her name. All the scenes of love, horniness, or frustration start with her man either obeying her conditions or trying to weasel his way out of monogamy.",
      "author": "Alphonse Pierre",
      "published_date": "2025-02-18",
      "word_count": 516,
      "fetch_timestamp": "2025-08-20T08:46:35.517226",
      "metadata": {
        "char_count": 3141,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:46:35.517217"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/mason-lindahl-kissing-rosy-in-the-rain/",
      "source": "pitchfork",
      "artist_name": "KISS",
      "title": "Mason Lindahl: Kissing Rosy in the Rain",
      "content": "---\ntitle: Mason Lindahl: Kissing Rosy in the Rain\nauthor: Grayson Haver Currin\nurl: https://pitchfork.com/reviews/albums/mason-lindahl-kissing-rosy-in-the-rain/\nhostname: pitchfork.com\ndescription: Read Grayson Haver Currin’s review of the album.\nsitename: Pitchfork\ndate: 2021-01-25\n---\nMason Lindahl skipped the great solo-guitar surge of the last decade. In 2009, the North California native debuted with Serrated Man Sound, a quixotic collection of post-New Weird American pastiche. He sighed like M. Ward and cooed like Devendra Banhart, howled like the Dodos and crooned like Vetiver. Inchoate as it was, Serrated Man Sound didn’t cause a ripple in a scene that was already evaporating. The record’s real thrills, though, were its glimmers of guitar heroism—the dizzying dynamics of “No Man,” the phosphorescent flickers of “Nine.” “What if he just shut up and played?” one might have wondered, a conundrum that has vexed decades of fingerstyle giants. We never found out: While William Tyler, Gwenifer Raymond, and Steve Gunn navigated new routes from beneath the shadow cast by late colossus Jack Rose, Lindahl disappeared.\nOr so it seemed. Lindahl’s first album in a dozen years and first since migrating to New York, Kissing Rosy in the Rain is as enchanting and emotive as any of the solo guitar records released during his extended absence. Tender, melancholy, and candid, these nine songs for nylon-stringed guitar suggest a gnarled apple tree bare in winter—muted wonders, suspended somewhere between sweetness and sadness. As its name and rapturous title track suggest, Kissing Rosy in the Rain is a remarkable distillation of nature’s bittersweet cycles, especially the way love eventually entails loss, and loss sometimes offers a new start.\nThe first thing you may notice about Kissing Rosy in the Rain is the sweep of its beauty. With little more than his guitar and occasional electronics, Lindahl weaves melodies and layers harmonies as though buttressed by a miniature orchestra, much like his predecessor James Blackshaw. You can imagine opener “Sky Breaking, Clouds Falling” replicated in some lavish concert hall, or the patient “Outside Laughing” rearranged for a string quartet. “Distress” and “Deep Wish,” meanwhile, summon the romantic dynamics of flamenco, where tufts of notes pause to exhale as if the music were a living organism. This majesty betrays more than a whiff of Windham Hill and ECM, stables whose instrumentalists have often been lampooned for meticulousness that borders on pedantry.\nBut these songs are pretty without being precious, more concerned with emotional integrity than sonic purity. Listen closely, and you’ll hear Lindahl lift from a string too soon or the noise inside the studio interrupt an otherwise silent rest. In fact, were the layers beneath these tracks not so deliberate and subtle—the baleful organ drone under the dirge “In Lieu,” the kaleidoscopic smears around “Sky Breaking, Clouds Falling”—these songs might be mistaken for improvisations, made in a such a way that the occasionally aberrant note or creaking chair couldn’t be corrected in a subsequent take. “Soft Light” feels like a brief meditation on chronic self-doubt, as patient but intense as an improvisation by impressionistic mage Loren Connors.",
      "author": "Grayson Haver Currin",
      "published_date": "2021-01-25",
      "word_count": 504,
      "fetch_timestamp": "2025-08-20T08:46:35.551310",
      "metadata": {
        "char_count": 3281,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:46:35.551302"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/the-garden-kiss-my-super-bowl-ring/",
      "source": "pitchfork",
      "artist_name": "KISS",
      "title": "The Garden: Kiss My Super Bowl Ring",
      "content": "---\ntitle: The Garden: Kiss My Super Bowl Ring\nauthor: Abby Jones\nurl: https://pitchfork.com/reviews/albums/the-garden-kiss-my-super-bowl-ring/\nhostname: pitchfork.com\ndescription: Fusing ’80s-inspired hardcore with playful electronics, the Shears brothers’ bass-and-drums duo enlists a handful of high-profile collaborators in their mission for “total freedom of expression.”\nsitename: Pitchfork\ndate: 2020-03-16\n---\nThe Garden like to make a spectacle of themselves. At a release party celebrating their 2018 album Mirror Might Steal Your Charm, the striking rock duo made a French circus tent their stage; the band’s members, identical twins Wyatt and Fletcher Shears, performed the show’s first half in face paint and medieval jester garb, an image that’s replicated in many of their music videos. They’re not just a band, this campy aesthetic seems to claim—they’re entertainers. And whether it’s in their off-the-wall live performances, their side gigs modeling for designers like Saint Laurent, or their irreverent brand of experimental punk, the Garden want your attention. Convention has never been their intent, and their new album Kiss My Super Bowl Ring is their most unorthodox release to date.\nThe Shears brothers formed the Garden as teenagers in 2011, taking early inspiration from eclectic ’80s punk group the Minutemen. They’ve since operated by a method they call “vada vada”: “total freedom of expression without boundaries or guidelines of any sort.” Kiss My Super Bowl Ring abides by that process, implementing unexpected electronic influences and enlisting left-field producers Dylan Brady of 100 gecs and WHARFWHIT of Kero Kero Bonito. Blown-out bass and jungle breakbeats give the album’s more computerized moments a clubbier feel, while the occasional thrashing drums and searing shrieks recall the band’s hardcore roots. Sprinkle in features from Ariel Pink and flashy New York rapper Le1f, and Super Bowl Ring attempts to wear many hats at once, a frenetic collection of songs that grapple with existential woes and cathartic rage.\nThe Garden sound best at their most upbeat, on songs like the rip-roaring “AMPM Truck,” where Wyatt’s melodic basslines and Fletcher’s snappy drumming take the forefront. At the opposite end of the spectrum, “Sneaky Devil” is loaded with anxiety-ridden industrial elements to inspire freaky dancing and open mosh pits. Songs like these embody the restless anxiety the twins divulge in their lyrics: “A struggle, if you wanna call it that/Hate to burst your bubble, but it is that,” Wyatt sings in the bouncy chorus of “A Struggle,” as if to apologize for disconcerting themes to come. “Sneaky Devil” is just one name-drop away from a diss track: “Fuck you, kid, now I have your address/And in a second I could put your racist ass to bed,” he taunts, after unintelligibly listing things he’s “sick of”—politicians, carbon footprints—with a fury that makes you wonder how long he’s been keeping his anger concealed. “AMPM Truck” reckons with life’s futility after a near-fatal instance of nodding off behind the steering wheel. For a band whose earlier work has bordered on sheer absurdity, the distress and malevolence of Super Bowl Ring feels particularly unnerving.\nAt times, the album can feel erratic. Its first tracks, “Clench to Stay Awake” and “A Struggle,” vacillate between multiple opposing themes with whiplash-inducing suddenness that ultimately sounds haphazard. Slower tracks like “A Fool’s Expedition” and “Lurkin’” plod along in comparison, lacking the frenzy of the album’s brighter moments. However uneven, Kiss My Super Bowl Ring is proudly defiant; the title, Wyatt has clarified, essentially means “kiss my ass.” But where deviation from the norm has spawned countless artistic geniuses, Super Bowl Ring too often comes off as just a hodgepodge of ideas. “Vada vada,” it seems, has hurt the Garden as much as it’s helped them.\nBuy: Rough Trade\n(Pitchfork earns a commission from purchases made through affiliate links on our site.)",
      "author": "Abby Jones",
      "published_date": "2020-03-16",
      "word_count": 619,
      "fetch_timestamp": "2025-08-20T08:46:35.581270",
      "metadata": {
        "char_count": 4011,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:46:35.581263"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/tracks/18538-thurston-moore-chelseas-kiss/",
      "source": "pitchfork",
      "artist_name": "KISS",
      "title": "Thurston Moore: “Chelsea's Kiss”",
      "content": "---\ntitle: Thurston Moore: “Chelsea's Kiss”\nauthor: Marc Hogan\nurl: https://pitchfork.com/reviews/tracks/18538-thurston-moore-chelseas-kiss/\nhostname: pitchfork.com\ndescription: Thurston Moore's newest track is a pointed, patiently scrawled ode to a woman who could use the support.\nsitename: Pitchfork\ndate: 2016-09-23\n---\nIt’s good to hear that a divided Sonic Youth can still be discordantly political. The venerated noise-rockers could often be cryptic, but when the occasion demanded it, they weren’t afraid to wax earnest: “I believe Anita Hill,” Thurston Moore proclaimed, speaking for reasonable people everywhere, on the 1992 punk polemic “Youth Against Fascism.” He hasn’t exactly been subtle lately, earlier this year releasing a single that stitched sound bites from Bernie Sanders speeches into introspective, 12-string acoustic guitar figures that recalled his own mesmerizing 2011 album, Demolished Thoughts.\nThe solo Moore’s benefit single for U.S. Army Private Chelsea Manning, who is currently serving a 35-year military prison sentence for sharing information on Wikileaks, is once again highly topical. But this time, all that righteousness is put to more raucous use. Drummer Ryan Sawyer joins My Bloody Valentine bassist Deb Googe and Nøught guitarist James Sedwards—both of whom reportedly appear on Moore’s upcoming Rock N Roll Consciousness LP—for a hard-hitting eight minutes of dissonant guitar interplay that brings to mind Sonic Youth’s exploratory 1998 album A Thousand Leaves. If lyrics about “the queen, king, first transgender ruler” don’t quite have the simplicity of his earlier declaration about Professor Hill, well, Moore can’t call out “a fascist twerp” on every song.",
      "author": "Marc Hogan",
      "published_date": "2016-09-23",
      "word_count": 246,
      "fetch_timestamp": "2025-08-20T08:46:35.714210",
      "metadata": {
        "char_count": 1707,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:46:35.714204"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/20414-coliseum-anxietys-kiss/",
      "source": "pitchfork",
      "artist_name": "KISS",
      "title": "Coliseum: Anxiety's Kiss",
      "content": "---\ntitle: Coliseum: Anxiety's Kiss\nauthor: Jonathan K Dick\nurl: https://pitchfork.com/reviews/albums/20414-coliseum-anxietys-kiss/\nhostname: pitchfork.com\ndescription: Over the course of 12 years and five albums, Coliseum have grown and shifted without ever abandoning their punk roots or sacrificing their power. Their latest, Anxiety's Kiss, embraces a pop-savvy sound that 2013's Sister Faith only hinted at.\nsitename: Pitchfork\ndate: 2015-05-12\n---\nThe phrase \"grown up\" often feels like a backhanded compliment when applied to a band or its sound. It praises their current efforts by way of dismissing the steps they took to arrive at that destination. In that regard, Coliseum's progression over the course of 12 years and five full-lengths has been less an exercise in growing up and more one of \"growing in\" to a sound, one that hits its highest point on their newest album Anxiety's Kiss, which sharpens all of their musical developments into their finest point yet. The result is a pop-savvy sound that 2013's Sister Faith only hinted at.\nIn the relatively short amount of time of the group's existence, Coliseum has made the label rounds, releasing all but two of their records on different labels. This might be a trivial observation for other bands, but it's been a continual point of distinction for the Kentucky-based three-piece, with each album moving in a pointedly different direction than its predecessor while keeping a rock-solid punk-rock ethos at their base. Beneath every shift, vocalist/guitarist and founding member Ryan Patterson barked his lyrics with absolute fervor and passion.\nWhile their punk roots remain wholly intact, the band has grown into a comfortable but still-powerful force. Much of that growth can be attributed to bassist Kayhan Vaziri and drummer Carter Wilson, both relatively recent additions to the band who have proven invaluable in fleshing out the band's sound. Paired with Wilson's straightforward, loosely executed rhythmic style, Vaziri's bass works as much melodic nuance into the songs as Patterson's guitar.\nAnxiety's Kiss wastes no time in announcing its intentions with the radio-ready \"We Are the Water\", a pop-punk anthem owing as much to the Replacements as it does to Fucked Up, complete with gang-vocal refrain. The post-punk-tinged followup \"Dark Light of Seduction\" chases the immediacy with a slow burning churn, and a subdued layer of electronic noise that the band has folded into their mix over the last two albums. This muted sense of nuance is what gives Coliseum's music an amorphous tendency, and while that's sometimes worked against them in the past, here it allows them to shift weightlessly from near post-rock atmospherics on the outstanding \"Dark Light of Seduction\" to blistering anthems like \"Drums & Amplifiers\", all without losing a core sense of focus.\nJust shy of 40 minutes, Anxiety's Kiss packs in a surprising amount of singalong hooks, and you can sense their comfort with them. They've always had these proclivities lurking in the background, and this time around they embrace them as the next logical step. For longtime followers of the band, Anxiety's Kiss has the feel of a logical endpoint, the latest natural development in an impressive career of progressions.",
      "author": "Jonathan K Dick",
      "published_date": "2015-05-12",
      "word_count": 513,
      "fetch_timestamp": "2025-08-20T08:46:35.745656",
      "metadata": {
        "char_count": 3260,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:46:35.745649"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/18458-the-weeknd-kiss-land/",
      "source": "pitchfork",
      "artist_name": "KISS",
      "title": "The Weeknd: Kiss Land",
      "content": "---\ntitle: The Weeknd: Kiss Land\nauthor: Ian Cohen\nurl: https://pitchfork.com/reviews/albums/18458-the-weeknd-kiss-land/\nhostname: pitchfork.com\ndescription: Following three mixtapes released in quick succession that contained some of the most influential and gripping R&B of the new decade, Abel Tesfaye's bleak and atmospheric project makes its major label debut.\nsitename: Pitchfork\ndate: 2013-09-09\n---\nThink about how some other male R&B artists might have worked with a title like \"Kiss Land\": in the hands of R. Kelly, perhaps it becomes his latest conceptual dramedy, an inset of the geography surveyed on “Sex Planet”. For Robin Thicke, it could serve as more proof of his insatiable need to be liked and his utter inability to look cool. Like The 20/20 Experience, the name Kiss Land brings to mind a family-friendly theme park overseen by pop music’s most tireless crowd pleaser. And if Miguel made a song called “Kiss Land”, it could be delivered with a wink, total sincerity, or, most likely, some combination thereof. But it's the name of the Weeknd’s first true major-label release, and the title track boasts characteristically lecherous lines like \"not really into kisses leading into nothing.\" As such, Kiss Land scans as unintentionally hilarious, a sign that the project is rushing headlong into self-parody and Abel Tesfaye seems to be the only one who doesn’t realize it.\nGiven that, it makes sense that Tesfaye has followed up Trilogy, a compilation of his highly influential and gripping 2011 mixtapes, with the rock'n'roll trope that results from ego and self-awareness becoming inversely proportional: a concept album about “life on the road.\" I could tell you that Kiss Land is dolorous, hook-averse, emotionally despondent, and says appalling things to women 85% of the time, but that was also true of Trilogy. Thing is, the earlier material also had some indelible melodies (mostly on House of Balloons), innovative textures (mostly on Thursday), and all-consuming atmosphere (mostly on Echoes of Silence). Kiss Land does manage some of the latter two qualities, but to seriously diminishing returns.\nWhile it doesn’t stretch far beyond the boundaries established by Trilogy, Kiss Land is a reflection of the Weeknd’s new reality, of what happens when studio nerds have access to massive appearance fees and the finest engineers in the world. A disembodied Emika sample and lithe, menacing drum programming evoke an android sadness on “Professional” that makes Tesfaye actually sound believable when he tries to turn the V.I.P. into “Atrocity Exhibition”. On “Adaptation”, the Police sound as threatening as any of the dancehall apparitions that haunted Yeezus, while on “Belong to the World”, the percussion of Portishead’s “Machine Gun” is slightly reconfigured and jacked up to punishing speed. The best songs here bring the Weeknd closer to where the project started on the comparitively pop-oriented House of Balloons. “Wanderlust” is springy disco that moves with unusual vigor, and in pitching up its vocal samples rather than screwing them down, it imparts Tesfaye getting caught up in the moment, left a little breathless. And while the Drake feature “Live For” is more or less a rewrite of *Take Care’*s “Crew Love”, it signifies happiness even if it doesn’t express it. Otherwise, without any strong melodic tether, songs drift by like the window view from a redeye flight, where the free champagne blurs the bloodshot sunrises and indistinguishable cloud banks.",
      "author": "Ian Cohen",
      "published_date": "2013-09-09",
      "word_count": 550,
      "fetch_timestamp": "2025-08-20T08:46:35.786607",
      "metadata": {
        "char_count": 3502,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:46:35.786594"
      }
    },
    {
      "url": "https://pitchfork.com/reviews/albums/",
      "source": "pitchfork",
      "artist_name": "KISS",
      "title": "New Albums & Music Reviews",
      "content": "---\ntitle: New Albums & Music Reviews\nauthor: Condé Nast\nurl: https://pitchfork.com/reviews/albums/\nhostname: pitchfork.com\ndescription: Daily reviews of every important album in music\nsitename: Pitchfork\ndate: 2025-08-20\ntags: ['web']\n---\nSkip to main content\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nNews\nReviews\nBest New Music\nFeatures\nLists\nColumns\nVideo\nOpen Navigation Menu\nMenu\nNewsletter\nSearch\nSearch\nAlbums\nAlbums\nBest New Albums\nBest New Reissues\n8.0+ reviews\nSunday Reviews\nTracks\nRap\nStar Line\nChance the Rapper\nBy\nAlphonse Pierre\nAugust 20, 2025\nRock\nLove Is Like\nMaroon 5\nBy\nLinnie Greene\nAugust 20, 2025\nExperimental\nKhadim\nMark Ernestus’ Ndagga Rhythm Force\nBy\nRae-Aila Crumble\nAugust 20, 2025\nPop/R&B\nAIN’T NO DAMN WAY!\nKaytranada\nBy\nAndrew Ryce\nAugust 19, 2025\nFolk/Country\nMusic for Writers\nSteve Gunn\nBy\nStephen M. Deusner\nAugust 19, 2025\nRock\nRacing Mount Pleasant\nRacing Mount Pleasant\nBy\nIan Cohen\nAugust 19, 2025\nPop/R&B\nBaby\nDijon\nBest New Album\nBy\nIvy Nelson\nAugust 18, 2025\nRock\nEasier Said Than Done\nPool Kids\nBy\nHannah Jocelyn\nAugust 18, 2025\nRap\nF.L.I.N.T. (Feeling Like I’m Not Through)\nRio Da Yung OG\nBy\nDonald Morrison\nAugust 18, 2025\nSongs in the Key of Z\nVarious Artists\nBy\nBrad Shoup\nAugust 17, 2025\nFolk/Country\n/\nRock\nInterior Live Oak\nCass McCombs\nBy\nBrian Howe\nAugust 16, 2025\nRock\nHail to the Thief (Live Recordings 2003-2009)\nRadiohead\nBy\nMolly Mary O’Brien\nAugust 15, 2025\nRock\nSunshine and Balance Beams\nPile\nBy\nZach Schonfeld\nAugust 15, 2025\nRock\nUtero Dei\nMondo Lava\nBy\nSam Goldner\nAugust 15, 2025\nRap\n/\nRock\nlost americana\nMGK\nBy\nDrew Millard\nAugust 14, 2025\nRock\n/\nExperimental\nGIANT OPENING MOUTH ON THE GROUND\nPhil Elverum / Arrington de Dionyso\nBy\nDaniel Bromfield\nAugust 14, 2025\nRap\nSUMMERSONGS\nwolfacejoeyy\nBy\nSamuel Hyland\nAugust 14, 2025\nRap\nVanisher, Horizon Scraper\nQuadeca\nBy\nKieran Press-Reynolds\nAugust 13, 2025\nElectronic\nSound Bath\ncoatshek\nBy\nAndrew Ryce\nAugust 13, 2025\nFolk/Country\nSurrender Instead\nField Medic\nBy\nGrace Robins-Somerville\nAugust 13, 2025\nRock\nABOMINATION REVEALED AT LAST\nOsees\nBy\nNina Corcoran\nAugust 12, 2025\nElectronic\nAnyway\nAnamanaguchi\nBy\nIan Cohen\nAugust 12, 2025\nRap\nFLAVAZ\nRecoechi\nBy\nDash Lewis\nAugust 12, 2025\nRock\nBugland\nNo Joy\nBest New Album\nBy\nSadie Sartini Garner\nAugust 11, 2025\nRap\nPressing Onward\nBig Freedia\nBy\nMatthew Ismael Ruiz\nAugust 11, 2025\nElectronic\nLove & Ponystep\nVylet Pony\nBy\nKieran Press-Reynolds\nAugust 11, 2025\nPop/R&B\nSecrets\nToni Braxton\nBy\nClover Hope\nAugust 10, 2025\nFolk/Country\nThe Making of Five Leaves Left\nNick Drake\nBest New Reissue\nBy\nGrayson Haver Currin\nAugust 9, 2025\nPop/R&B\nBlack Star\nAmaarae\nBest New Album\nBy\nWalden Green\nAugust 8, 2025\nRock\nwhen i paint my masterpiece\nAda Lea\nBy\nMarissa Lorusso\nAugust 8, 2025\nRock\nThe Villain\nMal Blum\nBy\nLiam Whitworth\nAugust 8, 2025\nRock\nWilloughby Tucker, I’ll Always Love You\nEthel Cain\nBy\nOlivia Horn\nAugust 7, 2025\nRock\nNo Rain, No Flowers\nThe Black Keys\nBy\nStephen Thomas Erlewine\nAugust 7, 2025\nExperimental\n/\nPop/R&B\nLove Language\nAli Sethi\nBy\nBhanuj Kappal\nAugust 7, 2025\nRap\nMetro Boomin Presents: A Futuristic Summa (Hosted by DJ Spinz)\nMetro Boomin\nBy\nMatthew Ritchie\nAugust 6, 2025\nExperimental\nRadio Libertadora!\nDJ K\nBy\nHarry Tafoya\nAugust 6, 2025\nRap\nonce more\nEP\nXaviersobased\nBy\nOlivier Lafontant\nAugust 6, 2025\nRock\nMic City Sons (30th Anniversary)\nHeatmiser\nBest New Reissue\nBy\nJayson Greene\nAugust 5, 2025\nElectronic\nElectronic Dream 2\nAraabMuzik\nBy\nAndrew Ryce\nAugust 5, 2025\nPop/R&B\nPILLZCASSO\n2pillz\nBy\nJoshua Minsoo Kim\nAugust 5, 2025\nRock\nTHE FUTURE IS HERE AND EVERYTHING NEEDS TO BE DESTROYED\nThe Armed\nBy\nAlex Robert Ross\nAugust 4, 2025\nRock\nBrute Fact/Home Truth\nRounak Maiti\nBy\nBhanuj Kappal\nAugust 4, 2025\nRap\nGenesis\nTommy Genesis\nBy\nAJ Morris\nAugust 4, 2025\nRock\nPony Express Record\nShudder to Think\nBy\nPhilip Sherburne\nAugust 3, 2025\nPop/R&B\nBITE ME\nReneé Rapp\nBy\nWalden Green\nAugust 2, 2025\nRock\nIf Not Winter\nWisp\nBy\nKieran Press-Reynolds\nAugust 1, 2025\nElectronic\nVolver\nEP\nSofia Kourtesis\nBy\nEric Torres\nAugust 1, 2025\nRap\nart Pop * pop Art\nzayALLCAPS\nBy\nSamuel Hyland\nAugust 1, 2025\nRap\nAlfredo 2\nFreddie Gibbs / The Alchemist\nBy\nPaul A. Thompson\nJuly 31, 2025\nRap\nMASA\nYoungBoy Never Broke Again\nBy\nMatthew Ritchie\nJuly 31, 2025\nRap\nNew Detroit\nLelo\nBy\nAlphonse Pierre\nJuly 31, 2025\nPop/R&B\nVeronica Electronica\nMadonna\nBy\nOwen Myers\nJuly 30, 2025\nRock\nClassic Love (ep)\nKurt Vile\nBy\nStephen M. Deusner\nJuly 30, 2025\nRap\nSoli Deo Gloria\nHomeboy Sandman / Sonnyjim\nBy\nDean Van Nguyen\nJuly 30, 2025\nExperimental\nEdits\nChuquimamani-Condori\nBy\nSam Goldner\nJuly 29, 2025\nRap\nRockstar Junkie\nLoe Shimmy\nBy\nDonald Morrison\nJuly 29, 2025\nRock\nI Love People\nCory Hanson\nBy\nRyan Meehan\nJuly 29, 2025\nRock\nPrecipice\nIndigo De Souza\nBy\nGrace Robins-Somerville\nJuly 28, 2025\nElectronic\nJuggling Dualities\nrRoxymore\nBy\nJoshua Minsoo Kim\nJuly 28, 2025\nRock\nAutofiction\nFar Caspian\nBy\nNina Corcoran\nJuly 28, 2025\nElectronic\n/\nPop/R&B\nDewdrops in the Garden\nDeee-Lite\nBy\nRich Juzwiak\nJuly 27, 2025\nFolk/Country\nSnipe Hunter\nTyler Childers\nBy\nMillan Verma\nJuly 26, 2025\nRock\nNew Threats From the Soul\nRyan Davis & the Roadhouse Band\nBest New Album\nBy\nSam Sodomsky\nJuly 25, 2025\nElectronic\nCuntry\nCleo Reed\nBy\nVrinda Jagota\nJuly 25, 2025\nRock\nLove Is a Dog From Hell EP\nforty winks\nBy\nShaad D’Souza\nJuly 25, 2025\nRap\nDON’T TAP THE GLASS\nTyler, the Creator\nBy\nStephen Kearse\nJuly 24, 2025\nRap\nThe Emperor’s New Clothes\nRaekwon\nBy\nPete Tosiello\nJuly 24, 2025\nRap\n/\nPop/R&B\nGrady Baby\nAnycia / DJ Drama\nBy\nOlivier Lafontant\nJuly 24, 2025\nRap\nREST IN BASS\nChe\nBest New Album\nBy\nRae-Aila Crumble\nJuly 23, 2025\nRock\nAdventure Club\nLaura Jane Grace\nBy\nLiam Konemann\nJuly 23, 2025\nPop/R&B\nYou’ll Be Alright Kid\nAlex Warren\nBy\nHannah Jocelyn\nJuly 23, 2025\nElectronic\nIIcons\nTwo Shell\nBy\nAndrew Ryce\nJuly 22, 2025\nExperimental\nHiraeth\nSofie Birch / Antonina Nowacka\nBy\nPhilip Sherburne\nJuly 22, 2025\nRock\nOnly Frozen Sky Anyway\nJonathan Richman\nBy\nStephen Thomas Erlewine\nJuly 22, 2025\nRap\nJACKBOYS 2\nJACKBOYS / Travis Scott\nBy\nMatthew Ritchie\nJuly 21, 2025\nExperimental\nDisiniblud\nDisiniblud / Rachika Nayar / Nina Keith\nBy\nMinna Zhou\nJuly 21, 2025\nElectronic\nGrace Joke\nLe Diouck\nBy\nJoseph Francis\nJuly 21, 2025\nFolk/Country\nHow Sad, How Lovely\nConnie Converse\nBy\nSophie Kemp\nJuly 20, 2025\nRock\nThe First Family: Live at the Winchester Cathedral 1967\nSly and the Family Stone\nBy\nDaniel Bromfield\nJuly 19, 2025\nRap\n/\nExperimental\nblack british music (2025)\nJim Legxacy\nBy\nMehan Jayasuriya\nJuly 18, 2025\nRap\nWHO WATERS THE WILTING GIVING TREE ONCE THE LEAVES DRY UP AND FRUITS NO LONGER BEAR?\n$ilkMoney\nBy\nDash Lewis\nJuly 18, 2025\nPop/R&B\nNo Sign of Weakness\nBurna Boy\nBy\nBoutayna Chokrane\nJuly 18, 2025\nRock\nHeadlights\nAlex G\nBest New Album\nBy\nIan Cohen\nJuly 17, 2025\nElectronic\ntraces of the ceiling\nTakako Minekawa\nBy\nJoshua Minsoo Kim\nJuly 17, 2025\nRap\nMy World\nDEMIYAA / Lil Rae\nBy\nAlphonse Pierre\nJuly 17, 2025\nPop/R&B\nSWAG\nJustin Bieber\nBy\nRawiya Kameir\nJuly 16, 2025\nElectronic\nSuspension of Belief\nEP\ngyrofield\nBy\nPhilip Sherburne\nJuly 16, 2025\nRock\nDo It for the Money\nEP\nBrutus VIII\nBy\nSamuel Hyland\nJuly 16, 2025\nRap\nNeighborhood Gods Unlimited\nOpen Mike Eagle\nBest New Album\nBy\nPaul A. Thompson\nJuly 15, 2025\nElectronic\nBeside Myself\nDJ Haram\nBy\nBen Cardew\nJuly 15, 2025\nElectronic\n/\nExperimental\nOnce Was Ours Forever\nJonny Nash\nBy\nDaniel Bromfield\nJuly 15, 2025\nRock\nmoisturizer\nWet Leg\nBy\nAimee Cliff\nJuly 14, 2025\nRap\n/\nPop/R&B\nAll Our Knives Are Always Sharp\nTony Njoku\nBy\nCameron Cook\nJuly 14, 2025\nPop/R&B\nGOODNIGHT HYPNOPOMP\nSTOMACH BOOK\nBy\nJude Noel\nJuly 14, 2025\nRock\nBoys for Pele\nTori Amos\nBy\nEmma Madden\nJuly 13, 2025\nRock\nSpun\nWavves\nBy\nArielle Gordon\nJuly 12, 2025\nNext Page",
      "author": "Condé Nast",
      "published_date": "2025-08-20",
      "word_count": 1319,
      "fetch_timestamp": "2025-08-20T08:46:36.288499",
      "metadata": {
        "char_count": 7698,
        "extraction_method": "trafilatura",
        "content_type": "review",
        "extracted_at": "2025-08-20T08:46:36.288485"
      }
    }
  ],
  "total_articles": 7,
  "total_words": 4267,
  "extracted_at": "2025-08-20T08:46:36.288887",
  "urls_processed": [
    "https://pitchfork.com/reviews/albums/onlyheaven-kiss-keep-it-short-and-sweet-ep/",
    "https://pitchfork.com/reviews/albums/mason-lindahl-kissing-rosy-in-the-rain/",
    "https://pitchfork.com/reviews/albums/the-garden-kiss-my-super-bowl-ring/",
    "https://pitchfork.com/reviews/tracks/18538-thurston-moore-chelseas-kiss/",
    "https://pitchfork.com/reviews/albums/20414-coliseum-anxietys-kiss/",
    "https://pitchfork.com/reviews/albums/18458-the-weeknd-kiss-land/",
    "https://pitchfork.com/reviews/albums/"
  ]
}