{
  "artist_name": "Elton John",
  "source": "billboard",
  "articles": [
    {
      "url": "https://www.billboard.com/video/nicki-minaj-surprises-fans-on-tour-ice-spices-acting-debut-more/",
      "source": "billboard",
      "artist_name": "Elton John",
      "title": "Nicki Minaj Surprises Fans on Her ‘Pink Friday 2’ Tour, Ice Spice Makes Acting Debut & Megan Thee Stallion Talks About Her Third Album | Billboard News",
      "content": "---\ntitle: Nicki Minaj Surprises Fans on Her ‘Pink Friday 2’ Tour, Ice Spice Makes Acting Debut & Megan Thee Stallion Talks About Her Third Album | Billboard News\nauthor: Katie Cao\nurl: https://www.billboard.com/video/nicki-minaj-surprises-fans-on-tour-ice-spices-acting-debut-more/\nhostname: billboard.com\ndescription: Nicki Minaj Surprises Fans On Her ‘Pink Friday 2’ tour, Ice Spice Makes Acting Debut & Megan Thee Stallion Talks About Her Third Album and More\nsitename: Billboard\ndate: 2024-04-11\ncategories: ['Videos']\ntags: ['billboard news, CapOne2024Festivals']\n---\nIt’s Thursday April 11th and welcome to Gag City! Nicki Minaj surprises her fans with multiple special guests at the Boston stop of her ‘Pink Friday 2’ world tour, Ice Spice will make her acting debut as she joins Spike Lee and Denzel Washington’s upcoming film ‘High and Low,’ Megan Thee Stallion talks about how her third album will be a “rebirth” for her as she continues her next era of music, we talk about all the festivals you should be going to from Coachella to Lovers and Friends, Keith Urban shares 5 things you didn’t know about his new song “Straight Line,” Hozier and Jojo Siwa make noise on the TikTok Billboard top 50, Billboard looks back at when Lady Gaga, TLC and Elton John’s “Pokerface,” “No Scrubs” and “Bennie and The Jets” went to No. 1 on the Hot 100.\nTetris Kelly:\nNicki’s girls, Meg’s album and Ice’s movie. We tell you what’s going down this festival season. Keith Urban breaks down his new song. We see who’s on top of the TikTok chart and take a look at past Hot 100 topics. It’s Thursday, April 11, and welcome to Billboard News. I am itching to get to the desert, but it’s only Thursday and we’ve got news to cover so let’s run it down. Nicki’s guests, Meg’s new music and Ice’s acting debut there’s a lot going on with the women in rap.\nNicki Minaj surprised fans at the Boston stop of her Pink Friday 2 world tour, where she brought out the queen mix girls doing “Super Freaky Girl.” JT, BIA, Katie Got Bandz, Akbar V and Malibu Mitch all took the stage to rap their verses. One of Nicki’s other collaborators is about to make her big screen debut. Ice Spice is headed to the movies. She joins Spike Lee and Denzel Washington’s fifth film. The film is a remake of the 1963 Japanese hit, “High and Low.” And we’re getting even more from the women of rap. Megan Thee Stallion describes her new album as a rebirth. She told Women’s Health that after being shot by Tory Lanez and the public’s reaction to the trial, she went through a dark time and found therapy. Now she says “I was inspired to create this album about rebirth because I am becoming a new person, physically and mentally.”\nWatch to find out more!",
      "author": "Katie Cao",
      "published_date": "2024-04-11",
      "word_count": 471,
      "fetch_timestamp": "2025-08-20T17:07:33.226569",
      "metadata": {
        "char_count": 2717,
        "extraction_method": "trafilatura",
        "content_type": "interview",
        "extracted_at": "2025-08-20T17:07:33.226561"
      }
    },
    {
      "url": "https://www.billboard.com/culture/product-recommendations/elton-john-candles-scents-qvc-buy-online-1236046225/",
      "source": "billboard",
      "artist_name": "Elton John",
      "title": "Elton John Releases New Candles for Fall: Shop the Rocketman-Approved Scents Here",
      "content": "---\ntitle: Elton John Releases New Candles for Fall: Shop the Rocketman-Approved Scents Here\nauthor: Amina Ayoud\nurl: https://www.billboard.com/culture/product-recommendations/elton-john-candles-scents-qvc-buy-online-1236046225/\nhostname: billboard.com\ndescription: Elton John dropped a bunch of fall scented candles on QVC's website. We've rounded up a few of our favorites and we're showing you how to shop them.\nsitename: Billboard\ndate: 2025-08-18\ncategories: ['Product Recommendations']\ntags: ['Elton John, Product Recommendations, sale']\n---\nAll products and services featured are independently chosen by editors. However, Billboard may receive a commission on orders placed through its retail links, and the retailer may receive certain auditable data for accounting purposes.\nFall is just around the corner, and everyone is celebrating, including Elton John.\nThe beloved musician teamed up with Slatkin + Co. to create new fall-centric scents, and they’re currently on sale on QVC’s website. The collection includes three new candle offerings with cozy scents starting at just $79.98. Whether you’re a fan of John or just a lover of a good, scented candle, these pieces are the perfect way to get yourself and your home into the fall spirit. Not only are these candles deliciously scented, they’re also packaged beautifully with nods to John and his historic home in Woodside in Berkshire, U.K. We broke down the new scented selection, talking pricing, burn time and scents so you can make the most educated decision before adding to cart.\nThis candle offering is pure comfort in a scent. The 80oz Cinnamon Cashmere candle is currently on sale for $109.98 and is scented with grated cinnamon bark, all cozied up in cashmere. You’ve also got a blend of deep winter rose and patchouli, bringing depth to the scent. The candle has five wicks and burns for approximately 109 hours. Cinnamon Cashmere is nestled into a glass container embossed with an abstract piano key-inspired print, a nod to John’s storied music career.\nThis new piece in John’s candle line is currently on sale for $109.98. The 80oz English Oak and Amber candle comes with five wicks and is scented like mulled spices, oak and olden Amberwood. It’s spicy and woody, reminding us of a tall and oak tree in a fall forest. The candle’s scent is inspired by John and his friends’ tradition of gifting each other trees to plant on their properties. The vessel the candle is in is made of cream-colored glass with a unique embossed print meant to look like piano keys, like our last entry. This candle burns for approximately 109 hours.\nTrending on Billboard\nPackaged in a decorative embossed silver ceramic container, this candle is inspired by John’s Woodside home. The 50oz piece is currently on sale for $79.98 and is scented like cozy and festive fresh orange pomander, fir balsam, amber and cinnamon bark, transforming any space into a fall-centric sanctuary. This candle has six wicks and boasts a burn time of 70 to 100 hours. We recommend styling this candle as a centerpiece on a table or vanity, creating an elegant finish.\nIf you’re not ready to let go of summer just yet, this set is for you. While it’s not a new offering, it is one worth shopping given you get three candles for the price of one. Each candle comes in a color-coordinated glass. You’ve got fragrances like Apple Mint Tea in the mint-colored glass, Rhubarb Strawberry Crumble in the red glass and Sugared Pear and Vanilla in the yellow glass. The set is meant to evoke spring and summer days at John’s Woodside home, specifically cherished spaces like the home’s orchards, kitchen and rose garden. Each candle burns up to 25 to 35 hours and is nestled in a wicker hamper basket that gives us picnic vibes.",
      "author": "Amina Ayoud",
      "published_date": "2025-08-18",
      "word_count": 613,
      "fetch_timestamp": "2025-08-20T17:07:33.285138",
      "metadata": {
        "char_count": 3754,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T17:07:33.285132"
      }
    },
    {
      "url": "https://www.billboard.com/music/music-news/elton-john-35-years-of-sobriety-1236034069/",
      "source": "billboard",
      "artist_name": "Elton John",
      "title": "Elton John Marks 35 Years of Sobriety: ‘Grateful for All the Love’",
      "content": "---\ntitle: Elton John Marks 35 Years of Sobriety: ‘Grateful for All the Love’\nauthor: Jessica Lynch\nurl: https://www.billboard.com/music/music-news/elton-john-35-years-of-sobriety-1236034069/\nhostname: billboard.com\ndescription: Elton John has celebrated a major personal milestone, marking 35 years of sobriety with a heartfelt message to fans and family on July 29.\nsitename: Billboard\ndate: 2025-07-31\ncategories: ['Music News']\ntags: ['Billboard UK, Music News']\n---\nElton John has celebrated a major personal milestone, marking 35 years of sobriety with a heartfelt message to fans and family on July 29.\nThe music legend took to Instagram to commemorate the date with a photo of handmade cards from his sons, Elijah and Zachary, alongside a bouquet of flowers. “Grateful for all the love on my sobriety birthday,” he captioned the post, which drew thousands of comments from fans and friends.\nJohn, 78, has long been open about his past struggles with addiction and the transformative power of recovery.\nHis battle with alcohol, marijuana and what he once called his “worst best friend” — cocaine — was dramatized in the 2019 biopic Rocketman. In interviews, he has spoken candidly about the extremes of his life during the height of his fame.\nTrending on Billboard\n“It nearly destroyed my soul,” he told CBS News in October 2019 of his addiction. “My soul was black, like a charred piece of steak, until I said, ‘I need help.’ And suddenly, a little pilot light in my soul came along going, ‘Yes, I’m still here. I’m still here. I’m still here. I can still be rescued.’”\nThe turning point, John has said, came after the 1990 death of Ryan White, a teenage AIDS activist whom he befriended. That same year, John checked himself into Chicago’s Parkside Lutheran Hospital on July 29, beginning what would become a decades-long journey in recovery. In 2023, he posted a photo of his sobriety chip with the words: “34 years clean and sober. My life has never been better.”\n“My sobriety has brought me everything that I could possibly wish for,” he reflected in a 1994 interview. “I am a survivor. I’ve survived a lot of things. Life is full of pitfalls, even when you’re sober. I can deal with them now because I don’t have to run away and hide.”\nNow, John continues to be a source of support for others in recovery. He’s publicly helped artists like Boy George through sobriety and revealed in his memoir Me that he was Eminem’s Alcoholics Anonymous sponsor.",
      "author": "Jessica Lynch",
      "published_date": "2025-07-31",
      "word_count": 408,
      "fetch_timestamp": "2025-08-20T17:07:33.334463",
      "metadata": {
        "char_count": 2461,
        "extraction_method": "trafilatura",
        "content_type": "news",
        "extracted_at": "2025-08-20T17:07:33.334457"
      }
    },
    {
      "url": "https://www.billboard.com/music/rock/elton-john-stonehenge-video-spinal-tap-ii-the-end-continues-1236034176/",
      "source": "billboard",
      "artist_name": "Elton John",
      "title": "Elton John Gets Druid With It in ‘Stonehenge’ Remake Video From ‘Spinal Tap II: The End Continues’",
      "content": "---\ntitle: Elton John Gets Druid With It in ‘Stonehenge’ Remake Video From ‘Spinal Tap II: The End Continues’\nauthor: Gil Kaufman\nurl: https://www.billboard.com/music/rock/elton-john-stonehenge-video-spinal-tap-ii-the-end-continues-1236034176/\nhostname: billboard.com\ndescription: Elton John turns it up to 11 with Spinal Tap in a new video remake of their iconic anthem 'Stonehenge' from the soundtrack of the upcoming sequel.\nsitename: Billboard\ndate: 2025-07-31\ncategories: ['Rock']\ntags: ['Billboard UK, genre rock, movies, Music News']\n---\nThe band is fake, but the cameo is real. Elton John makes a hilarious pop-in for an updated version of Spinal Tap’s iconic tribute to the place where demons dwell, banshees wail and children dance to the pipes of pan in a just-released video for “Stonehenge.”\nThe single appears on the soundtrack album, The End Continues, a companion to the upcoming sequel to the OG mockumentary, 1984’s This Is Spinal Tap. The 13-track LP, due out alongside the film, Spinal Tap II: The End Continues, on Sept. 12, features a return to some of the farcical band’s most beloved tracks with help from John (“Flower People”), Garth Brooks and Trisha Yearwood (“Big Bottom”) and Sir Paul McCartney (“Cups and Cakes”).\nFollowing the signature ominously silly intro from guitarist/singer Nigel Tufnel (Christopher Guest) — “In ancient times/ Hundreds of years before the dawn of history/ Lived a strange race of people, the Druids” — John emerges from the depths of the stage, throws off his hooded cloak and gets to Tapping.\nTrending on Billboard\n“Stonehenge! Where the demons dwell/ Where the banshees live and they do live well/ Stonehenge! Where a man’s a man/ And the children dance to the Pipes of Pan,” John sings over the song’s prog rock thunder and unnecessary series of instrumental solos. Whether he’s singing about crying dew drops or cats meowing, John capably rocks the arena, except this time, instead of the embarrassingly puny 18-inch recreation of the iconic prehistoric megalithic stone structures in rural England from the original film, the band’s crew got the proportions right and a massive, 18-foot-high rock arch descends from the rafters in time for mandolin and gong solos.\nJohn totally got into the spirit of the bit on Instagram, writing, “This was a blast, rocking out with @spinaltap for their new movie, Spinal Tap II: The End Continues, and re-recording their epic ‘Stonehenge’ – this one is best played at volume 11!”\nAlong with the returns of the four Tap classics, the album will also feature nine new songs with predictably laughable titles, including: “Let’s Just Rock Again,” “Brighton Rock,” “The Devil’s Just Not Getting Old,” “Rockin’ in the Urn” and “Blood to Let.”\nWhen the movie hits screens in September, director Marty DiBergi (Rob Reiner) will be back in the fold to crank the joke amps up one louder, along with guitarist/singer David St. Hubbins (Michael McKean), bassist Derek Smalls (Harry Shearer) and Polymer Records publicist Bobbi Fleckman (Fran Drescher). There will also be cameos from McCartney, John, Brooks and Yearwood, the Roots’ Questlove and Red Hot Chili Peppers drummer Chad Smith and Metallica timekeeper Lars Ulrich.\nWatch John rock “Stonehenge” below.",
      "author": "Gil Kaufman",
      "published_date": "2025-07-31",
      "word_count": 513,
      "fetch_timestamp": "2025-08-20T17:07:33.385052",
      "metadata": {
        "char_count": 3247,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T17:07:33.385046"
      }
    },
    {
      "url": "https://www.billboard.com/pro/ai-copyright-debate-elton-john-artists-involved/",
      "source": "billboard",
      "artist_name": "Elton John",
      "title": "The Fight Over AI Is Just Beginning, and Artists Like Elton John Are Leading the Way",
      "content": "---\ntitle: The Fight Over AI Is Just Beginning, and Artists Like Elton John Are Leading the Way\nauthor: Robert Levine\nurl: https://www.billboard.com/pro/ai-copyright-debate-elton-john-artists-involved/\nhostname: billboard.com\ndescription: In the AI copyright debate, Elton John and other artists are getting involved in fighting tech companies that are trying to relax copyright law.\nsitename: Billboard\ndate: 2025-06-18\ncategories: ['Tech']\ntags: ['AI, Artificial Intelligence, David Furnish, follow the money']\n---\nThe Fight Over AI Is Just Beginning, and Artists Like Elton John Are Leading the Way\nTechnology companies have more power than ever. But creators still have the moral high ground — and more of them are using it.\nArtificial intelligence is a technology with profound implications — it will soon be smarter than we are! — including for the future of music. So far, though, the debate over the copyright issues involved in training AI algorithms follows a familiar pattern: Rightsholders want a licensing structure to generate royalties, while some technology companies maintain that they don’t need permission and others just proceed without it. To music executives of a certain age, it sounds a bit like the Napster battle, especially since the central issue is fair use. Technology companies seem to have the same plan: Move fast and break things, then try to change the law once consumers get accustomed to the new technology.\nCould this time be different?\nTrending on Billboard\nYes and no, at least to judge by the current state of affairs. In the European Union, which passed the first serious AI legislation, some lawsuits working their way through the courts now — perhaps most importantly GEMA’s case against Suno — will provide more clarity. The situation in the U.S., which seemed to depend on the result of major label lawsuits against Suno and Udio — in which the two sides are negotiating — has been complicated by President Trump’s firing of the Register of Copyrights. In the U.K., the government has been considering loosening copyright by calling for a consultation — but that effort has come under pressure from both music companies and creators.\nTwo weeks ago, at a party to honor the Billboard Global Power Players, Elton John and his manager and husband, David Furnish, won the first-ever Billboard Creators Champion Award for their work fighting the U.K. government’s proposed adjustments to copyright law. That initially involved an amendment to a data bill being debated in parliament that would have forced technology companies to be transparent about the content they used to train their algorithms. The bill repeatedly “ping-ponged” between the House of Commons and the House of Lords as the latter repeatedly voted for the amendment, under the leadership of Baroness Beeban Kidron. Last week, after more back-and-forth, the data bill passed without the amendment.\nThis bill doesn’t affect copyright, although the amendment would have, so it represents only a minor skirmish in what’s shaping up to be a serious fight. John and Furnish aren’t going away, and John’s consistent championing of upcoming artists gives them real moral authority. Other artists are with them, including Paul McCartney and the acts behind the “silent album.” There’s strength in numbers, and the days when companies like Napster could give Metallica a reputational black eye are long since over. Few artists and executives have devoted as much time to the issue as John and Furnish, but they aren’t alone. Besides artists, the entire music business is behind them.\nThey are also fighting a very different battle than Metallica was all those years ago. Back then, the Internet looked much cooler than major label music — more disruptive, in today’s terms — and Metallica got cast, unfairly, as trying to fight the next new thing. At this point, technology companies have grown into a new establishment, with far more political power than the media business ever had. Elton John doesn’t seem like he’s trying to stop the next new thing — he’s trying to make sure that new technology doesn’t get in the way of the next new artists. Metallica’s fight wasn’t actually all that different — people just didn’t understand it very well.\nTechnology companies are pushing some of the same ideas they always have, which now seem almost oddly old-fashioned. The idea is that governments need to relax copyright laws so they can “take the lead” or “get ahead” in “the AI arms race.” This sounds vital, and it is, except that the kind of AI that’s most important is general intelligence, which has very little to do with the kind that can make new songs in the style of, say, Led Zeppelin. That’s just a consumer product. Also, what exactly are governments racing toward? Since AI is expected to eliminate white-collar jobs and the tax revenue that flows from them, what exactly is the hurry?\nThe debate over the U.K. data bill was only just the beginning, and the way John and Furnish framed the issue could influence the debate as it develops. For the next few years, both sides will argue about how compensation will work. But without the kind of transparency that the amendment to the bill mandated, it would be very difficult for technology companies to identify and pay the right creators. Transparency is necessary but not sufficient — it won’t solve the problem, but there can’t be a solution without it. Any serious conversation about compensating artists for the use of their work in AI needs to start there, and thanks to creators, this one has. Let’s see where it goes from here.",
      "author": "Robert Levine",
      "published_date": "2025-06-18",
      "word_count": 919,
      "fetch_timestamp": "2025-08-20T17:07:33.441954",
      "metadata": {
        "char_count": 5595,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T17:07:33.441949"
      }
    },
    {
      "url": "https://www.billboard.com/artist/elton-john/chart-history/hsi",
      "source": "billboard",
      "artist_name": "Elton John",
      "title": "Elton John | Biography, Music & News | Billboard",
      "content": "---\ntitle: Elton John | Biography, Music & News | Billboard\nauthor: Wp-Block-Co-Authors-Plus-Coauthors Is-Layout-Flow\nurl: https://www.billboard.com/artist/elton-john/\nhostname: billboard.com\ndescription: Elton John has been thrilling audiences for more than five decades with his virtuosic piano playing and unforgettable pop-rock hits. He's also written The Lion King soundtrack and raised millions o…\nsitename: Billboard\ndate: 1997-11-10\n---\nCandle In The Wind 1997/Something About The Way You Look Tonight\nElton John\nThat's What Friends Are For\nDionne & Friends Featuring Elton John, Gladys Knight And Stevie Wonder\nDon't Go Breaking My Heart\nElton John & Kiki Dee\nCrocodile Rock\nElton John\nPhiladelphia Freedom\nThe Elton John Band\nLucy In The Sky With Diamonds\nElton John\nDon't Let The Sun Go Down On Me\nGeorge Michael/Elton John\nBennie And The Jets\nElton John\nI Don't Wanna Go On With You Like That\nElton John\nDon't Let The Sun Go Down On Me\nElton John\nGoodbye Yellow Brick Road\nElton John\nLittle Jeannie\nElton John\nCan You Feel The Love Tonight (From \"The Lion King\")\nElton John\nI Guess That's Why They Call It The Blues\nElton John\nSomeone Saved My Life Tonight\nElton John\nThe Bitch Is Back\nElton John\nSad Songs (say So Much)\nElton John\nHold Me Closer\nElton John & Britney Spears\nCandle In The Wind\nElton John\nSorry Seems To Be The Hardest Word\nElton John\nCold Heart (PNAU Remix)\nElton John & Dua Lipa\nMama Can't Buy You Love\nElton John\nI'm Still Standing\nElton John\nSaturday Night's Alright For Fighting\nElton John\nEmpty Garden (Hey Hey Johnny)\nElton John\nGrow Some Funk Of Your Own/I Feel Like A Bullet (In The Gun Of Robert Ford)\nElton John\nThrough The Storm\nAretha Franklin & Elton John\nWho Wears These Shoes?\nElton John\nCircle Of Life (From \"The Lion King\")\nElton John\nA Word In Spanish\nElton John\nPart-Time Love\nElton John\nKiss The Bride\nElton John\nClub At The End Of The Street\nElton John\nBite Your Lip (Get up and dance!)\nElton John\nWritten In The Stars\nElton John & LeAnn Rimes\nVictim Of Love\nElton John\nFlames Of Paradise\nJennifer Rush (Duet With Elton John)\nMerry Christmas\nEd Sheeran & Elton John\n(Sartorial Eloquence) Don't Ya Wanna Play This Game No More?\nElton John\nYou Gotta Love Someone\nElton John\nSomeday Out Of The Blue\nElton John\nMade In England\nElton John\nRecover Your Soul\nElton John\nHeartache All Over The World\nElton John\nTrue Love\nElton John & Kiki Dee\nYou Can Make History (Young Again)\nElton John\nOne Of Me\nLil Nas X Featuring Elton John\nDon't Go Breaking My Heart\nElton John & RuPaul",
      "author": "Wp-Block-Co-Authors-Plus-Coauthors Is-Layout-Flow",
      "published_date": "1997-11-10",
      "word_count": 440,
      "fetch_timestamp": "2025-08-20T17:07:34.428596",
      "metadata": {
        "char_count": 2518,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T17:07:34.428588"
      }
    },
    {
      "url": "https://www.billboard.com/lists/top-tours-co-headliners-all-time/",
      "source": "billboard",
      "artist_name": "Elton John",
      "title": "The 40 Biggest Co-Headline Tours of All Time",
      "content": "---\ntitle: The 40 Biggest Co-Headline Tours of All Time\nauthor: Eric Frankenberg\nurl: https://www.billboard.com/lists/top-tours-co-headliners-all-time/\nhostname: billboard.com\ndescription: A recap of the highest-grossing co-headline tours - from Beyoncé & Jay-Z to Billy Joel & Elton John - in Billboard Boxscore history, by the numbers\nsitename: Billboard\ndate: 2025-06-26\ncategories: ['Chart Beat']\ntags: ['Billboard Boxscore, Touring']\n---\nSeeing your favorite artist on tour can be transcendent. Seeing two of your favorite artists on the same night? Even better.\nOver Billboard Boxscore’s four decades, like-minded artists have paired together to combine forces as co-headliners. Here, we’re looking at the biggest team-ups ever with a list of the 40 biggest co-headline tours in Boxscore history.\nTo qualify for this list, the tour must run for at least 10 shows. That excludes brief collaborations by Post Malone and Red Hot Chili Peppers in 2023 in Australia, and Billy Joel with Sting in 2024-25. But no need to fret, as both Joel and Sting make the list with separate co-headliners.\nSeveral artists on the list appear multiple times. Jay-Z has toured with Beyoncé, Mary J. Blige, and many more through the years. Journey has paired with Def Leppard, The Doobie Brothers, and Steve Miller Band. Enrique Iglesias toured with Pitbull on multiple occasions in the 2010s, with Ricky Martin in 2021, and then with both on The Trilogy Tour (2023-24). Further, certain pairs repeat, highlighted by the many successive editions of Billy Joel and Elton John’s Face to Face tours.\nPer the case of The Trilogy Tour (Iglesias, Martin & Pitbull), the list also includes tours with three equally billed artists. There’s one other trio on the ranking – a trifecta of cross-generational rock bands that used their combined powers to level up from arenas to stadiums.\nTwo tours in the top 40 are ongoing. Tina Fey & Amy Poehler launched The Restless Leg Tour in 2022, playing theaters and then arenas, mixing stand-up, improv and Q&A amid a sea of pop and rock stars. And Kendrick Lamar and SZA kicked off the Grand National Tour in April, and will hop the pond next month for a leg of shows in Europe.\nScroll for a detailed breakdown of the highest-grossing co-headline tours of all time, by the numbers. All data is according to figures reported to Billboard Boxscore.\n-\nCharli xcx & Troye Sivan, Sweat (2024)\nGross: $28M\nTickets: 297K\nShows: 22 -\nPeter Gabriel & Sting, Rock Paper Scissors Tour (2016)\nGross: $29.5M\nTickets: 268K\nShows: 20 -\nGuns N’ Roses/Metallica Stadium Tour (1992)\nGross: $30.3M\nTickets: 1.1M\nShows: 24 -\nChristina Aguilera & Justin Timberlake, The Justified & Stripped Tour (2003)\nGross: $30.3M\nTickets: 546K\nShows: 45 -\nBrooks & Dunn and Reba [McEntire]: The Tour (1997-98)\nGross: $33.3M\nTickets: 838K\nShows: 70 -\nThe Doobie Brothers & Journey, San Francisco Fest 2016 (2016)\nGross: $33.7M\nTickets: 573K\nShows: 48 -\nMary J. Blige & Jay-Z, Heart of the City Tour (2008)\nGross: $34.5M\nTickets: 309K\nShows: 27 -\nJourney & Steve Miller Band Tour (2014-15)\nGross: $34.8M\nTickets: 596K\nShows: 46 -\nBrooks & Dunn and Reba McEntire, Together in Vegas (2015-21)\nGross: $35.1M\nTickets: 247K\nShows: 64 -\nEnrique Iglesias and Ricky Martin Live in Concert (2021)\nGross: $35.2M\nTickets: 312K\nShows: 26 -\nDef Leppard & Journey, Yeah! Tour (2006)\nGross: $35.6M\nTickets: 783K\nShows: 66 -\nChris Brown & Lil Baby, One of Them Ones Tour (2022)\nGross: $36.9M\nTickets: 442K\nShows: 27 -\nLynyrd Skynyrd & ZZ Top, The Sharp Dressed Simple Man Tour (2023-24)\nGross: $37M\nTickets: 596K\nShows: 64 -\nEnrique Iglesias and Pitbull Live! (2017)\nGross: $38M\nTickets: 415K\nShows: 35 -\nEnrique Iglesias & Pitbull, Sex and Love Tour (2014-15)\nGross: $39.3M\nTickets: 462K\nShows: 36 -\nTina Fey & Amy Poehler, The Restless Leg Tour (2022-25)\nGross: $40.8M\nTickets: 263K\nShows: 70 -\nPaul Simon & Sting, On Stage Together (2014-15)\nGross: $44.1M\nTickets: 355K\nShows: 34 -\nFaith Hill & Tim McGraw, Soul2Soul Tour (2000)\nGross: $47.8M\nTickets: 969K\nShows: 65 -\nBackstreet Boys & New Kids on the Block, NKOTBSB Tour (2011-12)\nGross: $48.5M\nTickets: 708K\nShows: 61 -\nBilly Joel & Elton John, Face to Face 2003 (2003)\nGross: $48.9M\nTickets: 422K\nShows: 24 -\nJay-Z & Ye, Watch the Throne Tour (2011-12)\nGross: $49.9M\nTickets: 399K\nShows: 33 -\nBilly Joel & Elton John, Face to Face 1994 (1994)\nGross: $53.2M\nTickets: 1.1M\nShows: 21 -\nReba McEntire & George Strait, 2010-11 Tour (2010-11)\nGross: $55M\nTickets: 682K\nShows: 45 -\nBilly Joel & Elton John, Face to Face 2001 (2001)\nGross: $58.9M\nTickets: 570K\nShows: 31 -\nCarole King & James Taylor, Troubadour Reunion Tour (2010)\nGross: $62.3M\nTickets: 693K\nShows: 54 -\nAerosmith & KISS, Rocksimus Maximus Tour (2003)\nGross: $64.2M\nTickets: 856K\nShows: 58 -\nBilly Joel & Elton John, Face to Face 2002 (2002)\nGross: $66M\nTickets: 613K\nShows: 34 -\nDef Leppard & Journey, The Summer Stadium Tour 2024 (2024)\nGross: $68.4M\nTickets: 462K\nShows: 14 -\nJay-Z & Justin Timberlake, Legends of the Summer Stadium Tour (2013)\nGross: $69.8M\nTickets: 623K\nShows: 14 -\nBilly Joel & Elton John, Face to Face 2009 (2009)\nGross: $90.2M\nTickets: 719K\nShows: 32 -\nFall Out Boy, Green Day & Weezer, The Hella Mega Tour (2021-22)\nGross: $92.2M\nTickets: 967K\nShows: 28 -\nEnrique Iglesias, Ricky Martin & Pitbull, The Trilogy Tour (2023-24)\nGross: $92.9M\nTickets: 566K\nShows: 43 -\nKenny Chesney & Tim McGraw, Brothers of the Sun Tour (2012)\nGross: $96.5M\nTickets: 1.1M\nShows: 23 -\nDef Leppard & Journey 2018 Tour (2018)\nGross: $97.1M\nTickets: 1M\nShows: 60 -\nFaith Hill & Tim McGraw, Soul2Soul: The World Tour (2017-18)\nGross: $100.3M\nTickets: 1.2M\nShows: 107 -\nBeyoncé & Jay-Z, On the Run Tour (2014)\nGross: $109.6M\nTickets: 980K\nShows: 21 -\nFaith Hill & Tim McGraw, Soul2Soul II Tour (2006-07)\nGross: $141.2M\nTickets: 1.7M\nShows: 118 -\nDef Leppard & Mötley Crüe, The Stadium Tour (2022)\nGross: $173.5M\nTickets: 1.3M\nShows: 35 -\nBeyoncé & Jay-Z, On the Run II Tour (2018)\nGross: $253.5M\nTickets: 2.2M\nShows: 48 -\nKendrick Lamar & SZA, Grand National Tour (2025)\nGross: $256.4M\nTickets: 1.1M\nShows: 23",
      "author": "Eric Frankenberg",
      "published_date": "2025-06-26",
      "word_count": 1030,
      "fetch_timestamp": "2025-08-20T17:07:34.491300",
      "metadata": {
        "char_count": 6091,
        "extraction_method": "trafilatura",
        "content_type": "other",
        "extracted_at": "2025-08-20T17:07:34.491294"
      }
    }
  ],
  "total_articles": 7,
  "total_words": 4394,
  "extracted_at": "2025-08-20T17:07:34.491632",
  "urls_processed": [
    "https://www.billboard.com/video/nicki-minaj-surprises-fans-on-tour-ice-spices-acting-debut-more/",
    "https://www.billboard.com/culture/product-recommendations/elton-john-candles-scents-qvc-buy-online-1236046225/",
    "https://www.billboard.com/music/music-news/elton-john-35-years-of-sobriety-1236034069/",
    "https://www.billboard.com/music/rock/elton-john-stonehenge-video-spinal-tap-ii-the-end-continues-1236034176/",
    "https://www.billboard.com/pro/ai-copyright-debate-elton-john-artists-involved/",
    "https://www.billboard.com/artist/elton-john/chart-history/hsi",
    "https://www.billboard.com/lists/top-tours-co-headliners-all-time/"
  ]
}